[
  {
    "chunk_id": 0,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "I really do appreciate that you're all here. I'm going to try and make this as painless as possible. We're not going to do an interactive part. We're going to talk through stuff. I'm happy to go off script. I'm happy to take questions if there's stuff we want to explore at any moment in this. My goal is I'd like to share with you a lot of things that I've learned. Um I'm going to try and make them as actionable as possible. So there is real stuff to do here. Um more than we might in like a more high level talk. But let's be very honest, it is late. It is a lot. It is long. Let's uh let's talk about MCP. I'm hoping that folks here are interested in MCP and that's why you came to this talk. If you're here to learn about MCP, this might be a little bit of a of a different bent. Just show of hands, heard of MCP, used MCP, written in MCP server. Okay. Uh, anyone feel uncomfortable with MCP, which is 100% fine. We can tailor. Okay, then I would say let's let's just go let's dive in. Um, this is who I am. Uh, I'm the founder and CEO of a company called Prefect Technologies. For the last seven or eight years, we've been building um data automation software and orchestration software. Before that, I was a member of the Apache Airflow PMC. Um I originally started Prefect to graduate those same orchestration ideas into data science. Today, we operate the full stack. And then um a few years ago, I I developed an agent framework called Marvin, which I would not describe as wildly popular, but it was my leg into the world of AI, at least from a developer experience standpoint, and learned a lot from that.",
    "part2": "And then more recently, I introduced a piece of software called fastmcp, which has is is wildly wildly popular, maybe even too popular. And um hence my status today. I'm a little overwhelmed. Uh I find myself back in an open source maintenance seat, which I haven't been in in a few years, which has been a hell of a lot of fun. Um but the most important thing is that fastmcp has given me a very specific vantage point that is really the basis for this talk today. This is our downloads. I've never seen anything like this. I've never worked on a project like this. It was downloaded a million and a half times yesterday. Um there's a lot of MVP servers out there and um fastp is just it's it's it's become the de facto standard way to build MCP servers. Um I introduced it almost exactly a year ago. As many of you are probably aware, MCP itself was introduced almost exactly a year ago and a few days later I introduced the first version of fast MCP. Uh David atropic uh called me up said I think this is great. I think this is how people should build servers. We put a version of it into the official SDK which was amazing. And then as um as MCP has gone crazy in the last year, we found it actually to be constructive to position fast MCP uh as I'm maintaining it as the highle interface to the MCP ecosystem while the SDK SDK focuses on the low-level primitives"
  },
  {
    "chunk_id": 1,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "we're going to remove the fastm vocabulary from the low-level SDK um in a couple of months. It's become a little bit of it's it's too confusing that there are these two things called fast MCP. So fast MTP will be a highle interface to the world and um as a result we see a lot of um not great MCP servers. I I named the talk after this meme and then it occurred to me like do people even know what this meme is anymore? Like this this to me is very funny and very topical and then it's from like a 1999 episode of Futurama. So if you haven't seen this, my talk's title is not meant to be mean. I'm sort of an optimist. I choose to interpret this as but you can do better. And so we're going to find ways to do better. That is the goal of today's talk. In fact, to be more precise, what I want to do today is I would really like to build an intuition for a gentic product design. Um I don't see this talked about nearly as much as it should be given how many agents are using how many products today. And what I mean by this is the exact analog of what it would be if I were if I were giving a talk on how to just build a good product for a user, for a human. And we would talk about human interface guidelines and we talk about user experience and we talk about stories. And I found it really instructive to start talking about those things from an agentic perspective because what else is an MCP server but an interface um for an agent and we should design it for the strengths and weaknesses of those agents in the same way that we do everything else. Now when I put this thought in the world I very very very frequently get this push back which is but if a human can use an API why can't an AI and there are so many things wrong with this question and the number one thing that's wrong with this question is that it has a assumption that I see in so much of AI product design and it drives me nuts which is that AIs are perfect or they're oracles or they're good at everything and they are very very very powerful tools but I'm assuming based on your responses before. I think everyone in this room has some scars of the fact that they are fallible or they are limited or you know they're imperfect. And so I don't like this question because it presumes that they're like magically amazing at everything.",
    "part2": "But I really don't like this question. This is a literal question I've got and I didn't paraphrase it. I really don't like this question because humans don't use APIs. Very very rarely do humans use APIs. Humans use products. We do anything we can to put something between us and an API. We put a website. we put a SDK, we put a client, we put a mobile app. We we do not like to use APIs unless we have to or we are the person responsible for building um that interface. And so one of my core arguments um and why I love MCP so much is that I believe that agents deserve their own interface that is optimized for them and uh their own use case."
  },
  {
    "chunk_id": 2,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "s what I want to motivate today, uh we have to think a little bit about what is the difference between a human and an AI. And it's one of these questions that's like sounds really stupid when you say it out loud, but it's instructive to actually go through. And I'd like to make the argument to you that it exists on these three um dimensions of discovery, iteration, and context. And so just to begin, humans, we find discovery really cheap. We tend to do it once. If you think if if any of you have had to implement something against a REST API, what do you do? You call up the docs or you go in Swagger, whatever it is, you call it up, you look at it one time, you figure out what you need, you're never going to do that again. And so, while it may take you some time to do the discovery, it is cheap in the lifetime of the application you are building. AIS, not so much. Every single time that thing turns on, it shakes hands with the server. It learns about the server. It enumerates every single tool and every single description on that server. So discovery is actually really expensive for agents. It consumes a lot of tokens.",
    "part2": "Um, next, iteration. Same idea. If you're a human developer and you're writing code against an API, you can iterate really quickly. Why? Because you do your one-time discovery. You figure out the three routes you're going to call and then you write a script that calls them one after another as fast as your language allows. So iteration is really cheap. And if that doesn't work, you just run it again until it does. Iteration is cheap. is fast. Um for agents, I think we all know iteration is slow. Iteration is the enemy. Every additional call um subject to your caching setup also sends the entire history of all previous co calls over the wire. Like it is just you do not want to iterate if you can avoid it. And so that's going to be an important thing that we take into consideration. And the last thing is on context. And this is a little bit handwavy, but it is important as humans in this conversation. I'm talking, you're hearing me, and you're comparing this to different memories you have and different experiences you have on different time scales, and it's all doing wonderful, amazing things in your brain. And when you plug an LLM uh into any um given use case, it remembers the last 200,000 tokens it saw. And that's the extent of its um memory plus whatever is, you know, embedded somewhere in its in its weights and that's it. And so we need to be very very conscious of the fact that it has a very small brain at this moment. I I think it is a lot closer to when people talk about sending, you know, Apollo 11 to the moon and and with like 1 kilobyte of RAM, whatever it was. I think that's actually how we need to think about these things that frankly feel quite magical because they go and uh open my PRs for me or whatever it is that they do. Um, so these are the three key dimensions in my mind of what is different and we should not build"
  },
  {
    "chunk_id": 3,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "APIs that are good for humans on any of these dimensions and pretend that they are also good for agents. And one way that I've kind of started talking about this is this idea which is an agent can find a needle in a hay stack. The problem is it's going to look at every piece of hay and decide if it's a needle. And that's like not literally true, but it is in an intuitive sense how we should think about what we're putting in front of the agents and how we're posing a problem. And an MCP server is nothing but an interface to that problem andor solution. And so finally to go back to our product intuition statement, I argued to you that the most important word in the universe for MCP developers is curate. How do you curate from a huge amount of information which might be amenable for a human developer a interface that is appropriate for one of these extremely limited AI agents at least on the dimensions that we just went through. Um, and that sort of brings us to this slide, YMCP. And I almost made this like the Derek Zoolander slide like but why MCP? Like but I just told you why MCP Derek. It's because it does all of these things. It gives us a standard way of communicating uh information to agents in a way that's controllable where we can control not only how it's discovered but also how it is acted on. There's a big asterisk on that because client implementations in the MCP space right now are not amazing and they do some things that are themselves not compliant with the MCP spec. Maybe at the end we'll get into that. It's not directly relevant to now except that all we can do is try to build the best servers we can subject to the limitations of the clients that will use them.",
    "part2": "And again, I put this in here. I think we don't need to go through uh what MCP is for this audience. So, we're going to move quickly through this. But it is, of course, for the for the for the sake of the transcript, the cliche is that it's USBC uh for the internet. It is a standard way to connect LLMs and either tools or um data. And if you haven't seen fast MCP, this is what it looks like to build a fully fully functional MCP server. This one, I live in Washington DC. the subway is often on fire there and so this checks whether or not the subway is on fire and um indeed it is. Now the question we are here to actually explore is why are there so many bad MCP servers? Maybe a better question is do you all agree with me that there are many bad MCP servers? I sort of declare this as if it's true. I I'm not trying to make a controversial statement. There are many bad MCP servers in the world. I see a lot of them because people are using my framework to build them. It does that surprise anyone that I'm sort of declaring that I'm genuinely I'm I'm curious if that's a if I'm made an assumption. I don't in my experience I I won't say every every MCB I I came up to is like that but a lot of them are like AI rubbers. They just put a like stringify the content of the API and that's an"
  },
  {
    "chunk_id": 4,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "d that's it. They call it an NCB.\n\nYeah. And I and I think even I'll I'll make the argument going a little off script here, but I'll make the argument that a lot of them even when they're not rappers are just bad products because no thought was put into them. And I mean, uh, one comparison that that I talk about sometimes with my team is if you go to a a bad website, you know it's a bad website. We don't need to sit there and figure out why it's it's ugly or it's hard to use or it's hard to find what you're looking for or it's all flash. I don't know. I don't know what makes a bad website exactly, but you know what a bad website is when you go to one. Um, we don't like to point out all the things because there's an infinite number of them. Instead, we try to find great examples of good websites. And so, what I think we need more than anything else are MCP best practices. And so, a big push of mine right now and part of where this talk came from is I want to make sure that we have as many best practices in the world and documented. And I do want to applaud there are a few firms um these are screenshots from uh Block has an amazing playbook which if you hate this talk read their read their blog post it's it's like a better version of what I'm doing right now and GitHub recently put out one and many other companies have done as well. I I could have I could have put a lot here but um these are two that I've referred to uh quite frequently and so I I recommend them to you. Um. The block team in particular is just phenomenal what they're doing on MCP. By coincidence, the same team has been my customer for six years on the data side and they're I really love the work that they do and um the blog posts they put out are very thoughtful and I highly highly recommend them to you. Um I want to see more of this and today is sort of one of my humble efforts to try and put some of that in the world.",
    "part2": "And so what I thought we would do today because I did not want to ask you to open your laptops up and set up environments and actually write code with me because it's 4:25 on Saturday. Um, I thought that we would fix a server together sort of through slides um to make this again as I said hopefully actionable but um but a gentle a gentle approach to this. And so here is here is the server that you were describing a moment ago. Right. So someone wrote this server um I hope that the notation is is clear enough to folks. We have we have a decorator that says that a function is a tool and then we have the tool itself. And forgive me I didn't bore you with the with the details because we think this is a bad server to begin with. Um I think in this server what's our example here right we want to we want to check an order status and so in order to check an order status we need to learn a lot of things about the user and uh what their orders are we need to filter it we need to actually check the status and if this were a REST API which presumably it is we know exactly what we"
  },
  {
    "chunk_id": 5,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "The speaker explains that exposing individual functions as operations to an agent creates problems: the agent may not know the correct order to call them, may not understand argument formats, and requires multiple round trips that make the process slow, expensive, and hard to debug. Instead, the speaker advocates for focusing on outcomes rather than operations when building MCP servers—thinking in terms of what the agent needs to achieve rather than exposing atomic operations that would be appropriate for a REST API.",
    "part2": "The speaker warns against two common traps: building a server with atomic operations (which is great for REST APIs but problematic for MCP servers) and treating agents as orchestrators or glue code. Since agents are expensive, slow, stochastic, and difficult to debug, orchestration should be avoided when possible. The recommended approach is 'one tool equals one agent story'—designing tools that accomplish clear outcomes in a single call, similar to how 'track latest order and give an email' is unambiguous and hard to misuse. The speaker emphasizes that LLMs should only serve as orchestrators when the algorithm isn't known or programmatic."
  },
  {
    "chunk_id": 6,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "those like little tips that feels obvious but I think is important. Name the tool for the agent. Don't name it for you. It's not a REST API. It's not supposed to be clear to future developers who need to write, you know, you're not writing an API for change. You're writing an API so that the agent picks the right tool at the right time. Don't be afraid about using silly but um explanatory names for your tools. I shouldn't say silly. Um they might feel a little silly, but they're very userf facing in this moment, even though it feels like a deep a deep d a deep API. Um this uh just in case any of you didn't go read the block blog post. Uh I just found this section of it so uh important where they essentially say something very similar. designed top down from the workflow, not bottom up from the API endpoints. Two different ways to get to the same place, but they will result in very different forms of product thinking and very different MCP server. So again, I just I really encourage you to go and take a look at that at that blog post. And if we were to go back to that bad code example I showed you a moment ago and start rewriting this and if we had our laptops, you're welcome to have your laptops out and follow along. The code will essentially run, but there's no need. Um, here's what that could look like. We did the thing that you would do as a human. We made three calls in sequence that are configured that are to our API, but we buried them in one agentf facing tool. And that's how we went from operations to outcomes. The the API calls still have to happen. There's no magic happening here. But the question is, are we going to ask an agent to figure out the outcome and how to stitch them together to achieve it or are we going to just do it because we know how to how to do it on its behalf. So thing number one is outcomes over operations.",
    "part2": "Thing number two, another thing, a lot of these frankly are going to seem kind of silly actually when I say them out loud. Please just trust me from the download graph that these are the most important things that I could offer as advice. And uh if and if none of them apply to you, think of yourself as in the top 1% of MCP developers. Flatten your arguments. Um I see this so often where I do this myself. I'll confess to you where you say uh here's my tool and one of the inputs is a configuration dictionary hopefully presumably it's documented somewhere in maybe in the agents instructions maybe it's in the doc string um you have a real problem when by the way I I don't remember if I have a point for this later so I'll say it now uh a very frequent trap that you can fall into with arguments that are complex is you'll put the explanation of how to use them in something like a system prompt or a sub aent definition or something like that and then you'll change the tool in the server and now you it's almost worse than a poorly documented tool. You have a doubly documented tool and and one is wrong and one is right an"
  },
  {
    "chunk_id": 7,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "d only error messages will save you. Um that's really bad. We're not This is a more gentle version of that. Just don't ask your um LLM to invent complex arguments. Now you could ask what if it's a pyantic model with every field annotated and fine that's better than the dictionary but it's still going to be hard. There was until very recently there may still be a bug in maybe it's not a bug because no one seems to fix it but in cloud desktop all um all structured arguments like object arguments would be sent as a string and this created a real problem um because we do not want to support automatic string conversion to object but clog desktop is one of the most popular MCP clients and so we actually bowed to this in as a matter of like necessity and So fastmcp will now try if you are supplying a string argument to something that is very clearly a structured object, it will try to des serialize it. It will try to do the right thing. I really hate that we have to do that. That feels very deeply wrong to me that we have a a type schema that said I need an object and yet we're doing clutchy stuff like that. And so this is an example of where this is an evolving ecosystem. It's a little um it's a little messy, but what does it look like when you do it right? Top level primitives. These are the arguments into the function. What's the limit? What is the status? What is the email? Clearly defined. Just like naming your tool for the agent, name the arguments for the agent. Um, and here's sort of what that looks like when we get that into code. Instead of having config colon dict, we have an email, which is a string. We have include cancelled, which is a a flag. And then I highly highly recommend literals or enums whenever you can. Um, much better than a string if you know what the options are. uh at this time very few LLMs know that this kind of syntax is supported and so they would typically write this if you had claude code or something write this. It would usually write format colon string equals basic which works. It just doesn't know to do this. And so it's one of those little little actionable tips. Use literal or use enum equivalently. When you have a a constrained choice um your your agent will thank you.",
    "part2": "And I do have instructions or context. So, I did get ahead of myself. I'm sorry everybody. It is 4:35 on a Saturday. Um, the next thing though I want to talk about is the instructions that you give to the agent. Um, this cuts both ways. Um, the most obvious way is when you have none. Uh, we mentioned that a moment ago. If you don't tell your agent how to use your MCP server, it will guess. It will try. Um, it will probably confuse itself and all of those guesses will show up in its history and that's not a great outcome. Um, please document your MCP server. Document the server itself. Document all the tools on it. Um, uh, give examples. Examples are a little bit of a double-edged sword. Um, on the one hand, they're extremely helpful for showing the"
  },
  {
    "chunk_id": 8,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "agent how it should use a tool. On the other hand, it will almost always do whatever is in the example. Um, this is\njust one of those quirks. Perhaps as models improve, it will stop doing that. But uh in my experience, if you have an\nexample, let's say you have a field for tags. You want to you want to collect tags for something. If your example has two tags, you will never get 10 tags.\nYou will get two tags pretty much every time. They'll be accurate. It's not going to do a bad job, but it really\nuses those examples um for a lot more dimensions than just the fact that they work if that makes sense. So, so use\nexamples, but be careful with your examples. Yes, sir. Giving out of distribution examples as a\nway to solve for that. Have you seen that by out of distribution? Do you mean\nthat are not would not be representative of bacter? It's so interesting. So um I don't have\na strong opinion on that. That seems super reasonable to me. I don't have an opinion on it. I in my experience the\nfact that an example has some implicit pattern like the number of objects in array is becomes such a strong signal\nthat I almost gave this its own bullet point called examples are contracts. like if you give one expect to get\nsomething like it out of distribution is a really interesting way to sort of fight against I guess that inertia I\nwould imagine it is better to do it that way I would just be careful of falling into this sort of more base layer trap I\nthink so that's completely reasonable and",
    "part2": "I would endorse it I think this is just a more broad whatever example you\nput out there weird quirks of it will show up I I on an MCP server that I'm building I encountered this tag thing\njust uh yesterday and it really confused me no matter how much I was like, \"Use at least 10 tags.\" It always was two.\nAnd I finally figured it was because one of my examples had had two tags. Um, so yes, good strategy. May or may not be\nenough to overcome these basic these basic caveats. Um,\noh, I do have examples of contracts. I'm sorry. It's We're 37. Um, this one I\nthink is one of the most interesting things on this slide. Uh, errors are prompts. So, um,\nevery response that comes out of the tool, your your LLM doesn't know that it's\nit's like bad. It's not like it gets a 400 or a 500 or something like that. It gets what it sees as information about\nthe fact that it didn't uh succeed in what it was attempting to do. And so if\nyou just allow Python in in fastmcp's case or whatever your tool of choice is to raise for example an empty value\nerror or a cryptic MCP error with an integer code that's the information that goes back to your LLM and does it know\nwhat to do with it or not probably it knows at least to retry because it knows it was an error but you actually have an\nopportunity to document your API through errors and this leads to some\ninteresting strategies that I don't want to wholeheartedly endorse but I will mention where for example if you do have a complex API because you can'",
    "split_method": "half"
  },
  {
    "chunk_id": 9,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "...you might actually document how to recover from the most common failures. And so it's a very weird form of progressive disclosure of information where you are acknowledging that it is likely that this agent will get its first call wrong, but based on how it gets it wrong, you actually have an opportunity to send more information back in an error message. Um, as I said, this is a kind of a not an amazing way to think about building software, but it is the ultimate version of what I'm recommending, which is be as helpful as possible in your error messages. Do go overboard. They become part of, as far as the agent is concerned, its next prompt. And so, they do matter. Um, if they are too aggressive or too scary, it may avoid the tool permanently. It may decide the tool is inoperable. Um, so errors really matter.",
    "part2": "The MCP spec has support for annotations, which is a restricted subset of annotations that you can place on various components. One of them for tools is whether or not it's readonly. And if you supply this optionally, clients can choose to treat that tool a little bit differently. And so the motivation behind the readonly hint was basically to help with setting permissions. Respects the token budget. I think the meme right now is that the GitHub server ships like 200,000 tokens when you handshake with it, something like that. Um, this is a real thing. And I don't think it makes the GitHub server automatically bad. I think it's actually makes endemic on folks like myself who build frameworks and folks who build clients to find ways to actually solve this problem because the answer can't always be do less."
  },
  {
    "chunk_id": 10,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "is so excited that they're rolling out MCP and I met with the engineering team and and just to be clear, this is an incredibly forward-thinking, high-erforming um, massive company that I incredibly respect. I won't say who they are, but I really respect them. and they got on the call and they were so excited and they were like, \"We're in the process of converting our stuff to MCP so that we can use it.\" And they had a a strong argument why it actually had to be their API. So that's not even the punch line of the story, which is a whole other story in in and of itself, but it fundamentally came down to this. They had 800 endpoints that had to be exposed to which I had this thought, which if by the time you finish reading this, this is the token budget for each of those 800 tools. if you assume 200,000 um um tokens in the context window. So if each of those 800 tools had only this much space to document itself, not even document itself, share its schema, share its name plus documentation, this is the amount of space you would get. And when you were done taking up this space because you were so careful and each tool really fit in this, you would lobomize the agent on handshake because it would have no room for anything else.",
    "part2": "So the token budget really matters. um if this agent connected to a server with one more tool that had a one-word dock string, it would just fail. It would just have a over effectively an overflow, right? So, the token budget matters. Um there is probably a budget that's appropriate for whatever work you're doing. You may know what it is, you may not know what it is. Pretend you know what it is and be mindful of it. Um in a worst case scenario, try to be parsimmonious. Try to be as efficient as possible. That's why we do experiments like sending additional instructions in the error message. It's one way to save on the token budget on handshake. And the handshake is painful. Um I'm not sure folks know that uh when an when an LLM connects to an NCP server, it typically does download all the descriptions in one go so that it knows what's available to it. And it's usually not done in like a progressively disclosed way. That is done outright."
  },
  {
    "chunk_id": 11,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "The tools it receives on the first contact and puts them in a SQLite database and it doesn't care what you do. It doesn't care about the fact that the spec allows you to send more information. I think your solution would get around this because it's a tool call. But um many of the first attempts that people use to use spec compliant techniques for getting around this problem such as notifications fail in cloud desktop. Usually you failed before this in cloud desktop. I'm not a fan of cloud desktop from MCP server. I think it's a real missed opportunity because it is such a flagship product of the company that has introduced MCP. I think it's a real missed opportunity. Cloud code is great. um uh it it caches everything in SQLite database so it like doesn't matter uh what you do um techniques similar to what you've described where you provide mechanisms for learning more about a tool that's a great idea I really like that um there is a challenge where now you are back in a sort of flatten arguments world because you have met tools now where I need to use tools to learn about tools and use to tools to call tools in some extreme cases or beyond so you need to design this very carefully that's why it usually does show up as a dedicated ated product. So thank you for sharing that.",
    "part2": "Um uh there are many really interesting techniques for trying to solve this problem. Yes. So you talk about um progressive disclosure. Do you use um masking? So for example, I connect to my Kubernetes server and my credentials only give me certain rights. So therefore there are 28 tools that I don't have access to. So therefore, you don't need to do that. So when you say do I do I support that? Do you mean does MCP support that or do I in my product support that? Yeah, I was just asking something I've read about. Okay. So so the spec makes no claim about this. The spec says when you call list tools you get tools back and how that happens is is up to up to implementation. Um, fast MCP makes that an overridable hook through middleware, but again makes no claim on how that is. Prefix commercial products, which I'm not here to pitch, allow per tool masking on any basis. And we see that as like a place to have an opinionated in the commercial landscape as opposed to an opinion in the open source landscape as opposed to the protocol which should have no opinion at all. So if that's interesting, we can chat about this. You might be getting into this but if you take this problem the example J might have mentioned kind of table of contents approach guess approach is what split over the four different chunks or maybe the 800 don't all justify having their own server like what was the solution for them they can't do it they there's no solution that allowed them to have as much information as they wanted on the on the contact center window they have they didn't need it they didn't need it um and and it became a design question and and frankly it was this call was probably four months ago"
  },
  {
    "chunk_id": 12,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "now and it was just call after call after call after call like this. Um, which made me realize we need to have talks more like this and just talk about what it is to design a product for an agent. My worry is MCP is viewed as infrastructure or a transport technology and it is and I'm very excited. I think by a year from now we will be talking about context products as opposed to MCP servers. I'm very excited about that. We'll move past the transport. Um but we need to figure out how to use it and so so I think that's how we talk about it. Um the only other alternative that I have discussed with a few folks a few companies when you have a problem like this is if you control the client much more interesting things become available to you. Um if you can instruct your client to do things a certain way for example if you have a mobile app that presents an agentic interface to an end user you control the client is what I mean by that. um or if it's internal and you can dictate what what client or what custom client a team uses. Now you can do much more interesting things because you actually do know a lot more about that token budget and how to optimize it. But for an external facing server, there's not a good there's not a good solution.",
    "part2": "I think by now we have talked through all of this. So I'll leave it for uh posterity uh in the interest of time. Um, we talked about curate as a key verb earlier in this talk. Um, it is, I would argue, what we have been doing in each of these little vignettes that we've been working through with the code. We are curating the same information set down to one that is more amendable and more recognizable for an agent. Um, 50 tools is where I draw the line where you're going to have performance problems. I think it seems really low to a lot of people. Some people will talk about it even lower than that. Some people might talk about it higher. If you have more than 50 tools on a server without knowing anything else about it, I'm going to start to think that it's not a great server. Um, the GitHub server has, I think, 170 tools. Does that mean it's not a great server? No. There's a good argument there. And the GitHub team has put out a lot of really interesting blog posts on semantic routing that they're doing. They had one just yesterday actually on like some interesting techniques they're using. Um, uh, there's software like, um, like the one you mentioned a moment ago, sir, which which helps with this problem. So having a lot of tools like that does not automatically make it a bad server, but it is a smell and it does make me wonder, can we split them up? Do you have admin tools mixed in with user tools? Could we name space these tools differently? Would it be worthwhile having two servers instead of one? Um, that is a little bit of a smell. If you can get down to 515, that would be ideal. I know that's not achievable for most people. So it's one of those actionable but maybe not so actionable little tips. It's an aspir"
  },
  {
    "chunk_id": 13,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "ation that you should have and just be careful unless you are prepared to invest in a lot of care and evaluation. 50 tools per agent. I should have said per agent. If I have a 50 tool server and you have a 50 tool server, that's 100 tools to the agent. That's where the performance bottleneck is, not on the server. Sorry, the slides should be corrected. It's 50 tools to the agent is where you start to see performance degradation. Um, I love this. Um, Kelly KFl is someone who I've known a long time. He's at Fiverr now. And while I was putting this talk together, I happened to come across these two blog posts of his, which are a little bit of like a shot and a chaser. They're written almost exactly a month apart. One's from October, one's from November. In the first one, he talks about building up a Fiverr server, and he goes from a couple of basic tools to uh I think 155 188. And in the second blog post, he talks about how he curated that server from 188 down to five. You could read either of these blog posts. You could view them independently as a success story on what his adventure was in learning MCP. I think taken together they tell a really interesting story about making something work and then making something work well which is of course the product journey in some sense.",
    "part2": "Um and so where this where this takes us is sort of the thing that I have found is the most like obvious version of this. I wrote a blog post that went a little bit viral on this, which is why I talk about it a lot, which is please, please just, if nothing else, stop converting REST APIs into MCP servers. It is the fastest way to violate every single thing we've talked about today, every single one of the heristics that we laid out about agents. Um, it really doesn't work. And, it's really complicated because this is the fastm documentation. That's a blog post I had to write. And the blog post basically says, I know I introduced the capability to do this. Please stop. That's a really complicated thing. That's that could be a workshop in and of itself. Um, I do bear a little bit of responsibility here. This is not just a feature of FastMPP. It's one of the most popular features of FastMPP, which is why candidly it's not going anywhere. And instead, we're going to document around that fact. Um, but here's the problem, right? Uh, you just you can't you just can't you just can't convert I'm not going to explain it. you just can't convert rests into dev speed server but it is an amazing way to bootstrap. Um when you are trying to figure out if something is working do not write a lot of code where you introduce new ways to figure out if you have failed. Do start by picking a couple of key endpoints mirroring them out with fastmcp's autoconverter or any other tool you like or even just write that code yourself. Make sure you solve one problem at a time and make the first problem being can you"
  },
  {
    "chunk_id": 14,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "get an agent to use your tool at all. Once it's using it, by all means, strip out the the part of it that just regurgitates the REST API and start to curate it and start to apply some of what we've talked about today. Um, this this is just one of those candid things, right? It is the fastest way to get started. You don't have to do it this way. I start this way. Um, just don't end up ship the REST API to prod as an MCP server. You will regret it. You will pay for it. um a little bit later even though there's a dopamine hit up front. So um these are the five major things that we talked about today in our pseudo workshop workshop that wasn't really a workshop actionable talk. Um outcomes, not operations. Focus on the workflow. Focus on the top down. Don't get caught up in all the little operations. Don't ask your agent to be an orchestrator unless you absolutely have to. Um flatten your arguments. Try not to ship large payloads. Try not to confuse the agent. Try not to give it too much choice. I don't think I said out loud when we talked about that, but try not to have tightly coupled arguments. That really confuses the agent. Um, see if you can uh design around that. Uh, if possible, it's not always possible, but if you can, um, instructions are context. Seems obvious to say out loud. Of course they are. They're information for it. Use them as context. Design them as context. Really put thought into your instructions the same way as you would into your tool signature and schema. Respect the token budget. Have to do it. It it's this is the only one on this list where if you don't actually do it, you will simply not have a usable server. The other ones you can get away with and frankly the art of this intuition is start with these rules and then work backwards into practicality.",
    "part2": "But this is the only one where I think you can't actually cross the line and then curate ruthlessly if you do nothing else. Start with what works and then just tear it down to the essentials. Um I I have been writing MCP servers about as long as anyone at this point. um a year and I still find myself starting by putting too many tools in the world sometimes because I'm not sure which one it will use or or I'm experimenting and I have to I have to remind myself to go back and get rid of them and it and it's hard I think as an engineer especially designing normal APIs you're like okay like here's my tool here's v2 is backwards compatible right like and you keep adding stuff and that's a really natural way to work and it can be a best practice and uh it doesn't work here you are It would be like using a UI that just showed a REST API to a to a user. Um, this is this is a criticism I have offered of my own products at times when I'm like this looks a little bit too much like our REST API docs, right? We're not doing our job to actually give this to our users in a in a consumable way. Um, so if I can leave you with just one with just one thought, it's this. Um, you a"
  },
  {
    "chunk_id": 15,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "re not building a tool. you are building a user interface and treat it like a user interface because it is the interface that your agent is going to use and you can do a better job or you can do a worse job and either you or your users will will benefit from that. Um I think I think we are at our time so I'm going to just open it up for questions or what's next or what what other challenges we can solve. Um, I hope that I hope I found the I hope I walked the tight rope between uh things that are useful to you all but don't require you to write any code at 454 on a Saturday. Now, um, but I I hope I hope I hope I had some useful nuggets in there for you more than you more than you came in with. And happy to take any question if there are any. What are typically? Um that would be where you have one argument that's like um what is the file type and another argument that's like how should we process the file and your input to the file type argument determines the valid inputs for the other argument. So they're they're now tightly coupled. Some some arguments on the second thing are invalid depending on what you said for the first thing. It's just one extra thing to keep track of. That's a good question. Sorry I didn't define that. Do you have a question? I have to I will start with the first one. uh when you are giving like an agent an entity server you have to like document the tools or or the the capabilities of the server in the server and in the agent and that is like uh not ideal. So what what would you recommend that or only in the server? So this this comes down to do you control the client or not?",
    "part2": "If you control the client then this is a real choice and there are uh there are different ways to think about it. So, um, for example, in some of my stuff that I write that I know I'm using, for example, cloud code to access, um, I might actually document my MCP server as, um, files or cloud skills because I know what the workflows are going to be. I know that some of my workflows are infrequent and I don't want to pollute the context space with them. So, if you if you control the client, you you have a real choice to make there. If you don't control the client, then you don't have so much of a choice. have to document it here because you have to assume you're you're working with the worst possible client. Um, honestly, many of the answers in MCP space boil down to do you control the client? Then you can do really interesting things on both sides of the protocol. From a server author perspective, you really do need to document everything in its dock string. The one escape hatch is that you can document a server itself. So every server has an instructions field. Um, it is not respected by every client. I believe my team has filed bugs where we have determined that to be the case. Um, so hopefully that's not a permanent thing, but most clients will on handshake download not only the tools and resources and everything, but a instructions blob for the se"
  },
  {
    "chunk_id": 16,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "rver itself.\nHow much information you can put in there, I' i'd be careful. I don't think it wants to read a novel. But you do\nhave this one other opportunity to document maybe the high level of your server.\nAnother one, but Oh, yeah. Well, why don't we let's mix it up and we'll come back. Did you have a question? Yeah.\nI'm pretty I'm not a member of the core committee, but I'm in very close contact with them. So, maybe I can answer your question.\nI'm so excited about this. Yes, this I know a lot about.\nIt's going to it's it's it's going to expand. It's not actually going to change so much because of the way it's implemented. Um uh what question could I\nanswer like what is it? Am I excited about it? I am excited about it. Um so\nall the rules still apply. That's a that is a fantastic question. Let's talk about this for one second. Um some of you I don't know if any of you were at a\nmeetup we hosted last night where my colleague actually gave a presentation on Oh, you were. Yes, that's right.",
    "part2": "I was like I know at least somebody's coming. Um uh my colleague Adam gave a very good talk on this which I can we'll\nchat after this. I'll I'll send you a link to um to a recording of it. Um but the nutshell version is this is this is\nuh SEP 1686 uh is the name of the proposal and it adds asynchronous background tasks to\nthe MCP protocol not just for tools but for every operation. Um and we don't\nneed to talk about too much about what that is. The reason it doesn't involve changes to any of these rules is um this\nis essentially an optin mode of operating in which the client is saying I want this to be run asynchronously and\ntherefore the client takes on new responsibilities about checking in on it and and and polling for the result and\nactually collecting the result but the actual interface of learning about the tool or calling the tool etc is exactly\nthe same as it is today. So this is fully opt-in on the client side. Um and that's why from a design standpoint,\nnothing changes. The only question from a server designer um standpoint is is\nthis an appropriate thing to be backgrounded as opposed to be done, you know, synchronously on the server. Um or\nsorry, let me take that back. You can background anything because it's a Python framework. So you can chuck anything in a Python framework. The\nquestion is should the client wait for it or not? Should it be a blocking task is really the is really the the right\nvocabulary for this? Um, and that's a that's just a design question for the server maintainer."
  },
  {
    "chunk_id": 17,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "MCP elicitation. Anyone not familiar with what that is? Yes. So elicitation is basically a way to ask the client for more input halfway through a tool execution. So you take your initial arguments for the tool, you do an elicitation. It's a formal NCP request and you say, \"I need more information.\" And it's uh structured is what's kind of cool about it. So the most common use case of this in clients that support it is for approvals where you say I need a yes or no of whether I can proceed on maybe it's some irreversible side effect or something like that. Um when it works it works amazingly. Again it's one of those things that doesn't have amazing client support and therefore a lot of people don't put in their servers because it'll break your server if you send out this thing and the client doesn't know how what to do with it. So you got to be a little bit careful. Does it change the design is a fantastic question. I wish it were used more so I could say yes and you should depend on it. If all clients supported it and it was widely used and the reason all clients don't support this one, by the way, I'm not trying to it's not like a meme that clients are bad. It's complicated to know how to handle elicitation because some clients are userfacing. Then it's super easy. Just ask the user and give them a form. Some clients are automated, some are backgrounded, some and so what you do with an elicitation is actually kind of complicated. if you just fill it in as an LLM, maybe you satisfied it, maybe you didn't. It's it's a little tough to know. So, if it were widely used, I would say absolutely. It gives you an opportunity to put in particular tightly coupled arguments into an elicitation prompt. Um, or confirmations. Um, a lot of times you'll see for destructive tools, you'll see confirm and it'll default to false and you're forcing the LLM to acknowledge at least as a way of, you know, hopefully tipping it into a more sane operating mode. Elicitation is a better way to design for that. I didn't I don't think that made it into this in any of these examples. So, great question. Wish I could say yes. I hope to say yes.",
    "part2": "How about that? You had a second question. Yeah. So, so in my in my job the main thing I do is is build agents and I do like Dangra open SDK or something like that and I usually just like write the the tools and the tools calling the APIs and I don't like really see the the need for the MCPS in in that that space. Do you agree that the MCPS are like I do not needed there or do you have like a I do I I think um I would not I would not tell you to write an MCP server. I think that within a year the reason you would choose to write MCP server is because you'll get better observability and uh understanding of what failed whereas the agent frameworks are not great because part of the whole agent framework's job is to not fail on tool call and actually surface it back to the LLM similar to what we were talking about a moment ago. So you often"
  },
  {
    "chunk_id": 18,
    "source_file": "Your MCP Server is Bad.md",
    "part1": "don't get good observability into tool call failures. Um some do but not all. Uh and so one of the reasons to use an MCP server even for a local case like that is just because now you have an automatic infrastructure so you can actually de debug and and diagnose and stuff. I don't think that's the strongest reason to do it. I think that's going to be in a year when the ecosystem is more mature. I think if you are if you fully control the client and you're doing client orchestration and you are writing if you are writing the agentic loop and you're the only one do whatever you want. I think that all all of the advice you gave today also applies when you're building tools. It absolutely does. This is this is Yes. Everything we said today applies to Py like a Python tool. Absolutely. And that's I mean that's how fastm treats it. It's a good question. Any last questions? I'm happy to. Yes. Yes. excited. Yes. Um, so code mode is something that Entropic uh, Cloudflare actually blogged about uh, first and then Entropic followed up where you actually ask you you solve some of the problems I just described here. You ask the LLM to write code that calls MCP tools in sequence. And it's a really interesting sidestep of a lot of what I just uh, talked through here. Um, the reason that I don't recommend it wholeheartedly is because it brings into other other sandboxing and codeex. Like there's there's other problems with it, but if you're in a position to do it, it can be super cool. Um, I actually have a colleague who wrote the day that came out, he wrote a fastmcp extension that supports it, which we put in a package somewhere.",
    "part2": "We didn't we at first didn't want to put it in fastmcp main because we weren't sure fastcp tries to be opinionated and we weren't sure how to fit that in and then actually it was so successful that we decided we're going to add an experiments flag to the CLI and have it but I don't know if it's in yet h Yeah, this will go into this new I forget if we called it experiments or optimize is it's on our road map right now and this would this would go in there. Um, and then there's like a whole world right now of optimizing tool calls and stuff. But I I would like to be respectful of your time and allow you all to go back to your your lives. You're very kind to spend an hour talking about MCPS with me. I'm more than happy to keep talking if anybody has has questions, but I I would like to free you all from the conference. I hope you all enjoyed the talk and thank you very much for attending."
  },
  {
    "chunk_id": 19,
    "source_file": "file4.md",
    "part1": "Тема и гость выпуска\nЭто вопрос науки. Я Алексей Семихатов. Здравствуйте. Очень хочется получить ответ на вопрос: искусственный интеллект - это всё-таки интеллект? Возможно ли сознание у искусственных нейронных сетей? Вероятно, простых ответов здесь нет, но как бы то ни было, мы впервые получили нечто отличное от нас, очень похожее на нас, во всяком случае, в отношении поговорить практически на любые темы. Не ведёт ли отсюда от искусственных нейронных сетей и искусственного интеллекта дорога или, по крайней мере, тропинка к лучшему пониманию того, как устроен наш интеллект и наше сознание.",
    "part2": "У меня в гостях сегодня Константин Владимирович Анохин. Добро пожаловать в программу. Добрый вечер. Здравствуйте. Константин Владимирович, доктор медицинских наук, профессор, директор института перспективных исследований мозга Московского государственного университета и академик Российской академии наук. И вы много изучали сознания и знаете о нём, возможно, больше, ну, если не всех, то очень многих. А приближаемся ли мы сейчас к признанию, что возможны различные сознания не только на нашей электрохимии, но реализованные совсем по-другому? И, возможно, сознания, но какие-то другие, интеллект, но какой-то другой?"
  },
  {
    "chunk_id": 20,
    "source_file": "file4.md",
    "part1": "Сознание у животных. Сейчас речь идёт о том, что есть высокоразвитое сознание, а есть базовое сознание. Вот мы с вами когнитивные существа типа два. Мы высокопорядковые когнитивные существа, но мы также когнитивные существа типа один, которые обладают такими же, видимо, признаками сознания, как другие К1 существа на нашей планеты. Кошечки, собачки, птицы — и консенсус, что птицы обладают сознанием. А дальше начинается туман, где сейчас проходят очень активные исследования: рыбы, земноводные, пресмыкающиеся, насекомые, моллюски, осьминоги, шмели.",
    "part2": "А они как? Мы в каком-то смысле понижаем планку всё время или мы открываем нечто новое, более глубокое, в том числе в самих себе, и видим аналоги этого там. Совершенно верно. Мы не понижаем планку, мы её сразу определили. И есть определение сознания как способности чувствовать что-то, базовое ощущать, каково это быть. Декарт писал, что под \"я мыслю\" он имеет в виду не только рациональное мышление, но и желание, чувства, намерения. Вот вопрос в следующем: если к этому относятся эти чувства, субъективные чувства тоски, желаний, восприятия событий через качества, боли — то вот эта фундаментальная ступень, кто ею обладает? Чувствуют ли рыбы боль, когда они попадают на крючок? Чувствуют ли раки или омары боль, когда их бросают в кипящую воду? Это сложные вопросы. У нас вроде бы нет способа это выяснить, потому что нет возможности у них спросить. Но сознание можно понять по-настоящему только изнутри системы, которая общается с окружающим миром. Не обязательно спрашивать, можно подсмотреть за признаками того, что происходит внутри. Как быть с новорожденным младенцем? Вы же не можете его спросить. Но на этом основании вы не скажете, что он не обладает сознанием, потому что он обладает таким же устройством, как мы. Однако до начала восьмидесятых годов в США операции на новорожденных младенцах проводились без наркоза, потому что предполагалось, что они не ощущают боли. И возникает вопрос: когда возникает сознание доязыковое у младенца?"
  },
  {
    "chunk_id": 21,
    "source_file": "file4.md",
    "part1": "е дети рождаются? Вы смотрите, куда я веду. Я веду к другим сознаниям. Э, мы более-менее с вами можем говорить, что я обладаю сознанием. И экстраполируя на это, я думаю, что вы обладаете сознанием. Другие люди в студии обладают сознанием. Дальше мы идём даже по ступенькам развития гомо сапиенс. У нас возникают вопросы. Мы отклоняемся в сторону к животным. И, ээ, на основании того, что моей собаки мозг очень похож на мой, я могу также предположить, что у неё есть сознание. Ээ, кроме того, по каким-то поведенческим признакам, что не очень надёжно. А как быть с осминогом, у которого абсолютно другая нервная система, и у него восемь, по сути дела, мозгов в каждой щупальце, когда она может учиться и автономно делать разные разные вещи. И есть центральная довольно сложная нервная система. У неё там сотни миллионов клеток. Смотрите, ну и тогда я я ваш я слышу вас, как вы как раз говорите, что вот ИИ обладает сознанием?",
    "part2": "эти вещи, это сознание или что-то очень на него похожее развились эволюционно, потому что нужно было воспринимать что-то в среде, отклики и так далее. Тогда искусственный интеллект - это вообще не сознание, потому что он не возник эволюционно в среде. Ему не нужно отклики, ему не нужно выживать, у него нет переживания по поводу среды. Это нечто совершенно другое. И вдруг оказывается, о чуда, что мы с ним разговариваем и не понимаем, что разговариваем с машиной. Это другая вещь. Ээ то, что мы с ним разговариваем и не понимаем, что разговариваемы с машиной, не должно вести к э заключениям, что там внутри кто-то есть. Всё-таки для того, чтобы понять, есть кто-то внутри или нет, мы должны иметь теорию механизмов внутреннего устройства сознания, заглянув в машину, несмотря на то, что в ней нет биологических клеток, нет жидкостей и химических веществ, нет генома в этих клеток, нет каких-то химических медиаторов, сигналов между ними, Но операционально она некоторые вещи делает и имеет некоторую архитектуру. Задать вопрос, те ээ э фундаментальные свойства алгоритмические, операциональные, которые есть у сознания и которые могут ээ не зависеть от воплощения в конкретном субстрате, там появляются или нет, мы можем их подсмотреть. Вот мы к чему должны прийти. Позвольте прояснить противоречие. Я Формирование и обучение сознания услышал от вас, что мы хотели бы там в других животных видеть процессы в мозге, как, как вы говорите, подсмотреть, видеть процессы в мозге, про которые мы знаем, считаем, установили, что они являют отражают наличие сознания. А с другой стороны, сейчас вы говорите о осознании как о какой-то вещи, которая вырастает удивительным образом, независимо от носителя. Вот он наш электрохимический носитель, вот уж как сложился. у собачек, в общем, похожий. Ну, прямо скажем, у осьминогов другой, но всё-таки не настолько отличающийся, как у вот этих вот, э, больших языковых моделей, где матрицы перемножают. И, ээ, вы готовы употреблять слово сознание для тех и для других, для всех, включая ээ искусственный интерес. Если там есть этот специ"
  },
  {
    "chunk_id": 22,
    "source_file": "file4.md",
    "part1": "фический процесс, то мы обязаны его называть таким образом. Значит, мы должны понять, в чём специфика этого процесса. Это раз. Э второе. Я сейчас должен сказать, что возможно противоречие, которое вы нашли, оно не такое уж противоречие. Если вы возьмёте и посмотрите на все эти системы, эволюционировавшие в ситуациях столкновения с какими-то задачами, с точки зрения процессов обучения, которые мы несколько минут назад ээ обсуждали, то у вас есть некоторые очень ээ подсказывающие сходства, намекающие на ней, что у вас есть очень сложные системы, которые кото представляет собой сеть. Эта сеть глубокая. Эта сеть глубокая в том смысле, что связь нейронов в элементов ячеек я не буду использовать даже слово биологическое нейронно, ячеек памяти, которые ээ находятся в этой сети в глубине, э очень далеко от примитивов внешней среды и каких-то поверхностей. глубинная переработка идёт, да, сигналов они, совершенно верно, но не не просто глубинная переработка сигналов, а то, что в этих глубоких слоях нервной сети каждая клетка получает тысячекратно синтезированный из многих кусочков внешнего мира и каких-то настроек сети. Ээ сигнал, который потом на следующем слое ещё обогатился. ээ ещё и ещё и из него начинают вдруг ээ на каких-то слоях э вытекать очень абстрактные отношение этой системы с поступающим к ней сигналом. Это второе свойство. И третье, что эта система прошла и мы с вами, и ребёнок, и осьминок, и птицы. прошла огромное количество циклов обучения. Она училась, училась, училась взаимодействие с окружающей средой.",
    "part2": "А то, что обучение современных больших языковых моделей требует фантастического количества электричества, а обучение младенца требует весьма скромного питания и поддержания жизнедеятельности, это вас не смущает, что это очень это не вы не воспринимаете их как очень разные процессы. Это просто в силу разности устройств или в силу разности чего столь разные обучения? Мы этого до конца не знаем. Э, это разные процессы, безусловно, по, э, просто параметрам, которые вы перечислили, энергии, количество тактов обучения и так далее, и так далее. Вопрос, насколько это существенно, насколько вы можете прийти к одному и тому же результату в природе ээ разными путями внешне? Ээ, если вы будете смотреть на эту дорогу, которая ведёт эту тропинку и другую тропинку, нижнюю там и верхнюю тропу, они совершенно по-разному выглядят, но закончатся в одном месте. А это не перестаёт удивлять. Это, вообще-то, недавнее открытие, оно совершенно потрясающе. Не перестаёт удивлять. Я м скажу две вещи. Я не считаю, что в существующих системах присутствует сознание. Это раз. Э-э, я не адепт, э-э, идеи, что, э-э, оно скоро появится, но я не могу исключить этого. Это раз. Э второе, э что я вижу в этом огромные сложности, если это появится. То есть я бы этой дорогой, безусловно, не шёл, но это отдельный разговор, трогать это или нет, и что за этим последует. Теперь проа не перестаёт удивлять. Я где-то в начале"
  },
  {
    "chunk_id": 23,
    "source_file": "file4.md",
    "part1": "В 2000-х годах исследователи искусственных нейронных сетей создавали специальные устройства под названием Brain based Devices (серии Дарвин 1-3). Это были роботы с искусственными нейронными сетями, которые обучались решать задачи по распознаванию объектов и навигации в пространстве. В 2005-2006 году появилась удивительная статья: показано, что у таких искусственных нейронных сетей появляются специализированные нейроны, поразительно похожие на нейроны места у животных и человека (открытие, отмеченное Нобелевской премией 2014 года). Автор начал думать о необходимости создания прозрачных искусственных нейросетей, чтобы понимать, что в них происходит.",
    "part2": "В 2010-2016 годах появились нейросети глубокого обучения, и возникла проблема интерпретируемости — мы не понимаем, что происходит внутри. Илья Суцкивер, ученик нобелевского лауреата Джефри Хинтона и создатель первой сети глубокого обучения AlexNet, перейдя в OpenAI и работая с трансформерами, обнаружил интересное явление: обучая нейросеть на рецензиях (фильмы, журналы, театральные постановки), он заметил, что в сети возникают специализированные нейроны, аналогичные тем, что автор обнаружил в 2006 году."
  },
  {
    "chunk_id": 24,
    "source_file": "file4.md",
    "part1": "Примеров, начали смотреть, что происходит внутри нейронных сетей, и для себя совершенно неожиданно открыли нейрон сентимента — нейрон переживаний, чувственности. Это один из нейронов в глубоких слоях сети, который активировался для распознавания настроения текста рецензии: где негативное — работал одним образом, где сильно позитивное — другим. Естественно. Так ли устроены наши эмоции? Да. Поэтому они начали делать системы визуализации того, что происходит внутри таких сетей. OpenAI создал такой «микроскоп», который позволял узнать для разных нейронов на разных слоях сложных сетей, на что они после обучения больше всего реагируют, что они узнают. Это называется методика максимизации активации: сети предъявляют всё подряд, регистрируют степень активации, и из этого делают синтетическое изображение, которое больше всего возбуждает нейрон. И оказалось, что есть нейроны, которые распознают цвета, лица исторических персонажей (Гитлера, Трампа, Кеннеди), лица актёров, выражение эмоций — грусть, гнев, страх. Этому не учили — это возникало само.",
    "part2": "Вы говорите удивительную вещь: учили совершенно другому, а возникают признаки, которые мы относили за счёт эволюционного развития. Может быть, эти признаки сознания — не столько результат эволюции, сколько закономерность, которая возникает в сложных системах при обработке информации независимо от архитектуры. Это открытый вопрос. Позиция Ильи Суцкивера в конце 2010-х годов была прямолинейной: сознание в искусственных нейронных сетях можно получить просто увеличением сложности сети, количества параметров и объёма обучающей выборки — это возникнет само собой."
  },
  {
    "chunk_id": 25,
    "source_file": "file4.md",
    "part1": "В последние два-три года остро стоит проблема эмерджентности — возникновения у нейросетей свойств, которым их не учили. Чем больше сложность сети и параметров, тем больше таких неожиданных способностей появляется. Исследователь высказывает пессимистичную оценку относительно появления сознания в таких системах, вводя термин 'холодная эмердженция' — когда свойства возникают, но модель ничего не чувствует. Она может имитировать эмоции, распознавать их, но внутри нет 'я', который испытывает эти чувства.",
    "part2": "Это приводит к концепции 'философского зомби' — существо, которое ведёт себя как обладающее сознанием, но внутренне ничего не чувствует. Высказывается идея разделить два аспекта: признать за ИИ когнитивные способности (поддерживать беседу, делать неожиданные выводы, оценивать эмоции), но не считать это сознанием в полноценном смысле, который есть у людей, животных. При этом признаётся, что мнение отдельного исследователя не имеет значения — прогресс движется независимо от призывов к остановке, особенно если разработки приносят пользу."
  },
  {
    "chunk_id": 26,
    "source_file": "file4.md",
    "part1": "большие деньги и может быть связано с крупными геополитическими вещами. Это не решение. Но да, я считаю, что нам не надо наступить на эти грабли, потому что если вы представите, что теперь это не зомби, а внутри кто-то есть, Угу. то вы столкнётесь с тем, его из розетки из розетки нельзя вытащить с таким набором этических проблем, из которых я выхода не вижу.",
    "part2": "Поможет ли развитие ИИ лучше понять человеческий мозг? довольно неожиданно подошли к почти сознанию, к функциям, к воспроизведению, к имитации наших функций, э, на вот этих вот железках, что отсюда следует для ээ традиционного изучения нашего мозга, нашего сознания, нашего людского? Изменятся ли методы? Ээ, перенесём ли мы оттуда что-то в наше лучшее понимание того, как как наше сознание устроено, как наш интеллект работает, да? для меня, да, если предыдущие там с 2005 там по 2020 год 15 лет, я думал о том, как мы можем перенести то, что я знаю в области нейрофизиологии и нейробиологии для того, чтобы понять, что там, о'кей, то теперь меня очень сильно интересует вопрос, зная и исследуя, что происходит в этих искусственных нейронных сетях, Не является ли это способом понять, ээ, что у нас внутри? И, э, вопрос, который меня сейчас больше всего интересует, всё-таки что же нас отличает, если там никого нет? А они всё это имеют. они имеют ээ нейроны с такими же свойствами, такой же ээ набор вселенную признаков и параметров. Недавно вышло очень интересно, ну то, что вы говорили, грустный текст, весёлый текст и так далее. Дадада. Ну, более того, э, вот, ээ, есть, э, такие разреженные автокодировщики, которые за последний год с помощью них удалось определить те свойства, который, которыми обладают глубокие нейронные сети. То есть отдельные свойства, которые ээ при обучении у них возникают, а объём свойств. А и ээ в недавней вот октябрьской работе Макса Тегмарка из MIT и его команды, они посмотрели, а как организована геометрия этого пространства свойства, то есть как организована вселенная. И оказалось, они посмотрели на микромасштабе, на среднем масштабе и макромасштабе всей вселенной. И оказалось, что это жутко напоминает многие свойства, э, мозга, что на микромасштабе там есть, они называют это кристалликами, э, маленькие свойства, которые похожи, которые геометрически организованы как грани с некоторыми параметрами вместе, определяющими некоторую категорию. В среднем масштабе оказалось, что эти категории в этой вселенной свойств у модели организованы не случайно, а анатомическими структурами, ээ долями, как они их называют. Математика, например, лежит в одной области, физика в другой, язык, ээ, в третьей. Они группируются и связываются эти кристаллики, образуют эти доли. А, э, в целом, вся эта галактика, как они называют, ээ, этих свойств, параметров, она организована не случайно, как можно было бы предполагать, что разные свойства в разных точках и и местах, а имеет свою тоже геометрию и архитектуру."
  },
  {
    "chunk_id": 27,
    "source_file": "file4.md",
    "part1": "кого примитивного тренировки и нейронных сетей на одно, э, формируются, э, сложнейшие структуры внутри них, которые мы только начинаем изучать. И вопрос, подскажет ли это нам что-то о том, как они формируются у нас и что нас всё-таки отличает принципиально? Тем не менее, чего им не хватает. Э, мой ответ, что у них пока нет желаний.",
    "part2": "А, замечательное место, чтобы пожелать вам прогресса. а-а желание разобраться в этом не ослабевающего, а всем нашим зрителям интереса к этой чрезвычайно важной теме, в том числе важной для того, чтобы узнать, каковы мы сами, как мы думаем, как мы чувствуем. Большое спасибо за ваш интересный рассказ. Всего хорошего, до свидания."
  },
  {
    "chunk_id": 28,
    "source_file": "file5.md",
    "part1": "Introduction to Joel David Hamkins - a mathematician and philosopher specializing in set theory, foundations of mathematics and infinity. He's the top-rated user on MathOverflow, author of several books including Proof in the Art of Mathematics and Lectures on the Philosophy of Mathematics, and runs the blog infinitelymore.xyz. This is a technical conversation about the foundations of modern mathematics, infinity, reality, truth, and mathematical paradoxes. The host also shares personal reflections about gratitude and support from listeners.",
    "part2": "The concept that some infinities are bigger than others, discovered by Cantor in the late 19th century. This idea had devastating and transformative effects: it created a theological crisis since infinity was associated with God; sparked a mathematical civil war with Kronecker calling Cantor a 'corrupter of youth'; led to paradoxes like Russell's paradox about sets that don't contain themselves; and personally affected Cantor, who spent his final years in sanatoriums obsessed with proving the continuum hypothesis. The question asks how infinities can be different sizes and why this was so transformative to mathematics."
  },
  {
    "chunk_id": 29,
    "source_file": "file5.md",
    "part1": "y and telling the story much earlier than Cantor, actually, because, I mean, you can go all the way back to Ancient Greek times when Aristotle emphasized the potential aspect of infinity as opposed to the impossibility, according to him, of achieving an actual infinity. And Archimedes' method of exhaustion where he is trying to understand the area of a region by carving it into more and more triangles, say, and sort of exhausting the area and thereby understanding the total area in terms of the sum of the areas of the pieces that he put into it. And it proceeded on this kind of potential understanding of infinity for hundreds of years, thousands of years. Almost all mathematicians were almost all mathematicians were potentialists only and thought that it was incoherent to speak of an actual infinity at all. Galileo is an extremely prominent exception to this, though he argued against this sort of potentialist orthodoxy in The Dialogue of Two New Sciences. Really lovely account there that he gave. And that the... In many ways, Galileo was anticipating Cantor's developments, except he couldn't quite push it all the way through and ended up throwing up his hands in confusion in a sense.",
    "part2": "I mean, the Galileo paradox is the idea or the observation that if you think about the natural numbers, I would start with zero but I think maybe he would start with one. The numbers one, two, three, four, and so on, and you think about which of those numbers are perfect squares. So zero squared is zero and one squared is one and two squared is four, three squared is nine, 16, 25, and so on. And Galileo observed that, that the perfect squares can be put into a one-to-one correspondence with all of the numbers. I mean, we just did it. I associated every number with its square. And so it seems like on the basis of this one-to-one correspondence that there should be exactly the same number of squares, perfect squares as there are numbers, and yet there's all the gaps in between the perfect squares, right? And, and this suggests that there should be fewer perfect squares, more numbers than squares because the numbers include all the squares plus a lot more in between them, right? And Galileo was quite troubled by this observation because he took it to cause a kind of incoherence in the comparison of infinite quantities, right? And another example is, if you take two line segments of different lengths, and you can imagine drawing a kind of foliation, a fan of lines that connect them. So the endpoints are matched from the shorter to the longer segment, and the midpoints are matched and so on. So spreading out the lines as you go. And so every point on the shorter line would be associated with a, a unique distinct point on the longer line in a one-to-one way. And so it seems like the two line segments have the same number of points on them because of that, even though the longer one is longer. And so it makes, again, a kind of confusion over our ideas about infinity. And al"
  },
  {
    "chunk_id": 30,
    "source_file": "file5.md",
    "part1": "so with two circles, if you just place them concentrically and draw the rays from the center, then every point on the smaller circle is associated with a corresponding point on the larger circle, you know, in a one-to-one way. And, and again, that seems to show that the smaller circle has the same number of points on it as the larger one, precisely precisely because they can be put into this one-to-one correspondence. Of course, the contemporary attitude about this situation is that those two infinities are exactly the same, and that Galileo was right in those observations about the equinumerosity. We would talk about it now by appealing to what I call the Cantor-Hume principle, or some people just call it Hume's principle, which is the idea that if you have two collections, whether they're finite or infinite, then we want to say that those two collections have the same size. They're equinumerous if and only if there's a one-to-one correspondence between those collections. Galileo was observing that line segments of different lengths are equinumerous, and the perfect squares are equinumerous with all of the natural numbers, and any two circles are equinumerous, and so on. The tension between the Cantor-Hume principle and what could be called Euclid's principle, which is that the whole is always greater than the part, is a principle that Euclid appealed to in the Elements many times when he's calculating area and so on. It's a basic idea that if something is just a part of another thing, then the whole is greater than the part. So what Galileo was troubled by was this tension between what we call the Cantor-Hume principle and Euclid's principle. It wasn't fully resolved, I think, until Cantor. He's the one who really explained so clearly about these different sizes of infinity and so on in a way that was so compelling.",
    "part2": "He exhibited two different infinite sets and proved that they're not equinumerous; they can't be put into one-to-one correspondence. It's traditional to talk about the uncountability of the real numbers. Cantor's big result was that the set of all real numbers is an uncountable set. Maybe if we're going to talk about countable sets, then I would suggest that we talk about Hilbert's Hotel, which really makes that idea perfectly clear. - Yeah, let's talk about Hilbert's Hotel. - Hilbert's Hotel is a hotel with infinitely many rooms. Each room is a full floor suite. So there's floor zero... I always start with zero because for me, the natural numbers start with zero, although that's maybe a point of contention for some mathematicians. The other mathematicians are wrong. - Like I mentioned, I'm a programmer, so starting at zero is a wonderful place to start. - Exactly. So there's floor zero, floor one, floor two, or room zero, one, two, three, and so on, just like the natural numbers. So Hilbert's Hotel has a room for every natural number, and it's completely full. There's a person occupying room N for every N. But meanwhile, a new gues"
  },
  {
    "chunk_id": 31,
    "source_file": "file5.md",
    "part1": "t comes up to the desk and wants a room. \"Can I have a room, please?\" The manager says,\n\"Hang on a second, just give me a moment.\" You see, when the other guests had checked in, they had to sign an\nagreement with the hotel that maybe there would be some changing of the rooms during this stay.\nSo the manager sent a message up to all the current occupants and told every person, \"Hey, can you\nmove up one room, please?\" So the person in room five would move to room six, and the person in room six would move to room seven and so on. And everyone\nmoved at the same time. And of course, we never want to be placing two different guests in the same room, and we want everyone to have their own private room\nand... But when you move everyone up one room, then the bottom room, room zero, becomes available, of course. And so he can put the new guest in\nthat room. So even when you have infinitely many things, then the new guest can be accommodated. And that's a way of\nshowing how the particular infinity of the occupants of Hilbert's Hotel, it violates Euclid's principle. I\nmean, it exactly illustrates this idea because adding one more element to a set didn't make it larger, because we\ncan still have a one-to-one correspondence between the total new guests and the old guests by the room number, right?\n- So, to just say one more time, the hotel is full. - The hotel is full.\n- And then you could still squeeze in one more, and that breaks the traditional notion of mathematics and breaks\npeople's brains when they try to think about infinity, I suppose. This is a property of infinity.\n- It's a property of infinity that sometimes when you add an element to a set, it doesn't get larger. That's what this\nexample shows. But one can go on with Hilbert's Hotel, for example. I mean, maybe the next day, you know,\n20 people show up all at once. We can easily do the same trick again, just move everybody up 20 rooms. And then we would have 20\nempty rooms at the bottom, and those new 20 guests could go in. But on the following weekend, a giant bus pulled up, Hilbert's\nbus. And Hilbert's bus has, of course, infinitely many seats. There's Seat Zero, Seat One, Seat Two, Seat Three, and so\non. And so one wants to... You know, all the people on the bus want to check into the hotel, but the hotel is completely full. So what is the manager going to\ndo? And when I talk about Hilbert's Hotel, when I teach Hilbert's Hotel in class, I always demand that the\nstudents provide, you know, the explanation of- of how to do it. So maybe I'll ask you.\nCan you tell me, yeah, what is your idea about how to fit them all in the hotel, everyone on the bus, and also the current occupants?\n- You separate the hotel into even and odd rooms, and you squeeze in the new",
    "part2": "Hilbert bus people into the odd rooms and the previous occupants go into the even rooms. - That's exactly right. That's a very easy way to do it. If\nyou just tell all the current guests to double their room number, so in Room N, you move to Roo"
  },
  {
    "chunk_id": 32,
    "source_file": "file5.md",
    "part1": "m 2 times N. So they're all going to get their own private room, the new room, and it will always be an even number 'cause 2 times N is always an even number. And so all the odd rooms become empty that way. And now we can put the bus occupants into the odd-numbered rooms. - And by doing so, you have now shoved an infinity into another infinity. - That's right. So what it really shows... I mean, another way of thinking about it is that, well, we can define that a set is countable if it is equinumerous with a set of natural numbers. And a kind of easy way to understand what that's saying in terms of Hilbert's Hotel is that a set is countable if it fits into Hilbert's Hotel, 'cause Hilbert's Hotel basically is the set of natural numbers in terms of the room numbers. So to be equinumerous with a set of natural numbers is just the same thing as to fit into Hilbert's Hotel. And so what we've shown is that if you have two countably infinite sets, then their union is also countably infinite. If you put them together and form a new set with all of the elements of either of them, then that union set is still only countably infinite. It didn't get bigger. And that's a remarkable property for a notion of infinity to have, I suppose. But if you thought that there was only one kind of infinity, then it wouldn't be surprising at all, because if you take two infinite sets and put them together, then it's still infinite. And so if there were only one kind of infinity, then it shouldn't be surprising... that the union of two countable sets is countable.",
    "part2": "So there's another way to push this a bit harder, and that is when Hilbert's train arrives, and Hilbert's train has infinitely many train cars......and each train car has infinitely many seats. And so we have an infinity of infinities of the train passengers together with the current occupants of the hotel, and everybody on the train wants to check in to Hilbert's Hotel. So the manager can, again, of course, send a message up to all the rooms telling every person to double their room number again. And so that will occupy all the even-numbered rooms again, and but free up again the odd-numbered rooms. So somehow, we want to put the train passengers into the odd-numbered rooms. And so while every train passenger is on some car, let's say Car C and Seat S, so somehow, we have to take these two coordinates, you know, C, S, the car number and the seat number, and produce from it an odd number in a one-to-one way, you know? And that's actually not very difficult. In fact, one can just use, say... An easy way to do it is to just use the number 3 to the C times 5 to the S. 3 to the C, 3 to the car number, so 3 x 3 x 3, you know, the number of the car. You multiply 3 by itself, the number of the train car, and then you multiply 5 by itself the seat number of times, and then you multiply those two numbers together. So 3 to the C times 5 to the S. That's always an odd number, 'cause the prime factorization has only 3s and 5s"
  },
  {
    "chunk_id": 33,
    "source_file": "file5.md",
    "part1": "in it. There's no 2 there. So therefore, it's definitely an odd number, and it's always different because of the uniqueness of prime factorization. So every number can be factored uniquely into primes. So if you have a number of that form, then you can just factor it, and that tells you the exponent on 3 and the exponent on 5. And so you know exactly which person it was, which car they came from, and which seat they came from. - And prime factorization is every single number can be decomposed into the atoms of mathematics, which is the prime numbers. You can multiply them together to achieve that number. And that's prime factorization. You're showing 3 and 5 are both prime numbers, odd. So through this magical formula, you can deal with this train, infinite number of cars, with each car having infinite number of seats. - Exactly right. We've proved that if you have countably many countable sets, then the union of those sets, putting all those sets together into one giant set, is still countable. You know, because the train cars are each countable, plus the current hotel. It's sort of like another train car, if you want to think about it that way. The current occupants of the hotel could, you know, have the same number as any of the train cars. So putting countably many countable sets together to make one big union set is still countable. It's quite remarkable, I think. I mean when I first learned this many, many years ago, I was completely shocked by it and transfixed by it. It was quite amazing to me that this notion of countable infinity could be closed under this process of infinitely many infinities adding up still to the very same infinity, which is a strong instance, a strong violation of Euclid's principle once again, right? So, the new set that we built is... has many more elements than the old set in the sense that there are additional elements, but it doesn't have many more elements in terms of its size because it's still just a countable infinity and it fits into Hilbert's Hotel.",
    "part2": "- Have you been able to sort of internalize a good intuition about countable infinity? Because that is a pretty weird thing. You can have a countably infinite set of countably infinite sets, and you can shove it all in and it still is a countable infinite set. - Yeah, that's exactly right. I mean, I guess, of course, when you work with these notions, the argument of Hilbert's Hotel becomes kind of clear. There are many other ways to talk about it too. For example, let's think about, say, the integer lattice, the grid of points that you get by taking pairs of natural numbers, say, so the upper right quadrant of the integer lattice, yeah? So there's the, you know, row zero, row one, row two and so on, column zero, column one, column two and so on, and each row and column has a countable infinity of points on it, right? So those dots, if you think about them as dots, are really the same as the train cars if you think about each column of... )"
  },
  {
    "chunk_id": 34,
    "source_file": "file5.md",
    "part1": "ttice, it's a countable infinity. It's like one train car and then there's the next train car next to it, and then the next column next to that, the next train car. And so, but if we think about it in this grid manner, then I can imagine a kind of winding path winding through these grid points, like up and down the diagonals. Winding back and forth. So I start at the corner point and then I go down, up and to the left, and then down and to the right, up and to the left, down and to the right, and so on, in such a way that I'm going to hit every grid point on this path. So, this gives me a way of assigning room numbers to the points. Because every grid point is going to be the Nth point on that path for some N. And that that gives a correspondence between the grid points and the natural numbers themselves. So it's a kind of different picture. Before, we used this 3 to the C, 5 times 5 to the S, which is a kind of, you know, overly arithmetic way to think about it. But there's a kind of direct way to understand that it's still a countable infinity when you have countably many countable sets, because you can just start putting them on this list. And as long as you give each of the infinite collections a chance to add one more person to the list, then you're going to accommodate everyone in any of the sets in one list.",
    "part2": "- Yeah, it's a really nice visual way to think about it. You just zigzag your way across the grid to make sure everybody's included. That gives you an algorithm for including everybody. So, can you speak to the uncountable infinities? - Yeah, absolutely. - What are the integers and the real numbers- - Correct - and what is the line that Cantor was able to find? - Maybe there's one more step I want to insert before doing that. Which is the rational numbers. So we did pairs of natural numbers. Right? That's the train car, basically. But maybe it's a little bit informative to think about the rational, the fractions, the set of fractions, or rational numbers, because a lot of people maybe have an expectation that maybe this is a bigger infinity because the rational numbers are densely ordered. Between any two fractions, you can find another fraction, right? The average of two fractions is another fraction. And so, sometimes people, it seems to be a different character than the integers, which are discretely ordered, right? From any integer, there's a next one and a previous one, and so on. But that's not true in the rational numbers. And yet, the rational numbers are also still only a countable infinity. And the way to see that is actually it's just exactly the same as Hilbert's train again, because every fraction consists of two integers: the numerator and the denominator. And so if I tell you two natural numbers, then you know what fraction I'm talking about. I mean, plus the sign issue, I mean if it's positive or negative. But if you just think about the positive fractions, then, you know, you have the numbers of the form P over Q, wher"
  },
  {
    "chunk_id": 35,
    "source_file": "file5.md",
    "part1": "e Q is not zero. So you can still do 3 to the P times 5 to the Q. The same idea works. with the rational numbers. So this is still a countable set. And you might think, \"Well, every set is going to be countable because there's only one infinity.\" I mean, if that's a kind of perspective maybe that you're adopting, but it's not true, and that's the profound achievement that Cantor made is proving that the set of real numbers is not a countable infinity. It's a strictly larger infinity, and therefore there's more than one concept of infinity, more than one size of infinity. - So let's talk about the real numbers. What are the real numbers? Why do they break infinity? The countable infinity. Looking it up on Perplexity, real numbers include all the numbers that can be represented on the number line, encompassing both rational and irrational numbers. We've spoken about the rational numbers, and the rational numbers, by the way, are by definition, the numbers that can be represented as a fraction of two integers. - That's right. So with the real numbers, we have the algebraic numbers. We have, of course, all the rational numbers. The integers and the rationals are all part of the real number system. But then also, we have the algebraic numbers like the square root of 2 or the cube root of 5 and so on. Numbers that solve an algebraic equation over the integers, those are known as algebraic numbers.",
    "part2": "It was an open question for a long time whether that was all of the real numbers or whether there would exist numbers that are the transcendental numbers. The transcendental numbers are real numbers that are not algebraic. - And we won't even go to the surreal numbers about which you have a wonderful blog post. We'll talk about that a little bit later. - Oh, great. So it was Liouville who first proved that there are transcendental numbers, and he exhibited a very specific number that's now known as the Liouville constant, which is a transcendental number. Cantor also famously proved that there are many, many transcendental numbers. In fact, it follows from his argument on the uncountability of the real numbers that there are uncountably many transcendental numbers. So most real numbers are transcendental. - And again, going to Perplexity, \"Transcendental numbers are 'real' or 'complex' numbers; they are not the root of any nonzero polynomial with integer or rational coefficients. This means they cannot be expressed as solutions to algebraic equations with integer coefficients, setting them apart from algebraic numbers.\" - So some of the famous transcendental numbers would include the number pi, you know, the 3.14159265 and so on. So that's a transcendental number. Also, Euler's constant, the e, like e to the x, the exponential function. - So you could say that some of the sexiest numbers in mathematics are all transcendental numbers? - Absolutely. That's true. Yeah, yeah. Although, you know, I don't know, square root of two is pretty - Square root. All right."
  },
  {
    "chunk_id": 36,
    "source_file": "file5.md",
    "part1": "So it depends. Let's not... Beauty can be found in in all the different kinds of sets, but yeah.\n- That's right. And if you have a kind of simplicity attitude, then zero and one are looking pretty good too, so... And they're definitely not\n- Sorry to take that tangent, but what is your favorite number? Do you have one? - Oh, gosh. You know- - Is it zero?\n- Did you know there's a proof that every number is interesting? You can prove it, because...\n- Yeah? What's that proof look like? - Yeah, okay. - How do you even begin? - I'm gonna prove to you- - Okay - ...that every natural number is interesting.\n- Okay. - Yeah. I mean, zero's interesting because it's the additive identity, right? That's pretty interesting. And one is the multiplicative identity, so when you multiply it by any other number, you just get that number back, right? And two is, you know, the first prime number. That's super interesting, right? And-\nOkay. So one can go on this way and give specific reasons, but I wanna prove as a general principle that every number is interesting. And this is the proof. Suppose, toward contradiction, that there were some boring numbers.\nOkay? - Oh, okay. - But if there was an uninteresting number- - Yes\n- ...then there would have to be a smallest uninteresting number. - Mm-hmm. Yes.\n- But that's a contradiction, because the smallest uninteresting number is a super interesting property to have. So therefore-\n- Ah, that's good. - ...there cannot be any boring numbers. - I'm gonna have to try to find a hole in that proof- because there's a lot of baked in in the word interesting, but yeah, that's a beautiful. - Right. - That doesn't say anything about the transcendental numbers, about the real numbers that you just proved from just- - That's right - ...four natural numbers. - Yeah. Okay, should we get back to Cantor's argument, or- - Sure.",
    "part2": "You've masterfully avoided the question. Well, you basically said, \"I love all numbers.\" - Yeah, basically.\n- Is that what you said? - Yeah. That was my intention. - Back to Cantor's argument. Let's go. - Okay, so Cantor wants to prove that the infinity of the real numbers is different and strictly larger than the infinity of the natural numbers. So the natural numbers are the numbers that start with zero and add one successively, so zero, one, two, three, and so on. And the real numbers, as we said, are the numbers that come from the number line, including all the integers and the rationals and the algebraic numbers and the transcendental numbers and all of those numbers altogether. Now, obviously, since the natural numbers are included in the real numbers, we know that the real numbers are at least as large as the natural numbers. And so the claim that we want to prove is that it's strictly larger. So suppose that it wasn't strictly larger. So then they would have the same size. But to have the same size, remember, means by definition that there's a one-to-one correspondence between them. So we suppose that the re"
  },
  {
    "chunk_id": 37,
    "source_file": "file5.md",
    "part1": "al numbers can be put into one-to-one correspondence with the natural numbers. So therefore, for every natural number N, we have a real number, let's call it R sub N. R sub N is the Nth real number on the list. Basically, our assumption allows us to think of the real numbers as having been placed on a list, R1, R2, and so on. Okay, and now I'm going to define the number Z, and it's going to be... The integer part is going to be a zero, and then I'm going to put a decimal place, and then I'm going to start specifying the digits of this number Z. D1, D2, D3, and so on. And what I'm going to make sure is that the Nth digit after the decimal point of Z is different from the Nth digit of the Nth number on the list. Okay? So, to specify the Nth digit of Z, I go to the Nth number on the list, R sub N, and I look at its Nth digit after the decimal point. And whatever that digit is, I make sure that my digit is different from it. Okay? And then I want to do something a little bit more, and that is I'm going to make it different in a way that I'm never using the digits zero or nine. I'm just always using the other digits and not zero and it would form a kind of diagonal going down and to the right, and that, for that reason, this argument is called the diagonal argument because we're looking at the Nth digit of the Nth number, and those exist on a kind of diagonal going down. And we've made our number Z so that the Nth digit of Z is different from the Nth digit of the Nth number. But now it follows that Z is not on the list because Z is different from R1 because, well, the first digit after the decimal point of Z is different from the first digit of R1 after the decimal point. That's exactly how we built it. And the second digit of Z is different from the second digit of R2 and so on. The Nth digit of Z is different from the Nth digit of R sub N for every N. So therefore, Z is not equal to any of these numbers R sub N. And but that's a contradiction because we had assumed that we had every real number on the list, but yet here is a real number Z that's not on the list, okay? And so that's the main contradiction.",
    "part2": "- And so it's a kind of proof by construction. - Exactly. So given a list of numbers, Cantor's proving... It's interesting that you say that actually, because there's a kind of philosophical controversy that occurs in connection with this observation about whether Cantor's construction is constructive or not. Given a list of numbers, Cantor gives us a specific means of constructing a real number that's not on the list, is a way of thinking about it. There's this one aspect, which I alluded to earlier, but some real numbers have more than one decimal representation, and it causes this slight problem in the argument. For example, the number one, you can write it as 1.0000 forever, but you can also write it as 0.999 forever. Those are two different decimal representations of exactly the same number. - You beautifully got rid of the zeros and the nines"
  },
  {
    "chunk_id": 38,
    "source_file": "file5.md",
    "part1": ". Therefore, we don't need to even consider that, and the proof still works. - Exactly, because the only kind of case where that phenomenon occurs is when the number is eventually zero or eventually nine. And so since our number Z never had any zeros or nines in it, it wasn't one of those numbers. And so actually, in those cases, we didn't need to do anything special to diagonalize. Just the mere fact that our number has a unique representation already means that it's not equal to those numbers. So maybe it was controversial in Cantor's day more than 100 years ago, but I think it's most commonly looked at today as, you know, one of the initial main results in set theory, and it's profound and amazing and insightful and the beginning point of so many later arguments. And this diagonalization idea has proved to be an extremely fruitful proof method, and almost every major result in mathematical logic is using in an abstract way the idea of diagonalization. It was really the start of so many other observations that were made, including Russell's paradox and the halting problem and the recursion theorem, and so many other principles are using diagonalization at their core.",
    "part2": "So... - Can we just step back a little bit? - Sure. - This infinity crisis led to a kind of rebuilding of mathematics. So it'd be nice if you lay out the things it resulted in. So one is set theory became the foundation of mathematics. All mathematics could now be built from sets, giving math its first truly rigorous foundation. The axiomatization of mathematics, the paradoxes forced mathematicians to develop ZFC and other axiomatic systems, and mathematical logic emerged. Gödel, Turing, and others created entire new fields. So can you explain what set theory is and, how does it serve as a foundation of modern mathematics and maybe even the foundation of truth? - That's a great question. Set theory really has two roles that it's serving. There's kind of two ways that set theory emerges. On the one hand, set theory is its own subject of mathematics, with its own problems and questions and answers and proof methods. And so really, from this point of view, set theory is about the transfinite recursive constructions or well-founded definitions and constructions. And those ideas have been enormously fruitful and set theorists have looked into them and developed so many ideas coming out of that. But set theory has also happened to serve in this other foundational role. It's very common to hear things said about set theory that really aren't taking account of this distinction between the two roles that it's serving. It's its own subject, but it's also serving as a foundation of mathematics. So in its foundational role, set theory provides a way to think of a collection of things as one thing. That's the central idea of set theory. A set is a collection of things, but you think of the set itself as one abstract thing. So when you form the set of real numbers, then that is a set. It's one t"
  },
  {
    "chunk_id": 39,
    "source_file": "file5.md",
    "part1": "hing. It's a set, and it has elements inside of it. So it's sort of like a bag of objects. A set is kind of like a bag of objects. And so we have a lot of different axioms that describe the nature of this idea of thinking of a collection of things as one thing itself, one abstract thing. - And axioms are, I guess, facts that we assume are true, based on which we then build the ideas of mathematics. So there's a bunch of facts, axioms about sets that we can put together, and if they're sufficiently...... powerful, we can then build on top of that a lot of really interesting mathematics. - Yeah, I think that's right. So, I mean, the history of the current set theory axioms, known as the Zermelo-Fraenkel axioms, came out in the early 20th century with Zermelo's idea. I mean, the history is quite fascinating because Zermelo in 1904 offered a proof that what's called the axiom of choice implies the well-order principle. So he described his proof, and that was extremely controversial at the time. And there was no theory, there weren't any axioms there. Cantor was not working in an axiomatic framework. He didn't have a list of axioms in the way that we have for set theory now, and Zermelo didn't either. And his ideas were challenged so much with regard to the well-order theorem—",
    "part2": "—that he was pressed to produce the theory in which his argument could be formalized, and that was the origin of what's known as Zermelo set theory. - And going to perplexity, the axiom of choice is a fundamental principle in set theory which states that for any collection of non-empty sets, it is possible to select exactly one element from each set, even if no explicit rule to make the choices given. This axiom allows the construction of a new set containing one element from each original set, even in cases where the collection is infinite or where there is no natural way to specify a selection rule. So this was controversial and this was described before there's even a language for axiomatic systems. - That's right. So on the one hand, I mean, the axiom of choice principle is completely obvious that we want this to be true, that it is true. I mean, a lot of people take it as a law of logic. If you have a bunch of sets, then there's a way of picking an element from each of them. picking an element from each of them. There's a function. If I have a bunch of sets, then there's a function that, when you apply it to any one of those sets, gives you an element of that set. It's- it's a completely natural principle. I mean, it's called the axiom of choice, which is a way of sort of anthropomorphizing the mathematical idea. It's not like the function is choosing something. I mean, it's just that if you were to make such choices, there would be a function that consisted of the choices that you made. And the difficulty is that when you- when you can't specify a rule or a procedure by which you're making choices, then it's difficult to say choices, then it's difficult to say what the fun"
  },
  {
    "chunk_id": 40,
    "source_file": "file5.md",
    "part1": "ction is that you're asserting exists. function is that you're asserting exists. You know, you- you want to have the view that, well, there is a way of choosing. I don't have an easy way to say what the function is, but there definitely is one. Yeah, this is the way of thinking about the axiom of choice. - So we're going to say the- the- the three letters of ZFC may be a lot on this conversation. You already mentioned- - Right - ...Zermelo-Fraenkel set theory, that's the Z and the F and the C in that is this... and the C in that is this... Comes from this axiom of choice. - That's right. - So ZFC sounds like a super technical thing, but it is the set of axioms that's the foundation of modern mathematics. - Yeah, absolutely. So one should be aware also that there's huge parts of mathematics that don't... That pay attention to whether the axiom of choice is being used and they don't want to use the axiom of choice, so they work out the consequences that's- that are possible without the axiom of choice or with weakened forms of- of Zermelo-Fraenkel set theory and so on.",
    "part2": "And that's quite a- there's quite a vibrant amount of work in that area. I mean, but going back to the axiom of choice for a bit, it's maybe interesting to- to give Russell's description of how to think about the axiom of choice. So Russell describes, this rich person who has a- an infinite closet. And in that closet, he has infinitely many pairs of shoes and he tells his butler to \"Please go and give me one shoe from each pair.\" And- and the butler can do this easily because he can... For any pair of shoes, he can just always pick the left shoe. I mean, there's a way of picking that we can describe. We always take the left one or always take the right one, or take the left one if it's a red shoe and the right one if it's a brown shoe or, you know. We can invent rules that would result in these kind of choice functions, so we can describe explicit choice functions. And for those cases, you don't need the axiom of choice you don't need the Axiom of Choice to know that there's a choice function. When you can describe a specific way of choosing, then you don't need to appeal to the axiom to know that there's a choice But the problematic case occurs when you think about the infinite collection when you think about the infinite collection of socks that the person has in their closet. And if we assume that socks are sort of indistinguishable within each pair, you know, they match each other, indiscernible, then the- the butler wouldn't have any kind of rule for which sock in each pair to pick."
  },
  {
    "chunk_id": 41,
    "source_file": "file5.md",
    "part1": "But of course, as a matter of mathematical ontology, we might find attractive the idea that, well, look, I mean, I don't- not every way of choosing the socks has to be defined by rule. Why should everything that exists in mathematical reality follow a rule or a procedure of that sort? If I have the idea that my mathematical ontology is rich with objects, then I think that, that there are all kinds of functions and ways of choosing. Those are all part of the mathematical reality that I wanna be talking about.... and so I don't have any problem asserting the Axiom of Choice. Yes, there is a way of choosing, But I can't t- necessarily tell you what it is. But in a mathematical argument, I can assume that I fix the choice function because I know that there is one. So it's a... The philosophical difference between working when you have the Axiom of Choice and when you don't is the question of this constructive nature of the argument. So if you make an argument and you appeal to the Axiom of Choice, then maybe you're admitting that the objects that you're producing in the proof are not gonna be constructive. You're not gonna be able to necessarily say specific things about them. But if you're just claiming to make an existence claim, that's totally fine. Whereas if you have a constructive attitude about ma- the nature of mathematics, and you think that mathematical claims maybe are only warranted when you can provide an explicit procedure for producing the mathematical objects that you're dealing with then you're probably gonna wanna deny the axiom of choice and maybe much more.",
    "part2": "- Can we maybe speak to the axioms that underlie ZFC? So cone of perplexity, ZFC, or Zermelo-Fraenkel set theory with the Axiom of Choice, as we mentioned, is the standard foundation for most modern mathematics. It consists of the following main axioms: Axiom of Extensionality, Axiom of Empty Set, Axiom of Pairing, Axiom of Union, Axiom of Power Set, Axiom of Infinity, Axiom of Separation, Axiom of Replacement, Axiom of Regularity, and Axiom of Choice. Some of these are quite basic, but it would be nice to kinda give people a sense- ...of what it means to be an axiom. Like, what kind of basic facts we can lay on the table on which we can build some beautiful mathematics. - Yeah, so the history of it is really quite fascinating. So, Zermelo introduced most of these axioms, I mean, as part of what's now called Zermelo set theory, to formalize his proof from the Axiom of Choice to the Well-Order Principle, which was an extremely controversial result. So in 1904, he gave the proof without the theory, and then he was challenged to provide the theory. And so in 1908, he produced the Zermelo set theory and gave the proof that in that theory, you can prove that every set admits a well ordering. And so the axioms on the list, these things like extensionality, express the most fundamental principles of the understanding of sets that he wanted to be talking about. So for e"
  },
  {
    "chunk_id": 42,
    "source_file": "file5.md",
    "part1": "xample, extensionality says if two sets have the same members, then they're equal. So it's this idea that the sets consist of the collection of their members, and that's it. There's nothing else that's going on in the set. So it's just if two sets have the same members, then they are the same set. So it's maybe the most primitive axiom in some respect.\n- Well, there's also, just to give a flavor, there exists a set with no elements, called the empty set. For any two sets, there's a set that contains exactly those two sets as elements. For any set, there's a set that contains exactly the elements of the elements of that set, so the union set. And then there's the power set. For any set, there's a set whose elements are exactly the subsets of the original set, the power set. In the axiom of infinity, there exists an infinite set, typically a set that contains the empty set and is closed under the operation of adding one more element. Back to our hotel example.\n- That's right. - And there's more, but this is kind of fascinating. Just put yourself in the mindset of people at the beginning of this, of trying to formalize set theory. It's fascinating that humans can do that.",
    "part2": "- I read some historical accounts by historians about that time period, specifically about Zermelo's axioms and his proof of the well-order theorem. And the historians were saying never before in the history of mathematics has a mathematical theorem been argued about so publicly and so vociferously as that theorem of Zermelo's. And it's fascinating also because the axiom of choice was widely regarded as a kind of, you know, basic principle at first, but then when, but people were very suspicious of the well-order theorem because no one could imagine a well ordering, say, of the real numbers. And so this was a case when Zermelo seemed to be, from principles that seemed quite reasonable, proving this obvious untruth. And so people were, mathematicians were objecting. But then Zermelo and others actually looked into the mathematical papers and so on of some of the people who had been objecting so vociferously, and found, in many cases, that they were implicitly using the axiom of choice in their own arguments, even though they would argue publicly against it. Because it's so natural to use it because it's such an obvious principle in a way. I mean, it's easy to just use it by accident if you're not critical enough and you don't even realize that you're using the axiom of choice. That's true now, even. People like to pay attention to when the axiom of choice is used or not used in mathematical arguments, up until this day. It used to be more important. In the early 20th century it was very important because people didn't know if it was a consistent theory or not, and there were these antinomies arising. and so there was a worry about consistency of the axioms. but then, of course, eventually, with the result of, of Godel and Cohen and so on, they... this consistency question specifical"
  },
  {
    "chunk_id": 43,
    "source_file": "file5.md",
    "part1": "ly about the axiom of choice sort of falls away. We know that the axiom of choice itself choice itself will never be the source of inconsistency in set theory. If there's inconsistency with the axiom of choice, then it's, it's already inconsistent without the axiom of choice. So it's not the cause of inconsistency. And so in that... from that point of view, the need to pay attention to whether you're using it or not from a consistency point of view is somehow less important. But still there's this reason to pay attention to it on the grounds of these constructivist ideas that I had mentioned earlier. - And we should say, in set theory, consistency means that it is impossible to derive a contradiction from the axioms of the theory. It means that there are no contradictions. That's a... - That's right - A consistent axiomatic system is that there are no contradictions. - A consistent theory is one for which you cannot prove a contradiction from that theory. - Maybe a quick pause, a quick break, a quick bathroom break.",
    "part2": "Russell's paradox\nYou mentioned to me offline we were talking about Russell's paradox and that there's a- a nice, another kind of anthropomorphizable proof of uncountability. I was wondering if you can lay that out. - Oh yeah, sure. Absolutely. - Both Russell's paradox and the proof. - Right. So we talked about Cantor's proof that the real numbers, the set of real numbers is an uncountable infinity, it's a strictly larger infinity than the natural numbers. But Cantor actually proved a- a much more general fact, namely that for any set whatsoever, the power set of that set is a strictly larger set. So the power set is the set containing all the subsets of the original set. So if you have a set and you look at the collection of all of its subsets, then Cantor proved that this is- this is a bigger set. They're not equinumerous. Of course, there's always at least as many subsets as elements because for any element you can make, the- the singleton subset that has only that guy as a member, right? So there's always at least as many subsets as elements. But the question is whether they, whether it's strictly more or not. And so Cantor reasoned like this. It's very simple. It's a kind of distilling the abstract diagonalization idea without being encumbered by the complexity of the real numbers. So, we have a set X, and we're looking at all of its subsets. That's the power set of X. Suppose that X and the power set of X have the same size. Suppose, towards contradiction, they have the same size. So that means we can associate to every individual of X a subset. And so now let me define a new set. Another set, I'm going to define it. Let's call it D. And D is the subset of X that contains all the individuals that are not in their set. Every individual was associated with a subset of X, and I'm looking at the individuals that are not in their set. Maybe nobody's like that. Maybe there's no element of X that's like that, or maybe they're all like"
  },
  {
    "chunk_id": 44,
    "source_file": "file5.md",
    "part1": "that, or maybe some of them are and some of them aren't. It doesn't really matter for the argument. I defined a subset D consisting of the individuals that are not in the set that's attached to them, but that's a perfectly good subset. And so because of the equinumerosity, it would have to be attached to a particular individual, you know? And- ...but that... let's call that person, it should be a name starting with D, so Diana. And now we ask, is Diana an element of D or not? But if Diana is an element of D, then she is in her set. So she shouldn't be because the set D was the set of individuals that are not in their set. So if Diana is in D, then she shouldn't be. But if she isn't in D, then she wouldn't be in her set. And so she should be in D. That's a contradiction. So therefore, the number of subsets is always greater than the number of elements for any set.",
    "part2": "And the anthropomorphizing idea is the following. I'd like to talk about it this way. For any collection of people, you can form more committees from them than there are people, even if you have infinetely many people. Suppose you have an infinite set of people. And what's a committee? Well, a committee is just a list of who's on the committee, basically. The members of the committee. So there's all the two-person committees and there's all the one-person committees, and there's the universal, the worst committee, the one that everyone is on. Okay. The best committee is the empty committee. With no members and never meets and so on. Or is the empty committee meeting all the time? I'm not sure. - Yeah. That's... wow, that's a profound question. And does a committee with just one member meet also as a- - Yeah, maybe it's always in session. I don't know. So the claim is that there are more committees than people. Okay. Suppose not. Well, then we could make an association between the people and the committees. So we would have every committee could be named after a person in a one-to-one way. And I'm not saying that the person is on the committee that's named after them, or not on it, whatever. Maybe sometimes that happens, sometimes it doesn't. I don't know. It doesn't matter. But let's form what I call committee D, which consists of all the people that are not on the committee that's named after them. Okay. Maybe that's everyone, maybe it's no one, maybe it's half the people. It doesn't matter. That's a committee. It's a set of people. And so it has to be named after someone. Let's call that person Daniella. So now we ask, is Daniella on the committee that's named after her? Well, if she is, then she shouldn't be because it was the committee of people who aren't on their own committee. And if she isn't, then she should be. So again, it's a contradiction. So when I was teaching at Oxford, one of my students came up with the following different anthropomorphization of Cantor's argument. Let's consider all possible fruit salads. We have a given collection of fruits. You know, apples and orang"
  },
  {
    "chunk_id": 45,
    "source_file": "file5.md",
    "part1": "es and grapes, whatever. And a fruit salad consists of some collection of those fruits. So there's the banana, pear, grape salad and so on. There are a lot of different kinds of salad. Every set of fruits makes a salad, a fruit salad. Okay. And we want to prove that for any collection of fruits, even if there are infinitely many different kinds of fruit, for any collection of fruits, there are more possible fruit salads than there are fruits. So if not, then you can put a one-to-one correspondence between the fruits and the fruit salads, so you could name every fruit salad after a fruit. That fruit might not be in that salad, it doesn't matter. We're just... it's a naming, a one-to-one correspondence. And then, of course, we form the diagonal salad, which consists of all the fruits that are not in the salad that's named after them. And that's a perfectly good salad. It might be the kind of diet salad, if it was the empty salad, or it might be the universal salad which had all fruits in it, if all the fruits were in it. Or it might have just some and not all. So that diagonal salad would have to be named after some fruit. So let's suppose it's named after durian, meaning that it was associated with durian in the one-to-one correspondence. And then we ask, well, is durian in the salad that it's named after? And if it is, then it shouldn't be. And if it isn't, then it should be. And so it's again the same contradiction.",
    "part2": "So all of those arguments are just the same as Cantor's proof that the power set of any set is bigger than the set. And this is exactly the same logic that comes up in Russell's paradox, because Russell is arguing that the class of all sets can't be a set, because if it were, then we could form the the set of all sets that are not elements of themselves. So basically, what Russell is proving is that there are more collections of sets than elements. Because we can form the diagonal class, you know, the class of all sets that are not elements of themselves. If that were a set, then it would be an element of itself if and only if it was not an element of itself. It's exactly the same logic in all four of those arguments. Yeah. So there can't be a class of all sets, because if there were, then there would have to be a class of all sets that aren't elements of themselves. But that set would be an element of itself if and only if it's not an element of itself, which is a contradiction. So this is the essence of the Russell paradox. I don't call it the Russell paradox. Actually, when I teach it, I call it Russell's theorem. There's no universal set. And it's not really confusing anymore. At the time, it was very confusing, but now we've absorbed this nature of set theory into our fundamental understanding of how sets are, and it's not confusing anymore. I mean, the history is fascinating though about the Russell paradox, because before that time, Frege was working on his monumental work undertaking, implementing the philosophy of logicism,"
  },
  {
    "chunk_id": 46,
    "source_file": "file5.md",
    "part1": "which is the attempt to reduce all of mathematics to logic. So Frege wanted to give an account of all of mathematics in terms of logical notions, and he was writing this monumental work and had formulated his basic principles. And those principles happened to imply that for any property whatsoever, you could form the set of objects with that property. This is known as the general comprehension principle. And he was appealing to the principles that support that axiom, throughout his work. I mean, it wasn't just an incidental thing. He was really using this principle. And Russell wrote him a letter when he observed the work in progress, that there was this problem, because if you accept the principle that for any property whatsoever, you can make a set of objects with that property, then you could form the set of all sets that are not members of themselves. That's just an instance of the general comprehension principle. And the set of all sets that aren't elements of themselves can't be a set, because if it were, then it would be an element of itself if and only if it's not a member of itself, and that's a contradiction.",
    "part2": "And so Russell wrote this letter to Frege, and it was just at the moment when Frege was finishing his work. It was already at the publishers and, you know, in press basically. But it's completely devastating. I mean, it must have been such a horrible situation for Frege to be placed in because he's finished this monumental work, you know, years of his life dedicated to this, and Russell finds this basically one-line proof of a contradiction in the fundamental principles of the thesis that completely destroys the whole system. And Frege had put in the appendix of his work a response to Russell's letter in which he explained what happened, and he wrote very gracefully, \"Hardly anything more unwelcome can befall a scientific writer than to have one of the foundations of his edifice shaken after the work is finished. This is the position into which I was put by a letter from Mr. Bertrand Russell as the printing of this volume was nearing completion.\" And then he goes on to explain the matter, it concerns his basic law five, and so on, and... - It's heartbreaking. I mean, there's nothing more traumatic to a person who dreams of constructing mathematics all from logic. to get a very clean, simple contradiction. I mean, that's just... - You devote your life to this work, and then it's shown to be contradictory, and that must have been heartbreaking. - What do you think about the Frege project, the philosophy of logic, the dream of the power of logic- - Right - ... to construct a mathematical universe? - So, of course, the project of logicism did not die with Frege, and it was continued, and, you know, there's a whole movement, the neologicists and so on, in contemporary times even. But my view of the matter is that, really, we should view the main goals of logicism are basically completely fulfilled in the rise of set-theoretic foundation"
  },
  {
    "chunk_id": 47,
    "source_file": "file5.md",
    "part1": "alism. I mean, When you view ZFC as the foundation of mathematics, and in my view, the principles of ZFC are fundamentally illogical in character including the axiom of choice, as I mentioned, as a principle of logic. This is a highly disputed point of view, though, cause a lot of people take even the axiom of infinity as inherently mathematical and not logical and so on. But I think if you adopt the view that the principles of ZFC have to do with the principles of abstract, you know, set formation, which is fundamentally logical in character, then it's complete success for logicism. So the fact that set theory is able to serve as a foundation means that mathematics can be founded on logic.",
    "part2": "Gödel's incompleteness theorems - I think this is a good moment to talk about Gödel's incompleteness theorems. So, can you explain them and what do they teach us about the nature of mathematical truth? - Absolutely. It's one of the most profound developments in mathematical logic. I mean, the incompleteness theorems is when mathematical logic, in my view, first became sophisticated. It's a kind of birth of the subject of mathematical logic. But to understand the theorems, you really have to start a little bit earlier with Hilbert's program. because at that time, you know, with the Russell Paradox and so on, there were these various contradictions popping up in various parts of set theory and the Burali-Forti paradox and so on."
  },
  {
    "chunk_id": 48,
    "source_file": "file5.md",
    "part1": "o solve and he is saying, \"We're going to do it. We're going to solve all these problems.\" So we want to propose this strong theory and one has the sense that he had in mind set theory in which all the questions are going to be answered. Okay? But secondly, we want to combine that with, in a very weak arithmetic, purely finitistic theory, we want to prove that the reasoning process of the strong theory is safe. Okay? So in order to make sense of that point of view, you basically have to invent the philosophy of formalism, where we can look at what is a proof, what is the nature of mathematical reasoning. And on Hilbert's way of thinking about this, a proof is basically itself a finitistic kind of object. It's a sequence of... If you think about the nature of what a proof is, it's a sequence of assertions which can be viewed as sort of sequences of symbols that conform with certain rules of logical reasoning.",
    "part2": "And this is a formalist way of understanding the nature of proof. So we think about a proof in a kind of syntactic, formal way. Even though the contents of those statements might be referring to infinite uncountable objects, the statements themselves are not infinite uncountable objects. The statements themselves are just finite sequences of symbols. - So when you think of proof as, maybe it's fair to say, almost like a outside of math. It's like, tools operating on math. And then for Hilbert, he thought proof is inside the axiomatic system. Something like this. - Yeah, that's helpful. - That's wild. - The main thing about formalism is that you think of the process of doing mathematics. You divorce it from the meaning of the mathematical assertions, right? So the meaning of the mathematical assertions that you make in this infinitary theory has to do with these huge uncountable infinities and so on possibly. And that's a very sort of uncertain realm maybe and the source of the paradoxes and so on in some people's minds. But the reasoning process itself consists of writing down sequences of symbols on your page and, you know, undertaking or, an argument with them which is following these finitary rules. And so, if we divorce the meaning of the symbols from just the process of manipulating the symbols, it's a way of looking at the nature of mathematics as a kind of formal game in which- the meaning may be totally absent. I don't think it's necessarily part of the formalist view that there is no meaning behind, but rather it's emphasizing that we can divorce the meaning of the sentences from the process of manipulating those sentences. And then Hilbert wanted to prove in this purely finitary theory that if we follow the rules of that game, we're never going to get a contradiction. So those were the two aims of the Hilbert program, is to found the strong infinitary theory, probably set theory, which is going to answer all the questions. And then secondly, prove in the finitary theory that the strong theory is safe. In other words, consistent, yea"
  },
  {
    "chunk_id": 49,
    "source_file": "file5.md",
    "part1": "h? - What does the word \"finitary\" in finitary theory mean? - Yeah. Well, this is, of course, philosophically contentious, and people have different ideas about what exactly it should mean. So there's hundreds of papers on exactly that question. But I like to take it just kind of informally. I mean, it means that we're talking about finite sequences of symbols, and we're going to have a theory, you know, finite strings of symbols. A finitary theory would be one whose subject matter is about those kinds of things so that we can conceivably argue about the nature of these finite strings. A proof is just a finite sequence of statements, so that every statement is either one of the axioms or follows by the laws of logic from the earlier statements in some specified manner, like using modus ponens or some other law of logic like that. And such that the last line on the list is, you know, the theorem that you're proving. So that's what a proof is in this kind of way of thinking. To take a specific example, I mean, I always conceive of the, perhaps the most natural finitary theory that one would be called upon to exhibit would be Peano arithmetic, the theory of Peano arithmetic, which- which is a first order theory of the nature of arithmetic. But okay, so some people say, \"Well, Peano arithmetic has these strong first order induction axioms, and there's much, much weaker versions of arithmetic, like I-sigma-naught or I-sigma-1 and so on, which are even more finitary than Peano arithmetic.\" So different philosophical positions take different attitudes about what is, what does it take to be finitary? How finitary do you have to be to be truly finitary?",
    "part2": "- So according to Perplexity, Peano arithmetic is a foundational system for formalizing the properties and operations of natural numbers using a set of axioms called the Peano axioms. Peano arithmetic provides a formal language and axioms for arithmetic operations, such as addition and multiplication over the natural numbers. The axioms define the existence of a first natural number, usually zero or one, the concept of a successor function, which generates the next natural number, rules for addition and multiplication built from these concepts, the principle of induction allowing proofs around all natural numbers, and it goes on. So it's a very particular kind of arithmetic that is finitary. - You know, in my... I view it as finitary, but this is a contentious view. Not everyone agrees with that. That's what I was trying to hint at. - Okay. I got it. All right. - Peano arithmetic is one of the hugely successful theories of the natural numbers and elementary number theory. Essentially, all of classical number theory, so whatever kind of theorems you want to be proving about the prime numbers or factorization or any kind of finitary reasoning about finite combinatorial objects, all of it can be formalized in Peano arithmetic. I mean, that's the basic situation. Of course, one has to qualify those statements"
  },
  {
    "chunk_id": 50,
    "source_file": "file5.md",
    "part1": "in light of the Gödel incompleteness theorem, but for the most part, the classical number theoretic analysis of the finite numbers is almost entirely developable inside Peano arithmetic. So if we go back to the Hilbert program, so Hilbert has these two goals: produce the strong theory which is going to answer all the questions, and then prove by purely finitary means that that theory will never lead into contradiction. And one can think about, well, the incompleteness theorem should be viewed as a decisive refutation of the Hilbert program. It defeats both of those goals decisively, completely. But before explaining that, maybe one should think about, you know, what if Hilbert had been right? What would be the nature of mathematics in the world that Hilbert is telling us to search for? - And if I may, going to Perplexity's definition of Hilbert's program, it was David Hilbert's early 20th century project to give all of classical mathematics a completely secure finitary foundation. In essence, the goal was to formalize all of mathematics in precise axiomatic systems and then prove using only very elementary finitary reasoning about symbols that these systems are free of contradiction. - Right. Exactly right. Let's imagine what it would be like if he had been right. So we would have this finitary theory, and it would prove that the strong theory was free of contradiction. So we could start enumerating proofs from the strong theory. Right now, we can write a computer program that would systematically generate all possible proofs from a given theory. And so we could have, like, this theorem enumeration machine that would just spit out theorems all day long in such a manner that every single theorem would eventually be produced by this device. And so if you had a mathematical question of any kind, you could answer it by just waiting for either the answer to come out yes or from the machine or the answer to come out no. So the nature of mathematical investigation in Hilbert's world is one of just turning the crank of the theorem enumeration machine, devoid of creative thinking or imagination, it's just getting the answer from this by rote procedure.",
    "part2": "So Hilbert, in effect, is telling us, I mean, with his program, that the fundamental nature of mathematics is rote computation. I mean, the way I think about the Hilbert program seems extremely attractive in the historical context of being worried about the antinomies, the inconsistencies, and so how can we kind of block them? It seems natural, first of all, to have a strong theory that's going to answer all the questions, because the idea of logical independence and pervasiveness that we now know exists just wasn't, you know, there was no known. They didn't know anything like that happening ever. And so it's natural to think that it wouldn't happen, and also that they would be able to guard against this inconsistency. So it seems like the goals of the Hilbert program are quite natural in that historical c"
  },
  {
    "chunk_id": 51,
    "source_file": "file5.md",
    "part1": "ontext.\nBut, you know, when you think a little more about what the nature of it would be like, it shows you this kind of rote procedure. And now you're saying, well, that\ndoesn't seem so unlikely maybe, I mean, in the light of the increasing computer power and so on, it's actually maybe turning into\nour everyday experience, where the machines are calculating more and more for us in a way that could be alarming. Okay. But, okay, so to talk about the\nalternative to the Hilbert point of view, I mean, if he's wrong, then what is the nature of mathematical reality? Well, it would mean\nthat we couldn't ever maybe, for the first goal, we couldn't ever write down a theory that answered all the\nquestions. So we would always be in a situation where our best theory, even the infinitary theories,\nwould have questions that they stumble with and are unable to answer. Independence would occur. But then also, because of\nthe failure of the second goal, we would also have to be constantly worrying about whether our theories were consistent or not, and we wouldn't\nhave any truly convincing means of saying that they were free from contradiction. And\nthe fact of Gödel's Incompleteness Theorem shows that that is exactly the nature of\nmathematical reality, actually. Those are the two incompleteness theorems. So the first incompleteness theorem says you cannot write\ndown a computably axiomatizable theory that answers all the questions. Every such theory will be incomplete,\nassuming it includes a certain amount of arithmetic. And secondly, no such theory can ever prove its own consistency. So not only is\nit the case that the finitary theory can't prove the consistency of the strong infinitary theory, but even the infinitary theory can't prove\nits own consistency, right? That's the second incompleteness theorem.",
    "part2": "And so it's, in that sense, a decisive takedown of the Hilbert\nprogram, which is really quite remarkable, the extent to which his theorem just really answered that\nwhole puzzle. It's quite amazing. I mean, there's another aspect, kind of easy to think about.\nI mean, if you're wondering about theories that prove their own consistency, then, I mean, would you trust a theory\nthat proves of itself that it's consistent? I mean, that's like... it's like the used car salesman\ntelling you, \"Oh, I'm trustworthy.\" I mean, it's not a reason to trust the used car salesman, is it? Just because he says that.\nSo similarly, if you have a theory that proves its own consistency, well, even an inconsistent theory would prove its own consistency. And so it doesn't\nseem to be a logical reason to believe in the consistency, if you have a theory that proves itself consistent.\n- Just for clarification, you used the word theory. Is it, in this context, synonymous with axiomatic system?\n- Right. So in mathematical logic, \"theory\" is a technical term. And it means any set of sentences in a formal language. And so\nif you say axiomatic system, it's basically synonymous to my usage with theory"
  },
  {
    "chunk_id": 52,
    "source_file": "file5.md",
    "part1": "The dialogue explores the concept of 'theory' in mathematical logic, distinguishing between axioms and their consequences. The speaker explains that while you can computably enumerate consequences of axioms, you cannot always decide whether a given statement is a consequence. This relates to the distinction between computably decidable and computably enumerable problems. Even if you can decide whether something is an axiom, you may only be able to semi-decide whether it's a theorem—recognizing positive instances but not necessarily negative ones. This connects to the halting problem and shows how various logical concepts are interconnected.",
    "part2": "The conversation then turns to Gödel's incompleteness theorem and the fundamental distinction between truth and proof. The speaker notes that even early 20th century mathematicians before Gödel and Tarski were often sloppy about this distinction. The Bourbaki textbook, for instance, conflated truth and provability, treating them as equivalent. Gödel's work revealed that there are subtle aspects to truth that require mathematical investigation. The speaker emphasizes this distinction as absolutely core and fundamental to understanding the limitations of formal systems."
  },
  {
    "chunk_id": 53,
    "source_file": "file5.md",
    "part1": "erstanding of mathematical logic now. This distinction between truth and proof. So, truth is on the semantic side of the syntax-semantics dichotomy. Truth has to do with the nature of reality. I mean, okay, when I talk about reality, I'm not talking about physical reality. I'm talking about mathematical reality. So, we have a concept of something being true in a structure, a statement being true in a mathematical structure. Like maybe you have the real field or something, and you want to know, does it satisfy this statement or that statement? Or you have a group of some kind, or maybe you have a graph. This is a particular kind of mathematical structure that has a bunch of vertices and edges, and you want to know does this graph satisfy that statement? And Tarski gave this absolutely wonderful account of the nature of truth in what's now known as the disquotational theory of truth. And what Tarski says is the sentence, \"Snow is white,\" is true if and only if snow is white. And what he means by that is, look, to say truth is a property of an assertion, so we can think of the assertion as it syntactically. So, the sentence is true if and only if the content of the sentence is the case. You know? So, the sentence, \"Snow is white,\" you know, in quotations is true, that just means that snow is white. And that's why it's called the disquotational theory because we remove the quotation marks. from the assertion, right? And you can use this idea of disquotation to give a formal definition of truth in a mathematical structure of a statement in a formal language. So, for example, if I have a formal language that allows me to make atomic statements about the objects and relations of the structure, and I can build up a formal language with, you know, with the logical connectives of \"and\" and \"or\" and \"implies\" and \"not\" and so on, and maybe I have quantifiers, right? Then, for example, to say that the structure satisfies phi and psi, that that single statement, phi and psi, I'm thinking of that as one statement, just means that it satisfies phi and it satisfies psi. And if you notice what happened there, I... At first, the 'and' was part of the sentence inside the sentence, but then in the second part, I was using the word 'and' to refer to the conjunction of the two conditions.",
    "part2": "So- - Yeah, it has the disquotation. - Yeah, it has the disquotation. And so this idea can be done for all the logical connectors and quantifiers and everything. You're applying Tarski's idea of disquotation, and it allows you to define by induction the truth of any assertion in a formal language inside any mathematical structure. And so to say that a sentence is true, first of all, it's ambiguous unless you tell me which structure you're talking about it being true in. And so maybe we have in mind the standard model of arithmetic or something with the natural numbers and the arithmetic structure, and I want to know is a given statement true in that structure. Then we have a formal d"
  },
  {
    "chunk_id": 54,
    "source_file": "file5.md",
    "part1": "Definition of what that means according to the Tarski recursive definition of truth. Okay, that's truth. Proof, on the other hand, is, you know, in this Hilbert way of thinking, we can develop proof theory. What is a proof for a mathematician, for a mathematical logician? A proof is a certain sequence or arrangement of sentences in the formal language that accord with the logical rules of a proof system. So there are certain modes of reasoning that are allowed. So if you know A and you know A implies B in the proof, then at a later step you're allowed to write B as a consequence. So if you know A and you know A implies B, those are both two statements that are known, then you can deduce B as a consequence according to the rule of modus ponens. This is the rule of modus ponens. And, you know, there are a lot of other rules. Some people would call this implication elimination. There are different kinds of proof systems. There are a lot of different formal proof systems that exist that are studied by the proof theorists, and all of them have the property that they're sound, which means that if the premises of the argument are all true in a structure and you have a proof to get a conclusion, then the conclusion is also true in that structure. So that's what it means to be sound. Proofs preserve truth. They're truth-preserving arguments. Okay? But also the proof systems are also generally complete.",
    "part2": "They're both sound and complete, and complete means that whenever a statement is a consequence, a logical consequence of some other statements, which means that whenever the assumptions are true, then then the consequence is also true in the structure. So whenever you have a logical consequence, then there is a proof of it. Okay? And the proof systems generally have both of those properties; they're sound and complete. There's a third property a lot of logicians talk about sound and complete, sound and complete this, sound and complete that. But actually, there's a hidden third adjective that they should always be talking about in any such case, which is that you should be able to recognize whether or whether or not something is a proof or not. So there's a computable aspect to the proof systems. We want to be able to recognize whether something is a proof. It should be computably decidable whether a given sequence of statements is a proof or not. So we don't want a proof system in which someone claims to have a proof, but we can't check that fact, whether it's a proof or not. We want to be able to correctly adjudicate all claims to having a proof. - Yeah. A mathematician comes to mind that said he has a proof, but the margins are too small - That's right. - to continue. - Exactly. So - So that doesn't count as a proof. - Yeah. So generally, all the classical proof systems that are used are sound and complete and also computably decidable in the sense that we can decide whether something is a proof or not."
  },
  {
    "chunk_id": 55,
    "source_file": "file5.md",
    "part1": "proof? Which is more powerful, and how do the two interplay with the contradictions that we've been discussing? - Right. So the incompleteness theorem is the question whether we could, say, write down a theory for arithmetic. Say, for the standard model of arithmetic where we have the natural numbers and plus and times and zero, one, and less than, and so on. In that formal language, we can express an enormous number of statements about the nature not only of arithmetic, but actually by various coding methods, we can express essentially all of finite mathematics in that structure. So the question would be, can we write down a computable list of axioms that will answer all those questions by proof? In other words, we want to have a complete theory, a theory of arithmetic that proves all and only the true statements. That would be the goal. Hilbert would love that. I mean, that would be supportive of Hilbert's program to have such a complete theory of arithmetic, and Godel proved that this is impossible. You cannot write down a computable list of axioms that is complete in that sense. There will always be statements... If the theory is consistent, there will always be statements that you cannot prove and you cannot refute. So they are independent of that theory.",
    "part2": "- How traumatic is that, that there are statements that are independent from the theory? - I mean, my view is that this isn't traumatic at all. This is rather completely eye-opening in terms of our understanding of the nature of mathematical reality. I mean, we're not... We understand this profound fact about our situation with regard to mathematical truth. The incompleteness theorem tells us, look, we just can't write down a list of axioms that is going to be consistent and it's going to answer all the questions. It's impossible. And so I don't think of it as trauma. I just think, look, this is the nature of mathematical reality and it's good that we know it, and so now we need to move on from that. And, you know, do what we can in light of that. - Is it fair to say that in general it means if I give you a statement, you can't know if your axiomatic system would be able to prove it? - That's right. In general, you cannot. The provability problem, we can formulate it as a decision problem. Given a theory and given a statement, is that statement a consequence of that theory? Yeah. This is one of the most famous decision problems. In fact, the very first one, because it's equivalent to the Hilbert-Ackermann Entscheidungsproblem, which is also appearing in the title of Turing's 1936 paper that was so important for computability theory. So, it's a formulation of the Entscheidungsproblem. Does a given theory have a given statement as a logical consequence? Which, because of Gödel's completeness theorem, not his incompleteness theorem, but his earlier completeness theorem, Gödel had proved that the proof systems that they studied did have this completeness property that I mentioned. So provabilit"
  },
  {
    "chunk_id": 56,
    "source_file": "file5.md",
    "part1": "y is the same as logical consequence. And this is an undecidable decision problem. Turing proved and we now know it's equivalent to the Halting Problem. - Can you describe the Halting Problem? Because it's a thing that shows up in a very useful and, again, traumatic way through a lot of computer science, through a lot of mathematics. - Yeah. The Halting Problem is expressing a fundamental property of computational processes. So, given a program, or maybe we think of it as a program together with its input, but let me just call it a program. So given a program, we could run that program, but I want to pose it as a decision problem. Will this program ever complete its task? Will it ever halt? And the Halting Problem is the question, given a program, will it halt? Yes or no? And, of course, for any one instance, the answer's either yes or no. That's not what we're talking about. We're talking about whether there's a computable procedure to answer all instances of this question. So, it's a decision problem is given as a scheme of instances for all possible programs that you could ask about. What I want to know is, is there a computable procedure that will answer those questions? And it turns out the answer's no. The Halting Problem is computably undecidable.",
    "part2": "There is no computable procedure that will correctly answer all instances of whether a given program will halt. And of course, we can get half the answers in the sense that you give me a program and you say, \"Will this halt?\" And I could take that program and I could run it. And I could keep running it, and maybe in a week, it would halt. And at that time, I could say, \"Yes, it halted.\" So I can get the yes answers correctly for halting, all the yes answers. But the problem is if it didn't halt yet, like maybe I waited, you know, a thousand years and it still hasn't halted, I don't seem entitled to say, \"No, it's not going to halt.\" Yet, because maybe in a thousand and one years, it'll halt. And so at no point can I seem to say, \"No.\" In order to say, \"No, it won't ever halt,\" it seems like I would have to really understand how the program worked and what it was doing. So giving the \"yes\" answers was sort of trivial. You didn't have to understand it. You just needed to run it, which is a kind of rote task. But to give the \"no\" answers, you need to have a kind of deep insight into the nature of the program and what it's doing in such a way that you would understand it and be able to see, \"Oh, no, I can see this program is never gonna halt.\" Because, you know, it's a much more difficult task to say, \"No, it won't halt,\" than it is to say, \"Yes, it halted because I ran it and it halted.\" And it turns out to be impossible to have a computable procedure that gives the \"no\" answers, you know? And the argument is not very difficult. Should we do it? - Yes, let's do it. - Okay. Suppose toward contradiction. I mean, all these proofs are by contradiction, and this argument is going to b"
  },
  {
    "chunk_id": 57,
    "source_file": "file5.md",
    "part1": "e a diagonal argument in the same style as the Russell argument and the Cantor argument and Gödel's argument that we haven't talked about yet. So many diagonal arguments come in. So suppose towards contradiction that we had a procedure for determining whether a given program halted on a given input. Now, let me describe. I'm gonna use that procedure as a subroutine in the following process. And my process, let's call it Q, process Q, and it takes as input a program P, okay? And the first thing it does is it asks that subroutine, \"Hey, would P halt if I ran it on P itself?\" Okay, that's the diagonal part because we're applying P to P, right? Okay, so I'm describing program Q, and program Q takes as input P, which is itself a program. And the first thing it does is it asks the halting subroutine program, \"Would P halt on P?\" And if the answer comes back from the subroutine, \"Yeah, that would halt,\" then what I do in program Q is I immediately jump into an infinite loop. So I don't halt. If P halts on P, I don't halt. But if the answer came back, \"No, P is never gonna halt on P,\" then I halt immediately. Okay, so and that's it. I've described what Q does.",
    "part2": "And the thing about Q is that Q's behavior on P was the opposite of P's behavior on P. I mean, that's how we designed Q specifically so that Q on P had the opposite behavior as P on P. Okay, so now, of course, what do we do? Well, the same thing that Russell did and so forth, and Cantor, we ask, \"Well, what would Q do on Q?\" And because of this opposite behavior, Q would halt on Q if and only if Q does not halt on Q, which is a contradiction, because Q has to have the opposite behavior on Q than Q does, but that's just contradictory. - What a beautiful proof. Simple. - It's absolutely beautiful. Yeah, I agree. And it's following the same logic of Russell and Cantor. I mean, going back to Cantor basically, because Russell is also quoting Cantor in his letter to Frege. So, therefore, the conclusion is that the halting problem is not computably decidable. And now we can immediately prove Gödel's theorem using this, actually. It's an immediate consequence. So why don't we just do that? I view this as the simplest proof of Gödel's theorem. You don't need the Gödel sentence to prove Gödel's theorem. You can do it with the halting problem. So, suppose that we could write down a computable axiomatization of all of the true facts of elementary mathematics, meaning arithmetic and finite combinatorial things such as Turing machine computations and so on. So in fact, all those finite combinatorial processes are formalizable inside arithmetic with the standard arithmetization coding process"
  },
  {
    "chunk_id": 58,
    "source_file": "file5.md",
    "part1": "s. But let me just be a little bit informal and say suppose we could write down a complete theory of elementary finite mathematics. So we have an axiomatization of that theory. Then we could produce all possible theorems from those axioms in the way that I was describing earlier with Hilbert's program. I mean, if we had a complete theory of elementary mathematics, we could construct a theorem enumeration machine that produced all the theorems and only the theorems from that theory. So now I have this theorem enumeration device on my desk, and I announce that I'm open for business to solve the halting problem. So you give me a program and input that you want to run that program on, and I'm going to answer the halting problem. And the way I'm going to do it is I'm just gonna wait for the statement coming out of the theorem enumeration device that asserts either that P does halt on that input or I wait for the statement that P does not halt on that input. But one of them's going to happen because it was a complete theory that was enumerating all the true statements of elementary mathematics. So therefore, if I had such a system, I could solve the halting problem, but we already proved that you cannot solve the halting problem, so therefore you cannot have such a complete theory of arithmetic. So that proves Gödel's theorem.",
    "part2": "- Maybe to take a little bit of a tangent, can you speak... You've written a wonderful book about proofs and the art of mathematics. So what can you say about proving stuff in mathematics? What is the process of proof? What are the tools? What is the art? What is the science of proving things in mathematics? - So this is something that I find so wonderful to teach young mathematicians who are learning how to become mathematicians and learning about proof, and I wrote that book when I was teaching such a proofwriting class in New York. So many universities have such a course, the proofreading course, which is usually taken by students who have learned some mathematics. Usually, they've completed maybe the calculus sequence and are making the kind of transition to higher mathematics,"
  },
  {
    "chunk_id": 59,
    "source_file": "file5.md",
    "part1": "which tends to involve much more proof, and it's a kind of challenging step for them. Many math departments have this kind of course on proofwriting where the students would get exposed to how to write proofs. I wasn't happy with most of the other books that exist for those kind of courses, and the reason was that they were so often so dull because they would concentrate on, like, these- totally uninteresting parts of what it's like to write a proof, these kind of mechanistic procedures about how to write a proof. You know, if you're going to prove an implication, then you assume the hypothesis and argue for the conclusion, and so on. And all of that is true and fine and that's good to know, except if that's all that you're saying about the nature of proof, then I don't think you're really learning very much. So I felt that it was possible to have a much better kind of book, one that was much more interesting and that had interesting theorems in it that still admitted of elementary proof. So I wrote this book and tried to fill it with all of the compelling mathematical statements with very elementary proofs that exhibited lots of different proof styles in it. And so, I found that the students appreciated it a lot.",
    "part2": "Are there some interesting proofs that maybe illustrate, for people outside of mathematics or for people who just take math classes- - Right - ...in high school and so on? - Yeah, let's do a proof. There's one in the book. We can talk about it. I think it's a nice problem. It's in the discrete math, yeah, the 5.1, that one, more pointed at than pointing. Okay. So this is the following problem. Suppose you're gathered with some friends, you know, in a circle, and you can point at each other however you want, or yourself, whatever, it doesn't matter, and you can point at more than one person, you know, use all your fingers or your feet or whatever you want. So maybe you point at three of your friends or something and they point at two or three of their friends or whatever, and one person is pointing at 10 people and somebody isn't pointing at anybody maybe, or and various people are pointed at also, right? So the question is, could we arrange a pattern of pointing so that everyone was more pointed at than they are pointing at others? So in other words, maybe there's seven people pointing at me, but I'm only pointing at five people and maybe there's, you know, 20 people pointing at you, but you're only pointing at 15 people or something like that, right? So I want to know. There's a similar question on Twitter. For a group of people on Twitter, could you arrange that everyone has more followers than following? Yeah, it's the same question. Mathematically, it's identical. Although, I don't know, it's not identical, because I sa"
  },
  {
    "chunk_id": 60,
    "source_file": "file5.md",
    "part1": "id you could point at yourself, and I think that's not... Can you follow yourself? - No, I don't think so, no. - I don't think you can. Okay. So can you arrange it so that everyone is more pointed at than pointing? And in my book, I give a couple of different proofs of this. I think I give an induction proof and then there's another proof. I think there's three different proofs in there. But why don't we just talk about my favorite proof? Suppose it were possible to arrange that we're all more pointed at than pointing, okay? Now what we're going to do, we're going to agree, we're going to give a dollar to everyone that we're pointing at. Okay? And so what happens? Everybody made money, because I was pointed at by more people than I'm pointing, so I got $10, but I only paid out $7. And similarly, you got paid $20, but you only paid out $15. So, if everyone is more pointed at than pointing, then everyone makes money. But it's obviously impossible for us to make money as a group by just trading money with ourselves. And therefore, it can't be possible that we're all more pointed at than pointing.",
    "part2": "And this proof illustrates something. It's one of my habits that I suggest in the book: to anthropomorphize your mathematical ideas. You should imagine that the mathematical objects that are playing a role in your question are people, or active, somehow, animals, or something that maybe have a will and a goal and so on. This is this process of anthropomorphizing. And it often makes the problems easier to understand because we all are familiar with the fact that it's difficult to make money, and the proof is totally convincing because of our knowledge that we can't make money as a group by trading dollars between us, you know, without any new money coming into the group. But that by itself is actually a difficult mathematical claim. I mean, if someone had to prove that you can't make money by trading within a group, you know, it can't be that everyone in the group makes money just by shifting money around in the group. Maybe you think that's obvious, and it is obvious if you think about money. But if you had asked the question, you know, about mathematical functions of a certain kind and so on, then maybe it wouldn't be as clear as it is when you're talking about this money thing, because of we can build on our human experience about the difficulty of getting money and, you know, or other resources. It doesn't have to be money, it could be candy, whatever. You know, we just know that you can't easily get more things in that kind just by trading within a group."
  },
  {
    "chunk_id": 61,
    "source_file": "file5.md",
    "part1": "well, what if there were infinitely many people in your, in your group? Then it's not true anymore. The theorem fails. In fact, you can arrange that everyone is strictly more pointed than pointing. And also, you can if everyone has even just one dollar bill— ...then you can arrange that afterwards everyone has infinitely many dollar bills. Cause in terms of cardinality, that's the same. It's just, say, countable infinity in each case. If you had countably many friends and everyone has one dollar bill, then you can arrange a pattern of passing those dollar bills amongst each other so that afterwards everyone has infinitely many dollar bills. What you need is for each person to be attached to, you know, one of the train cars or something. So, think of everyone as coming from Hilbert's train, but also think of them as fitting into Hilbert's Hotel. So just have everyone on the Nth car give all their money to the person who ends up in the Nth room. So they each give one dollar to that person. So afterwards, that person has infinitely many dollars, but everyone only paid out one dollar. So it's a way of making it happen.",
    "part2": "Does infinity exist? - To what degree, sticking on the topic of infinity, should we think of infinity as something real? - That's an excellent question. I mean, a huge part of the philosophy of mathematics is about this kind of question: what is the nature of the existence of mathematical objects, including infinity? But I think asking about infinity specifically is not that different than asking about the number five. What is— ...what does it mean for the number five to exist? What are the numbers really, right? This is maybe one of the fundamental questions of mathematical ontology. I mean, there's many different positions to take on the question of the nature of the existence of mathematical objects or abstract objects in general. And there's a certain kind of conversation that sometimes happens when you do that, and it goes something like this. Sometimes people find it problematic to talk about the existence of abstract objects such as numbers, and there seems to be a kind of wish that we could give an account of the existence of numbers or other mathematical objects or abstract objects that was more like, you know, the existence of tables and chairs and rocks and so on. And so there seems to be this desire to reduce mathematical existence to something, you know, that we can experience physically in the real world. But my attitude about this attempt is that it's very backward, I think, because I don't think we have such a clear understanding of the nature of physical objects, actually. I mean, we all have experience about existing in the physical world, as we must, because we do exist in the physical world, but I don't know of any satisfactory account of what it means to exist physically. I mean, if I ask you, say, \"Imagine a certain kind of steam locomotive,\" you know, and I describe the engineering of it and the weight of it"
  },
  {
    "chunk_id": 62,
    "source_file": "file5.md",
    "part1": "The nature of the gear linkages and you know, and I show you schematic drawings of the whole design and so on and, you know, we talk in detail about every single detailed aspect of this steam locomotive. But then suppose after all that conversation, I say, \"Okay, now I would like you to tell me what would it mean for it to exist physically, I mean, as opposed to just being an imaginary steam locomotive?\" Then what, what could you possibly say about it? I mean, except by saying, \"Oh, I just mean that it exists in the physical world.\" But what does that mean? That's the question, right? It's not an answer to the question. That is the question. So I don't think that there's anything sensible that we can say about the nature of physical existence. It is a profound mystery. In fact, it becomes more and more mysterious the more physics we know. I mean, back in, say, Newtonian physics, one had a picture of the nature of physical objects as, you know, little billiard balls or something, or maybe they're infinitely divisible or something like that. Okay, but then this picture is upset with the atomic theory of matter. But then that picture's upset when we realize that the atoms actually can be split and consist of electrons and protons and neutrons and so on. But then that picture's upset when we realize that those things themselves are built out of quarks and leptons and so on, and who knows what's coming. Furthermore, all of those things, the nature of their existence is actually as wave functions in you know, some cloud of probability and so on. So it just becomes more and more and more mysterious the more we learn, and not at all clarifying. So the nature of what it means to say that, you know, there's an apple on my desk, and to give an account of what that physical existence really is at bottom, I think, is totally absent.",
    "part2": "Whereas we do seem to have a much more satisfactory account of the nature of abstract existence. I mean, I can talk about the nature of the empty set. You know, this is the predicate which is never true or something like that. I can talk about those kind of logical properties or the singleton of the empty set and so on. I mean, of course, it's very difficult if you go very far with it, but the point is that it doesn't get more and more mysterious. The more that you say, it becomes only more and more clear. So it seems to me that, we don't really have any understanding of what the physical world is as opposed to the abstract world, and it's the abstract world where existence is much more clear. - It is very true that we don't know anything about the soda bottle or the steam locomotive just because we can poke at it. Again, we anthropomorphize, and that actually gets us into trouble sometimes because I'm not feeling the quantum mechanics when I'm touching it. - That's right. - And therefore, it's easy to forget and feel like this is real and mathematical objects are not, but you're making the opposite argument. When you draw a disti"
  },
  {
    "chunk_id": 63,
    "source_file": "file5.md",
    "part1": "- I happen to think so. I mean, I'm on the side of realism in mathematics, and I think that these abstract objects do have a real existence in a way that we can give an account of, in a way I just tried to describe.\n- So, you would describe it as the size of a set with four elements in it? - Well, there are different ways to understand the nature of four. I mean, actually, this gets into the question of structuralism, which is maybe a good place to talk about it.\n- What is structuralism?",
    "part2": "- Structuralism is a philosophical position in mathematics, or the philosophy of mathematics, by which one emphasizes that what's important about mathematical objects is not what they're made out of or what their substance or essence is, but rather how they function in a mathematical structure. And so, what I call the structuralist attitude in mathematics is that we should only care about our mathematical structures up to isomorphism. If I have a mathematical structure of a certain kind, and I make an exact copy of it using different individuals to form the elements of that structure, then the isomorphic copy is just as good mathematically, and there's no important mathematical difference that would ever arise from working with this isomorphic copy instead of the original structure. And so, therefore, that's another way of saying that the substance of individuals, you know, in a mathematical structure is irrelevant with regard to any mathematical property of that structure."
  },
  {
    "chunk_id": 64,
    "source_file": "file5.md",
    "part1": "iduals in isolation. What's interesting and important about mathematical objects is how they interact with each other and how they behave in a system, and so maybe one wants to think about the structural role that the objects play, you know, in a larger system, a larger structure. There's a famous question that Frege had asked actually when he was looking into the nature of numbers, because in his logicist program, right, he was trying to reduce all of mathematics to logic. And in that process, he was referring to the Cantor-Hume principle that, you know, whenever two sets are equinumerous, then they have the same number of elements, I mean, if and only if. And he founded his theory of number on this principle, but he recognized that there was something that dissatisfied him about that situation, which is that the Cantor-Hume principle does not seem to give you criteria for which things are numbers. It only tells you a kind of identity criteria for when two numbers are equal to each other. Well, two numbers are equal just in case the sets of those sizes are equinumerous, so that's the criteria for number identity. But it is not a criteria for what is a number. And so this problem has become known as the Julius Caesar problem because Frege said we don't seem to have any way of telling from the Hume principle whether Julius Caesar is a number or not. So he's asking about the essence of number and whether...",
    "part2": "Of course, one has a sense that he picked maybe what he was trying to present as a ridiculous example, because maybe you have the idea that well, obviously Julius Caesar is not a number, and there's a lot of philosophical writing that seems to take that line also, that obviously the answer is that Julius Caesar is not a number. But the structuralists disagree with that position. The structuralist attitude is, \"Look, you give me a number system. If Julius Caesar isn't a number, then I can just... let's take the number 17 out of that system and plug in Julius Caesar for that role, and now I've got a new number system, and now Julius Caesar happens to be the number 17.\" And that's totally fine, you know. So the point of structuralism is is that the question of whether Julius Caesar is a number or not is irrelevant to mathematics. It is irrelevant because it is not about structure, it's about this essence of the mathematical objects. So that's the structuralist criticism of Frege's point."
  },
  {
    "chunk_id": 65,
    "source_file": "file5.md",
    "part1": "Oh yeah, totally, yeah. This is the realist position in mathematics is that abstract objects have a real existence. And okay, what's meant by that is that there's some sense of existence in which those objects can be regarded as real. - How should we think about that? How should we try to visualize that? What does it mean to live amongst abstract objects? - Right. - Because life is finite. We're all afraid of death. We fall in love with other physical manifestations of objects. And you're telling me that maybe reality actually exists elsewhere, and this is all just a projection- - Well, I mean- - ... from the abstract realm. - Do abstract objects exist in a place and at a time? That's very debatable, I think. - Right. And what does place and time mean? - Uh, all time, yeah, so... - So what's more real, physics or the mathematical Platonic space? - Well, the mathematical Platonic realm is... I'm not sure I would say it's more real, but I'm saying we understand the reality of it in a much deeper and more- ...a more convincing way. I don't think we understand the nature of physical reality very well at all. And I think most people aren't even scratching the surface of the question as I intend to be asking it.",
    "part2": "So, you know, obviously we understand physical reality. I mean, I knock on the table...and so on, and we know all about what it's like to, you know, have a birthday party or to drink a martini or whatever. And so we, we, we have a deep understanding of existing in the physical world. But maybe understanding is the wrong word. We have an experience of living in the world- - Yeah, experience. - ...and riding bicycles and all those things, but I don't think we actually have an understanding at all. I mean, very, very little of the nature of physical existence. I think it's a profound mystery. Whereas I think that we do have something a little better of an understanding of the nature of mathematical existence and abstract existence. So that's how I would describe the point. - Somehow it feels like we're approaching some deep truth from different directions, and we just haven't traveled as far in the physics world as we have in the mathematical world. - Maybe I could hope that someone will give, you know, the convincing account, but it seems to be a profound mystery to me. I can't even imagine what it would be like to give an account of physical existence. - Yeah, I wonder, like a thousand years from now as physics progresses... - Right - ...what this same conversation would look like. - Right. That would be quite interesting. - Do you think there's breakthroughs a thousand years from now on the mathematics side?"
  },
  {
    "chunk_id": 66,
    "source_file": "file5.md",
    "part1": "tural differences, but one of the big cultural differences is towards the idea of progress in the subject. Because mathematics has huge progress. We simply understand the mathematical ideas much, much better, you're continually improving our understanding and there's growth in knowledge. We understand the nature of infinity now better than they did 100 years ago. I mean, definitely better. And they understood it better 100 years ago than they did, you know, for the previous thousands of years and so on. So, in almost every part of mathematics, there's improved understanding of the core issues so much so that, you know, the questions at hand become totally different and the field sort of moves on to more difficult, interesting questions. Whereas in philosophy, there's... That's a little bit true that there's progress. But meanwhile, it's also true that there are these eternal questions that have been with us for thousands of years and in fact, so much so that you can find a lot of philosophers arguing the important contribution of philosophy is in asking the questions rather than answering them because it's hopeless to answer them. I mean, the nature of these deep philosophical questions is so difficult. Less of a sense of progress is what I'm trying to say. I don't see any reason to think that the progress in mathematics, in the growth in our mathematical understanding and knowledge won't simply continue. And so, a thousand years from now, maybe the mathematics that they will be doing at that time would probably be completely unrecognizable to me. I maybe wouldn't even begin to understand what they're talking about, even without sort of witnessing, you know, the intervening developments. So if you bring someone from ancient times to today, they maybe wouldn't even understand what we're talking about with some of the questions. But I feel that, you know, if Archimedes came and we were able to communicate, I think I would be able to tell him, you know, about some of the things that are going on in mathematics now and, and maybe, you know... Or, or anyone from that time, I mean. So I think it is possible to have this kind of progress even when the subject kind of shifts away from the earlier concerns as a result of the progress, basically.",
    "part2": "MathOverflow\n- To take a tangent on a tangent since you mentioned philosophy, maybe potentially more about the questions and maybe mathematics is about the answers, I have to say you are a legend on MathOverflow, which is like Stack Overflow but for math. You're ranked number one all time on there with currently over 246,000 reputation points. How do you approach answering difficult questions on there? - Well, MathOverflow has really been one of the great pleasures of my, of my life. I've really enjoyed it. I mean... And I've learned so much from interacting on MathOverflow. I've been on there since 2009, which was shortly after it started. I mean, it wasn't exactly at the start, but a little bit later. And and I"
  },
  {
    "chunk_id": 67,
    "source_file": "file5.md",
    "part1": "think it gives you the stats for how many characters I typed and I don't know how many million it is, but uh, this enormous amount of um, time that I've spent thinking about those questions and it has really just been amazing to me. Uh- - How do you find the questions that grab you and how do you go about- - Right - ... answering them? - So, I'm interested in any question that I find interesting. So... And it's not all questions. Sometimes certain kinds of questions just don't appeal to me that much. - So you go outside of set theory as well? - So, I think when I first joined MathOverflow, I was, I was basically one of the only, one of the few people in logic who was answering. I mean, there were other people who know some logic, particularly from category theory and other parts of mathematics that aren't in the most traditional parts of logic, but they were answering some of the logic questions. So I really found myself able to make a contribution in those very early days by engaging with the logic-related questions. But there weren't many logic people asking questions either. But what I found was that there was an enormous amount of interest in topics that were logic-adjacent.",
    "part2": "So a question would arise, you know, in group theory, but it had a logic aspect or an analysis or whatever, and there would be some logic angle on it. And what I found was that I was often able to figure out an answer by learning enough about that other subject matter. This is what was so rewarding for me, because basically I had to learn enough. had to learn enough. My expertise, my main expertise was logic, but someone would ask a question, you know, that, that was about, say, the axiom of choice in this other subject matter or the continuum hypothesis or something like that in an, in the other subject matter. And I would have to learn enough about that other subject and the context of the question in order to answer and I was often able to do that. And so I was quite happy to do that. And, and also I learned a lot by doing that because I had to learn about these other problem areas. And so it really allowed me to grow enormously as a mathematician. - To give some examples of questions you've answered, what are some reasonable sounding statements that are independent of ZFC? What are the most misleading alternate definitions in taught mathematics? Is the analysis as taught in universities in fact the analysis of definable numbers? Solutions to the continuum hypothesis? Most unintuitive application of the axiom of choice? Non-trivial theorems with trivial proofs? Reductio ad absurdum or the contrapositive? What is a chess piece mathematically? We should say you worked quite a bit on infinite chess, which we should definitely talk about. It's awesome. You've worked on so many fascinating things. Has philosophy ever clarified mathematics?... why do we have two theorems when one implies the other? And, of course, just as an example you've given a really, a The Continuum Hyp"
  },
  {
    "chunk_id": 68,
    "source_file": "file5.md",
    "part1": "thesis great, almost historical answer on the topic of the continuum hypothesis. Maybe that's a good place to go. We've touched on it a little bit, but it would be nice to lay out what is the continuum hypothesis that Cantor struggled with. And I would love to also speak to the psychology of his- his own life story, his own struggle with it. It's the human side of mathematics is also fascinating. So what is the continuum hypothesis? - So the continuum hypothesis is the question that arises so naturally whenever you prove that there's more than one size of infinity. So Cantor proved that the infinity of the real numbers is strictly larger than the infinity of the natural numbers. But immediately when you prove that, one wants to know, well, is there anything in between? I mean, what could be a more natural question to ask immediately after that? And so Cantor did ask it, and he spent his whole life thinking about this question. And so the continuum hypothesis is the assertion that there is no infinity in between the natural numbers and the real numbers. And, of course, Cantor knew many sets of real numbers. Everything in between... I mean, everything that's in that interval would be equinumerous with some set of real numbers. But we know lots of sets of real numbers. I mean, there's all these various closed sets, Cantor sets, and so on. There's Vitali sets. We have all kinds of sets of real numbers. And so you might think, well, if the continuum hypothesis is false, then we've probably seen the- the set already. We just have to prove, you know, that it's strictly in between.",
    "part2": "But it turned out that for all the sets that anyone ever could define or pick out or observe, for all the sets of real numbers, it was always the case either that they were countable, in which case they're equinumerous with the natural numbers or else finite. Or they were fully equinumerous with the whole real line. And so they were never strictly in between. I mean, you're in this situation and you have 100, thousands of sets that are candidates to be in between, but in every single case, you can prove it's on one side or the other and not strictly in between. And so in every situation where you're able to figure out whether it's in between or not, it's always never strictly in between. - Now, Cantor was obsessed with this. - I think he was. Yeah, I'm not a historian, so I don't know the exact history. - Well, everything I've seen, it seems to be the question that broke him, huh? Um, I mean, just struggling with different opinions on the hypothesis within himself and... ...Desperately chasing, trying to prove it. - So he had a program for proving it, which has been affirmed in a certain respect. Of course, the continuum hypothesis holds for open sets. That's easy to see. If you have an open interval, then this is fully equinumerous with the whole real line. Any interval is equinumerous with the whole line because all you would need is a function, you know, like the arctangen"
  },
  {
    "chunk_id": 69,
    "source_file": "file5.md",
    "part1": "t function or something that maps the whole real line into an interval. And that's a one-to-one function. So we know the open sets have the property that their non-trivial open sets are all fully equinumerous with the whole real line. So, never strictly in between. But remarkably, Cantor proved it also for the closed sets, and that is using what's called the Cantor-Bendixson theorem. So, it's quite a remarkable result. It's definitely not obvious. And in this theorem actually was the origin of the ordinals. Cantor had to invent the ordinals in order to make sense of his Cantor-Bendixson process. - Can you define the open and the closed set in this context? - Oh, yeah. Sure. So a set of reals is open if every point that it contains is surrounded by a little interval of points, the whole tiny little interval. But that tiny little interval is already just by itself equinumerous with the whole line. So that's why that question is sort of easy for open sets. A closed set is a complement of an open set, and there's a lot of closed sets that are really complicated of varying sizes.",
    "part2": "So of course, any closed interval is a closed set, but it's not only those. There's also things like the Cantor set, which you get by omitting middle thirds. Maybe some people have seen this construction. Or you can imagine sort of randomly taking a lot of little tiny open intervals, you know, all over the line and so on. So that altogether would be an open set, and the complement of it would be a closed set. So you can imagine just kind of tossing down these open intervals, and what's left over is the closed set. Those sets can be quite complicated, and they can have isolated points, for example, if the two open intervals were just kissing and leaving only the one point between them. But also you could have sequences that are converging to a point, that would also be a closed set, or convergent sequences of convergent sequences and so on. That would be a closed set also. - The Cantor set is constructed by iteratively removing open intervals, middle thirds, like you mentioned, from the interval, and trying to see, can we do a thing that that goes in between? - Right. So the question would be, can you produce a set that has an intermediate size? an intermediate cardinality, right? And Cantor proved, with the closed set, \"No, it's impossible.\" Every closed set is either countable or equinumerous with the whole real line. And the Cantor program for solving the Continuum Hypothesis was, a sort of working up. So you did it for open sets and for closed sets, and you sort of work up. Maybe he wants to go into what are called the Borel sets, which are sort of combinations of open and closed sets. And there's a vast hierarchy of Borel complexity. And it turns out that the Continuum Hypothesis has been proved also for the Borel sets in this hierarchy. But then one wants to go beyond. What about more complicated sets? So there's this hierarchy of complexity for sets of real numbers."
  },
  {
    "chunk_id": 70,
    "source_file": "file5.md",
    "part1": "Cantor's idea was to sort of work your way up the hierarchy by proving that the Continuum Hypothesis was more and more true for those more and more complicated sets, based on our understanding of the earlier cases. And that has been carried out to a remarkable degree. It turns out that one begins to need large cardinal assumptions, though, in order to get to the higher realms, even at the level of projective hierarchy, which are sets that you can define by using quantifiers over the real numbers themselves. So you get this hierarchy on top of the Borel hierarchy, the hierarchy of projectively definable sets. And it turns out that if you have enough large cardinals, then the projective sets also are always either countable or equinumerous with the whole real line. And then one can try to go beyond this and so on. So I view all of those results which came, you know, in the past 50 years, the later ones, as fulfilling this Cantor idea that goes back, you know, 120 years to his idea that we would prove the Continuum Hypothesis by establishing more and more instances for greater and greater complexity of sets. But of course, even with what we know now, it hasn't fully succeeded and it can't because the hierarchy of complexity doesn't include all sets of real numbers. Some of them are, sort of, transcending this hierarchy completely, in a way. And so the program can't ever fully be successful, especially in light of the independence result.",
    "part2": "Yeah. Well, spoiler alert, can you go to the independence result? - Sure. - So what does that mean? So the Continuum Hypothesis was shown to be independent from the ZFC axioms of mathematics? - Right. So the ZFC axioms were the axioms that were put forth first by Zermelo in 1908 in regard to his proof of the well-order theorem using the axiom of choice. That wasn't fully ZFC. At that time, it was just Zermelo theory because he sort of... There was a kind of missing axiom, the replacement axiom, and the foundation axiom were added later, and that's what makes the Zermelo-Fraenkel axiomatization, which became, sort of, standard. Actually, there's another aspect, which is Zermelo's original theory allowed for the existence of ur-elements, or these atoms, mathematical objects that are not sets but out of which we build the set theoretic universe, whereas set theorists today generally don't use ur-elements at all. I, I argue that it's really the philosophy of structuralism that leads them to omit the ur-elements because it turns out that if you adopt ZFC axioms with ur-elements, ZFCU it's called, or ZFA, then any structure that exists, any mathematical structure that exists in that set theoretic universe with the atoms is isomorphic to a structure that doesn't use the atoms at all. And you don't need the atoms if you're a structuralist because you only care about the structures up to isomorphism anyways, and the theory is simply more elegant and clear without the atoms. They're just not needed. And so that's why today"
  },
  {
    "chunk_id": 71,
    "source_file": "file5.md",
    "part1": "when we talk about set theory, generally we talk about the atom-free version, and ZFC has no ur-elements. Okay. So we formulate the ZFC axioms of set theory. These are expressing the main principle ideas that we have about the nature of sets and set existence. And Hardest problems in mathematics Canter had asked about the continuum hypothesis in the late 19th century, and it remained open, totally open until 1938. - We should mention, I apologize, that it was the number one problem in the Hilbert's 23 set of problems formulated at the beginning of the century.",
    "part2": "- That's right. - Maybe you can comment on why did he put that as number one. - So... Right. So Hilbert had introduced at his famous address at the turn of the century this list of problems that he thought could guide or were important to consider in the coming century of mathematics. I mean, that's how people talk about it now, although I'm not sure at all... Of course, I can't really speak for Hilbert at all, but if you were a very prominent mathematician, I find it a little hard to believe that Hilbert would have conceived of his list in the same way that we now take his lists. I mean, having observed the century unfold, we know that that list of 23 problems did in fact guide whole research programs, and it was extremely important and influential. But at the time, Hilbert would have no reason to think that that would be true, and he was just giving a lecture and had a list of problems that he thought were very important. And so I tend to I would find it more reasonable to think that he was just making a list of problems that he thought were extremely interesting and important and fundamental in a way without the kind of heavy burden of guiding this 20th century research. Although it turns out that in fact that's exactly what they did. And we already discussed how Hilbert's views on the nature of set theory and the fundamental character, that quote where he said, \"No one will cast us from the paradise that Canter has created for us.\" So, so I think Hilbert was convinced by Canter on the importance and the fundamental nature of the continuum hypothesis for the foundations of mathematics, which was a critically important development for the unity of mathematics. I mean, before set theory emerged as a foundation of mathematics, you know, there are different subjects in mathematics. There's algebra and there's analysis, real analysis, and topology and geometry, and so on. There are all these disparate subjects with their own axioms, separate axioms, right? And sometimes it happens, like when you're proving, say, the fundamental theorem of algebra, you know, that the complex numbers are an algebraically closed field that you can solve any polynomial equation in. But the proof methods for that theorem come from other parts of mathematics. You know, those topological proofs and so on. And so how does that work? I mean, if you have totally different axiom systems, but you're using results from o"
  },
  {
    "chunk_id": 72,
    "source_file": "file5.md",
    "part1": "ne subject in another subject, it's somehow incoherent unless there's one underlying subject. So the unity of mathematics was provided by the existence of a mathematical foundation like set theory. And at the time, it was set theory. And so it's critically important to be able to have a single theory in which one views all of mathematics as taking place to resolve that kind of transfer and borrowing phenomenon that was definitely happening. So that must have been part of Hilbert's thinking about why it's so important to have a uniform foundation, and set theory was playing that role at the time. Now, of course, we have other possible foundations coming from category theory or type theory, and there's univalent foundations now. So there are sort of competing foundations now. There's no need to just use one foundation, one set theoretic foundation. Although set theory continues to, in my view, have an extremely successful meta-mathematical analysis as a foundation, I think is much more successful than set theory for any of those other foundations, but it's much less amenable though to things like computer proof and so on, which is part of the motivation to find these alternative foundations. So, yeah, okay, so just to talk about Hilbert though, I think he was motivated by the need for a unifying foundation of mathematics, and set theory was playing that role, and the continuum hypothesis is such a core, fundamental question to ask, so it seems quite natural that he would put it on the list. There were other logic-related questions though, like Hilbert's tenth problem is also related to logic.",
    "part2": "This is the question about Diophantine equations, and he asked to provide an algorithm to decide whether a given Diophantine equation has a solution in the integers. So a Diophantine equation is just, I mean, it's maybe a fancy way of talking about something that's easy to understand, a polynomial equation, except it's not just one variable, many variables. So you have polynomials in several variables over the integers, and you want to know, can you solve it? So the problem is, as stated by Hilbert, to provide an algorithm for answering the question whether a given polynomial equation has a solution in the integers. So he's sort of presuming that there is an algorithm, but he wants to know what it is. What is the algorithm? But the problem was solved by proving that there is no algorithm. It's an undecidable problem, like the halting problem. There is no computable procedure that will correctly decide whether a given polynomial equation has a solution in the integers. So that's quite a remarkable development, I think. There were also a few other logic-related questions on the list. - And so eventually, continuum hypothesis was shown to be independent from ZFC axioms, as we've mentioned. So, how does that make you feel? What is independence, and what does that mean? - But once you tell the story, the historical story... - Yes - ...is really quite dramatic. - Ye"
  },
  {
    "chunk_id": 73,
    "source_file": "file5.md",
    "part1": "ah, that's great - I think, because Cantor poses the question, you know, late 19th century. And then it's totally open. Hilbert asks about it, you know, at the turn of the 20th century. Nobody has any clue. There's no answer coming until 1938. This is four decades later, right? So a long time, and Gödel, Kurt Gödel, proved half of it. What he proved is that if the axioms of set theory are consistent, then there is a set theoretic world where both the axiom of choice and the continuum hypothesis are true. So what he's doing is showing this is called the constructible universe, Gödel's L. So he solved this. This is the same result where he answers the safety question of the axiom of choice, but also for the continuum hypothesis. They're true in the same set theoretic universe we get. So if ZF, without the axiom of choice, is consistent, then so is ZFC plus the continuum hypothesis is the result. 1938. It's really such a beautiful argument. It's just incredible, I think, because he's building an alternative mathematical reality. That's the structure of the proof, is that, okay, if there's any mathematical reality, if there's any set theoretic world, then we're going to build another one, a separate one, a different one, maybe different. Maybe it's the same as the original one, it could be. If we started already in the one that he built, then it would be the same. But there's no reason to assume it was the same. So he has this kind of model construction method to build this alternative set theoretic reality, the constructible universe. And then he proves that the axiom of choice is true there, and also the continuum hypothesis is true there, and it's just amazing. Really beautiful argument.",
    "part2": "Okay, so then for the other part of the independence, that's only half of it, because Gödel shows basically that you can't refute the continuum hypothesis, but that's not the same thing as proving that it's true. He showed that if set theory is consistent... without the continuum hypothesis, then it's consistent with the continuum hypothesis. So that's not the same thing as proving that it's true. Yeah. And then it didn't come until 1963, when Paul Cohen invented the method of forcing. And proved that if there's a model of set theory, then there's a model of set theory in which the continuum hypothesis is false. So Cohen also is giving us this extremely powerful tool for building alternative mathematical realities, is how I think about it. He's explained to us how to take any set theoretic world and build another different one in which the continuum hypothesis is false. The forcing extension. - It's just such a fascinating technique, tool of forcing. Maybe I'm anthropomorphizing it, but it seems like a way to escape one mathematical universe into another, or to expand it or to alter it. So you travel between mathematical universes. Can you explain the technique of forcing? - Yeah, exactly. It's all those things. It's so wonderful. I mean, that's exactly how I thin"
  },
  {
    "chunk_id": 74,
    "source_file": "file5.md",
    "part1": "k about it. I mean...\nMathematical multiverse\n- And we should mention, maybe this is a good place to even give a bigger picture. One of your more controversial ideas in mathematics as laid out in the paper, The Set-Theoretic Multiverse, you describe that there may not be one true mathematics, but rather multiple mathematical universes, and forcing is one of the techniques that gets you from one to the other, so...\n- The- - Can you explain the whole shebang? The whole... - Yeah, sure. Let's get into it. So the lesson of Cohen's result and Gödel's result and so on, these producing these alternative set theoretic universes. We've observed that the continuum hypothesis is independent and the axiom of choice is independent of the other axioms, but it's not just those two. We have thousands of independence results.\nPractically every non-trivial statement of infinite combinatorics is independent of ZFC. I mean, this is the fact. It's not universally true. There are some extremely difficult prominent results where people proved things in ZFC, but for the most part, if you ask a non-trivial question about infinite cardinalities, then it's very likely to be independent of ZFC. And we have these thousands of arguments, these forcing arguments that are used to establish that.",
    "part2": "And so how should we take that? I mean, on the one hand, if you have a theory and it doesn't answer any of the questions that you're interested in... Okay, so what does that mean? If you're following what I call the universe view or the monist view, you might naturally say, \"Well, look, ZFC is a weak theory, and there's the true set theoretic reality out there, and we need a better theory 'cause the current theory isn't answering the questions. Everything's independent.\" And so that seems like a quite reasonable thing to take. If you think that there is... that every set theoretic question has a definite answer and there's a unique set theoretic truth or a unique fact of the matter, right, this is the universe view.\n- And by the way, to reiterate, independent means it cannot be proved or disproved within this axiomatic system within this theory. - Right. Exactly. So to be independent means you can't prove it and also you can't prove that it's false. You can't refute it. - And you're saying that's why the statement is so traumatic or sad, that most of the interesting stuff, as you said, has been shown to be independent. of ZFC.\n- But, but that's an interesting way to put it, I think, because it reminds me of this, uh... when I was a graduate student in Berkeley, there was another graduate student who was working with a non-logic professor in C-star algebras or something like this. So it's a part of analysis or functional analysis, and they were looking at a question, and it turned out to be independent of ZFC, right? And the attitude of this other professor was that, \"Oh, I guess I asked the wrong question.\" But my attitude and the attitude of all the set theorists was when you ask a que"
  },
  {
    "chunk_id": 75,
    "source_file": "file5.md",
    "part1": "stion that turns out to be independent, then you asked exactly the right question because this is the one... You know, it's carving nature at its joints. You're adjudicating the nature of set theoretic reality by finding these two realms. You find one of these dichotomies. You know, there's the worlds where it's true and the worlds where it's false. And so when you ask that question, that's to be celebrated. It means you asked exactly the right, interesting, fascinating question. So it's not a kind of bleak thing that you can't prove it and you can't refute it, and that's such a disaster. Rather, it means that you found this... this... this cleavage in reality, in mathematical reality, and it's good to know about those when they happen, you know? - Carving nature at its joints. So what can you do about the things that are shown to be independent from ZFC?",
    "part2": "- Right. So... - What are the techniques? - So one thing is that because of the incompleteness theorem, we know that there's going to be... For any theory that we can write down, there's going to be things that we can't prove, true things we can't prove in it. So there's those things are gonna be independent. And so we're already aware of the fact that there will always be these independent phenomenon for any theory that we write. And furthermore, some of those theories we won't even be able to prove that they're consistent, you know, like the consistency of their own theory. So that's called the consistency-strength hierarchy. So it's a direct consequence of Gödel's second incompleteness theorem that for any theory we can write down, then towering over it is this incredibly tall tower of consistency strength, where the strength in theories aren't just adding another axiom, but they're adding another axiom even whose consistency was not provable in the previous layers of the hierarchy. So, and so how lucky we are to find the large cardinal axioms that instantiate exactly this feature of increasing consistency strength, this unending and extremely tall hierarchy of consistency strength of axioms. And it exactly fulfills the prediction that Gödel's theorem makes about that kind of thing. Except, it's the axioms in the large cardinal hierarchy aren't, you know, metalogical self-referential statements of the form that sometimes arise in the Gödel analysis, but rather they're professing existence of big infinities, these large cardinal axioms. And so it's such a welcome development, and yet it's also known that the continuum hypothesis is independent of all of the known large cardinal axioms. So none of the large cardinal axioms we can prove, none of them can settle the continuum hypothesis. So the independence phenomenon is still there for things like the continuum hypothesis and the cardinal combinatorics that I mentioned. - So you're building this incredible hierarchy of axiomatic systems that are more powerful than the ZFC. - More powerful than ZFC and then more powerful than that, more powerful"
  },
  {
    "chunk_id": 76,
    "source_file": "file5.md",
    "part1": "than that, and so on. It keeps going forever, and it will never be finished. - And still, to this day, the continuum hypothesis does not... - It's not settled by any of the large cardinal axioms. - Wow. Wow. What does that mean? How does that make you feel? Will it ever be settled? - Yeah, well, it's part of my multiverse view, I guess. So which we started by, I was describing the universe view, which is the view that, look, there are facts of the matter about all of these questions and that it will turn out, if you're a universe view person, which I'm not, but if you are, then you will hold that there is a right answer to the continuum hypothesis question, and there's a right answer to the large cardinal questions and so on. And that what we should be aiming to do is figure out this one true set theory, okay? In contrast I take the developments of set theory over the past half century or more as evidence that there isn't such a unique set theoretic reality. Rather, what we've been doing for decades now is producing more and more alternative set theoretic universes in which the fundamental truths are differing from one to the other. And that is the answer to the continuum hypothesis question. The fact that given any model of set theory, there's a forcing extension where the continuum hypothesis is true, and another one where it's false. You can sort of turn it on and off like a light switch. And that's the fundamental nature of the continuum hypothesis is that you can have it or you can have the negation as you like within a very closely related set theoretic world. Wherever you happen to be living, there's a closely related one where CH is true, where the continuum hypothesis is true, and one where it's false. And that itself is a kind of answer. It's not a singularist answer, a universe view answer. It's a pluralist answer.",
    "part2": "And this led me to my views on the multiverse view of set theory and pluralist truth, namely the fundamental nature of set theoretic truth has this plural character in that there isn't a singular meaning to the fundamental terms, but rather, there's this choice of alternative set-theoretic universes that have different truths. - So, what does the multiverse view of mathematics enable you to do? What does it empower you to do and what are the limitations? What are the things it breaks about mathematics as a field, as a space of knowledge, and what does it enable? - First of all, I guess one should say that these different philosophical positions that you might take in the philosophy of set theory, like the multiverse view or the universe view, we don't ever disagree about the mathematics. We're all agreeing on what the theorems are. It's a question of philosophical perspective on the underlying meaning or the context, or really what is a philosophy of mathematics for, right? And I mean, if you look back in history, for example, like to the time of calculus with Newton and Leibniz, right? They famously developed the ideas of c"
  },
  {
    "chunk_id": 77,
    "source_file": "file5.md",
    "part1": "alculus using their concepts of infinitesimals,\nand those foundations were roundly mocked by Bishop Berkeley and so on who talked about, you know, what are these\nsame evanescent increments, and shall we not call them the ghosts of departed quantities? But the\nfoundations really were kind of completely suspect, I think, at the time. And that foundation\nof infinitesimal calculus really only became rigorous in the 1950s or so with the development of non-standard analysis and\nRobinson's work. Okay, so the point I'm trying to make is that, do you need a robust, rigorous foundation of mathematics to make enduring insights in\nmathematics? And the answer, regrettably, is apparently not because\nin calculus, even with that lousy, creaky foundation of infinitesimals not even\nwell understood that Newton and Leibniz had, they proved all the fundamental theorems of calculus and, you know, they had all the main insights\nin those early days with that extremely bad foundation. And so that shows you something about the relevance of the kind of\nfoundational views on mathematics and how important they are for mathematical developments and progress and insight. I mean, because I\nview those early mathematical developments in calculus as genuinely mathematical and extremely important\nand insightful, even though the foundations weren't any good, from, you know, by contemporary perspectives. Okay.",
    "part2": "So rather... So when it comes to the philosophy of set theory and the dispute between the universe view and the pluralism, my view is that the choice\nof the philosophical perspective doesn't actually have to do with the mathematical developments directly at all. Rather, it\ntells us, \"Where should set theory go? What kind of set theory should we be looking at? What kind of\nquestions should we be asking?\" So if you have a universe mentality, the universe view, then you're\ngonna be pushed to try to find and articulate the nature of the one true set-theoretic universe.\nAnd I think that remark is really well borne out by the developments with Hugh Woodin, who's one of the most prominent mathematicians\nand philosophers with the universe view and his theory of ultimate L and so on. And he's really striving.\n- Who was also your advisor. - He was also my supervisor. My graduate supervisor. - Which is a, a personal story as well.\n- This, this fundamental dispute, yeah, on this question. he is uh, has a very strong and successful\nresearch program, sort of trying to give legs to finding the nature of the one true set theoretic\nuniverse. And it's driving the questions that he's asking and the mathematical programs that he's pursuing. Whereas if you have a\npluralist view, as I do, then you're gonna be led and attracted to questions that have to do with the interaction of\ndifferent set theoretic universes. Or maybe you wanna understand the nature of how are the models of set theory related to their\nforcing extensions and so on. And so this led to things, um that I call, say, set theoretic po"
  },
  {
    "chunk_id": 78,
    "source_file": "file5.md",
    "part1": "tentialism, where you think about a set theoretic universe in a potentialist way. Not in the sense of potential infinity directly, because all of these universes have infinite sets inside them already. But they're potentialist in the sense that we could have more sets. The universe could be wider and taller and so on, you know, by forcing or by extending upward. And so we wanna understand the nature of this realm of set theoretic universes. And, and that's quite some exciting work. And so with Benedikt Loewe and I, we proved some theorems on the modal logic of forcing and set theoretic potentialism under end extension.",
    "part2": "I've done a bunch of work on this topic. And, and also I I mounted together with Gunter Fuchs and Jonas Riets, who was one of my own PhD students, the topic of set theoretic geology, which is studying... It's taking the metaphor of forcing. I mean, in forcing, you have the ground model and the forcing extension. And when I was first working with Jonas he said, \"I wanna undo forcing. I wanna go backwards.\" And I at first said, \"But Jonas, it doesn't work that way. You start in the model, in the ground model, and you go out, you go to the bigger one. bigger one. You know, that's how forcing works.\" And he said, \"No, no, I wanna go backwards.\" And, and so he was quite persistent, actually. And um, and so finally, I said, \"Okay, let's, let's do it. Let's take it seriously.\" And so we sat down and, and s- and started thinking, you know, more precisely and carefully and deeply about the nature of taking a set theoretic universe and seeing where did it come from by forcing, which was a new way of thinking about forcing at the time."
  },
  {
    "chunk_id": 79,
    "source_file": "file5.md",
    "part1": "ve something in the world that you arrived at through forcing and then take some of that back to the ground model? - Yeah, absolutely. And that's a really powerful argument method, actually. People often want to do that. Suppose you're in some set theoretic context. You know, you could think about as living in a set theoretic universe, and you want to prove something in that universe only. But maybe one way to do it is to first construct this forcing extension and then use the features about this forcing extension to realize that certain things must have already been true in the ground model. And then you throw the forcing extensions away and you... - Oh, cool - ...yeah. So this can happen. To pick a more elementary example, if you think about the early days of people reasoning with the complex numbers before they really understood them. So they would have these algebraic equations that they're trying to solve, you know, and they would have the tools and methods of doing it, but then in the course of, you know, so they would have to do things to the polynomial and change the factors and so on, and produce other polynomials and solve them and so on. And sometimes, they could produce solutions. in the middle of their construction, they were led to, like, the square root of minus five or something, you know, in the construction. And they didn't have any meaning for that, but they would just do it symbolically, you know. And, and eventually, it would turn in, you know, because of the methods that they had, they would combine and they would cancel and so on, and all the complex parts would cancel out and they'd end with this, you know, actual answer, you know, three plus square root of 17 or whatever. And, and they could check it and it worked. It was a solution of the original equation. And so it must have been bewildering to them because they would start with this question purely in the real numbers, an algebraic question, and they would march on their method and proceed through the land of nonsense, you know, with these square roots of negative numbers and then end up with an answer that was real again that they could verify was correct. And so, I view this kind of forcing argument that I was just describing in a similar way. You start in set theory, and you go to this land of nonsense in the forcing extension, this imaginary world. And you argue and you come back. I mean, you make a consequence in the ground model, and it's such a beautiful way of arguing.",
    "part2": "- So, speaking of the land of nonsense, I have to ask you about surreal numbers, but first, I need another bathroom break. All right, we're back, and there's this aforementioned Surreal numbers wonderful blog post on the surreal numbers, and that there's quite a simple surreal number generation process that can basically construct all numbers. So, maybe this is a good spot to ask, what are surreal numbers and what is the way we can generate all numbers? - So, the surreal number system is an a"
  }
]