[
  {
    "СВЯЗКА 1 - initial_state": "Сценарист находится в состоянии самоограничения — он сдерживает свои идеи, чувства или творческую свободу.",
    "СВЯЗКА 1 - transformation": "Режиссер наблюдает за сценаристом и замечает его внутреннее напряжение и ограниченность.",
    "СВЯЗКА 1 - result": "Режиссер осознаёт, что сценарист находится в состоянии самоограничения, что может повлиять на их совместную работу.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Авторитетный организатор ставит задачу участнику.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Организатор, опираясь на свой опыт и насмотренность, замечает возможность улучшения результата.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Результат выполнения задачи может быть улучшен."
  },
  {
    "СВЯЗКА 1 - initial_state": "Актёр находится в состоянии неуверенности, ожидая указаний от режиссёра, как правильно поступить в сцене.",
    "СВЯЗКА 1 - transformation": "Режиссёр предлагает актёру «просто попробовать», тем самым мотивируя его к импровизации, после чего следует просьба написать сцену предложения, что запускает творческий процесс.",
    "СВЯЗКА 1 - result": "Создаётся новая сцена предложения, основанная на импровизации, доверии и творческой свободе, что ведёт к раскрытию актёрского потенциала.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Имеется определённая деталь, которая не устраивает человека, её оценивающего.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Человек неоднократно просит переделать эту деталь, подчёркивая своё недовольство и требуя изменений.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Просьба о переделке повторяется несколько раз, что свидетельствует о незавершённости процесса и отсутствии удовлетворительного результата."
  },
  {
    "СВЯЗКА 1 - initial_state": "Сцена существует в первоначальном виде, вероятно, громоздкая или недостаточно эффективная.",
    "СВЯЗКА 1 - transformation": "Сценарист многократно переписывает сцену (75 раз), сокращая и улучшая её с каждой итерацией.",
    "СВЯЗКА 1 - result": "Формируется более сильная, лаконичная и хорошо структурированная сцена.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Работа участника изначально была слабее по ключевым параметрам.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник многократно переделывал и улучшал свою работу.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "В итоге результат стал значительно сильнее по ключевым параметрам."
  },
  {
    "СВЯЗКА 1 - initial_state": "Оператор находился в роли исполнителя, подчиняясь режиссёрскому руководству.",
    "СВЯЗКА 1 - transformation": "Он выполнял только те указания, которые давал режиссёр, не предлагая собственных идей или решений.",
    "СВЯЗКА 1 - result": "В результате оператор не проявил инициативы, полностью полагаясь на режиссёрские инструкции.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Авторитарная модель взаимодействия, при которой модератор полностью контролирует процесс, а участник пассивен.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник выполнял поставленную задачу строго по указаниям модератора, не проявляя собственной инициативы.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Формальное выполнение задачи без творческого вклада или самостоятельных решений со стороны участника."
  },
  {
    "СВЯЗКА 1 - initial_state": "Режиссёр изначально не интересовался мнением оператора и, вероятно, сразу предлагал свою идею, не вовлекая его в обсуждение.",
    "СВЯЗКА 1 - transformation": "Он изменил подход и стал первым спрашивать мнение оператора перед тем, как высказать свою точку зрения.",
    "СВЯЗКА 1 - result": "Это способствовало более открытому диалогу, укрепило доверие и могло повысить качество совместной работы.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Модератор сразу высказывал своё мнение, не дожидаясь окончания выступления участника.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Модератор изменил свой подход и стал сначала выслушивать точку зрения участника, прежде чем предлагать свою идею.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Установился более уважительный и продуктивный формат взаимодействия между модератором и участником."
  },
  {
    "СВЯЗКА 1 - initial_state": "Оператор выполнял свои обязанности, но не был особенно вовлечён в процесс и не проявлял инициативы.",
    "СВЯЗКА 1 - transformation": "Он стал чувствовать себя соучастником происходящего, что изменило его внутреннюю мотивацию и отношение к задаче.",
    "СВЯЗКА 1 - result": "Оператор стал более усердным и вовлечённым, у него появились неожиданные творческие идеи.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Участник не ощущал себя соучастником процесса, его вовлечённость и творческая активность были низкими.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник стал чувствовать себя соучастником, что повысило его вовлечённость, усердие и мотивацию к участию.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Произошёл творческий вклад участника, вызванный его возросшей вовлечённостью и чувством причастности."
  },
  {
    "СВЯЗКА 1 - initial_state": "Режиссёр сталкивается с трудностями при съёмке сцены с актрисой в первый день съёмок.",
    "СВЯЗКА 1 - transformation": "Происходит множество дублей, в ходе которых режиссёр пытается добиться нужного результата, но сцена не удаётся.",
    "СВЯЗКА 1 - result": "К концу первого дня съёмок сцена так и не была успешно снята.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Модератор и участник столкнулись с задачей, требующей совместного решения.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Они предприняли несколько попыток решить задачу вместе, но каждый раз сталкивались с трудностями.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Им так и не удалось успешно решить задачу."
  },
  {
    "СВЯЗКА 1 - initial_state": "Интенсивная съёмка большого количества дублей в течение одного дня, что создаёт высокую нагрузку на актёра или съёмочную группу.",
    "СВЯЗКА 1 - transformation": "Наступает ночь — время отдыха и восстановления, а на следующий день исчезают жёсткие директивы вроде «сделай так, как велели», уступая место творческой свободе и внутреннему чувству.",
    "СВЯЗКА 1 - result": "Актёр чувствует себя свободнее, начинает полагаться на интуицию и импровизацию, что может привести к более естественным и выразительным кадрам.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Модератор нагружает участника многократными попытками до предела.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник получает отдых — ночной сон.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "На следующий день модератор снимает с участника ограничения и инструкции по выполнению задачи и доверяет ему в выборе решения."
  },
  {
    "СВЯЗКА 1 - initial_state": "Сцена ещё не сложилась, образ героини остаётся недоработанным и лишённым деталей.",
    "СВЯЗКА 1 - transformation": "Сцена начинает удаваться, и в процессе её доработки постепенно формируется и обогащается деталями образ главной героини.",
    "СВЯЗКА 1 - result": "Формируется целостный и детализированный образ героини, который теперь охватывает весь фильм.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Участник выполняет задачу на хорошем уровне, демонстрируя понимание и компетентность в её решении.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Происходит автоматизация процесса решения: действия становятся более эффективными, требуют меньше усилий и осознанного контроля.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Формируется устойчивый навык, позволяющий быстро и качественно решать подобные задачи в будущем."
  },
  {
    "СВЯЗКА 1 - initial_state": "Куросава хочет поднять современную, социально значимую тему в фильме.",
    "СВЯЗКА 1 - transformation": "Он сталкивается с ограничениями со стороны цензуры, которая не позволяет ему свободно выражать социальную критику в кино.",
    "СВЯЗКА 1 - result": "Куросава не может реализовать свою идею из-за цензуры.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Автор имеет художественную задумку, которую хочет реализовать в своём творчестве.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "На пути реализации возникает цензура, которая ограничивает свободу выражения автора.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Автор не может в полной мере или вовсе не может реализовать свою художественную задумку."
  },
  {
    "СВЯЗКА 1 - initial_state": "Сюжет изначально разворачивается в современном контексте — в условиях настоящего времени с актуальными реалиями, технологиями и социальными нормами.",
    "СВЯЗКА 1 - transformation": "Происходит перенос сюжета из современности в исторический период — меняется временная и культурная среда, адаптируются персонажи, события и детали под выбранный исторический контекст.",
    "СВЯЗКА 1 - result": "Сюжет теперь представлен в исторической обстановке, что придаёт ему новый смысл, атмосферу и восприятие, несмотря на сохранение основной идеи или конфликта.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Сюжет изначально существует в современном контексте, отражая реалии текущего времени, социальные, технологические и культурные особенности современной эпохи.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Происходит перенос сюжета: автор изменяет временной и/или пространственный контекст, помещая события в историческую эпоху или вымышленный мир, адаптируя персонажей, обстановку и реалии под новый сеттинг.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Сюжет теперь разворачивается в историческом или вымышленном мире, что позволяет по-новому взглянуть на знакомые темы, подчеркнуть универсальность конфликтов или создать иронию, дистанцируясь от современности."
  },
  {
    "СВЯЗКА 1 - initial_state": "Фильм затрагивает острую, возможно, запретную или чувствительную тему, что создаёт риск столкновения с цензурными ограничениями.",
    "СВЯЗКА 1 - transformation": "Создатели фильма выбирают форму исторической драмы, используя прошлое как метафору для обсуждения современных проблем, что делает подачу темы менее прямой, но более безопасной с точки зрения цензуры.",
    "СВЯЗКА 1 - result": "Благодаря художественной трансформации через жанр исторической драмы удаётся поднять важные вопросы, избежав при этом цензурных ограничений.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Актуальная и социально значимая тема, которая может вызвать конфликт с цензурой при прямом освещении.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Тема подаётся в завуалированной, исторической форме через художественное произведение, что позволяет обойти прямые запреты и избежать конфликта.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Удаётся поднять важный вопрос и обсудить его публично, не нарушая при этом требования цензуры."
  },
  {
    "СВЯЗКА 1 - initial_state": "Актёр начинает работу над фильмом и не имеет достаточного представления о профессиональном уровне режиссёра.",
    "СВЯЗКА 1 - transformation": "Актёр наблюдает за работой режиссёра, изучает его методы, стиль руководства и художественный подход к процессу съёмок.",
    "СВЯЗКА 1 - result": "Актёр формирует чёткое понимание уровня режиссёра, что позволяет ему выстроить эффективное взаимодействие на съёмочной площадке.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Участник коллектива не знает уровень модератора и хочет в этом разобраться перед началом совместной работы.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Он анализирует опыт, поведение или компетенции модератора, возможно, через наблюдение, вопросы или проверку его предыдущих действий.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Участник формирует чёткое представление об уровне модератора, что позволяет ему строить ожидания и эффективно взаимодействовать в дальнейшем."
  },
  {
    "СВЯЗКА 1 - initial_state": "Актёр должен снять сцену и заинтересован в том, чтобы понять, насколько внимательно режиссёр относится к качеству исполнения.",
    "СВЯЗКА 1 - transformation": "Он сознательно играет два дубля — один качественно, другой халтурно — и наблюдает, какой из них выберет режиссёр.",
    "СВЯЗКА 1 - result": "Выбор режиссёра покажет, насколько он чуток к актёрской игре и качеству съёмки: если выберет халтурный дубль — значит, невнимателен, если качественный — значит, профессионален.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Участник находится в ситуации, где необходимо продемонстрировать свою работу, но он хочет понять, какие стандарты действительно ценятся модератором.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник намеренно представляет два варианта своей работы — добросовестный и халтурный — и наблюдает, какой из них выберет модератор, используя этот выбор как тест его профессиональных приоритетов.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Выбор модератора интерпретируется как показатель его отношения к проекту: если выбран качественный вариант, это свидетельствует о стремлении к успеху; если халтурный — о низких стандартах."
  },
  {
    "СВЯЗКА 1 - initial_state": "Режиссёр выбирает халтурный дубль во время съёмок.",
    "СВЯЗКА 1 - transformation": "Марлон Брандо замечает этот выбор и анализирует его.",
    "СВЯЗКА 1 - result": "Брандо делает вывод о низком профессиональном уровне режиссёра.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Модератор выбирает халтурный вариант решения или действия.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник анализирует выбор модератора и делает вывод на основе этого решения.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Участник приходит к пониманию, что модератор является низкоквалифицированным."
  }
]