[
    {
        "Текст примера": "Типичным было и то увлечение, с которым я занялся психоаналитическими исследованиями. Прежде всего я организовал маленький психоаналитический кружок. Я даже заказал почтовую бумагу со штампом «Казанская психоаналитическая ассоциация», напечатанном на русском и немецком языках. Затем я отправил информацию об организации этой группы самому Фрейду и был поражен и обрадован, получив ответное письмо, начинавшееся с обращения «Дорогой господин президент». Фрейд сообщал, что он рад был узнать, что в таком отдаленном восточном русском городе, как Казань, организовался психоаналитический кружок. Это письмо, написанное готическим немецким шрифтом, и другое, санкционирующее русский перевод одной из его небольших книг, находятся в моем архиве.\n\nНа ранних этапах работы кружка мы занимались исследованием пациентов Казанской психиатрической клиники, представлявшей собой часть медицинского факультета Казанского университета. Интересно, что одна из пациенток этой клиники оказалась внучкой Федора Достоевского. Хотя я заполнял целые тетради ее «свободными ассоциациями», я был не в состоянии выполнить свой план и использовать эти материалы для обнаружения «конкретной реальности потока идей». Фактически сама постановка проблемы с очевидностью показывает, что такой подход ни к чему серьезному не мог привести.\n\nПозднее я опубликовал несколько статей, основанных на идеях психоанализа, и даже составил план книги об объективном подходе к психоанализу, которая никогда не была напечатана. В конце концов я убедился, что ошибочно считать человеческое поведение продуктом «глубин» сознания, игнорируя его социальные «высоты».\n\n[...]\n\nВ 1923 г. профессор К.Н. Корнилов, который только что был назначен директором Московского института психологии, предложил мне стать его сотрудником. Он остановил на мне свой выбор, так как ему нужны были молодые сотрудники, которые занимались бы экспериментальной психологией. Мои первые статьи, напечатанные в Казани, в которых использовались объективные методы изучения влияния утомления на моторные реакции, привлекли его внимание.\n\n[...]\n\nТрудно описать все переживания в начале моей профессиональной жизни, можно только сказать, что они были в высшей степени амбивалентны. Я полностью сочувствовал усилиям института разработать объективные методы психологического исследования, но был невысокого мнения о механистических попытках Корнилова измерить умственное напряжение. Мой ранний интерес к психоанализу помог преодолеть это амбивалентное чувство и выбрать себе интересное дело. Я нашел применение даже «динамоскопу» — V-образной стеклянной трубке, наполненной ртутью, которой пользовался Корнилов для записи силы движения на движущейся бумаге. Во время моих ранних экспериментов в Казани я пользовался этим инструментом для измерения силы двигательных реакций и заметил тогда интересный феномен. Если создавались условия, когда испытуемые не имели уверенности, что им следует делать, например нажимать или не нажимать (на ключ), то кривая их движений нарушалась, отражая эту неуверенность.\n\nУ меня возникла мысль: нельзя ли использовать эти наблюдения для объективного экспериментального изучения конфликта, стресса и сильных эмоций? Другими словами, я решил приступить к собственному «экспериментальному психоанализу», используя колебания интенсивности двигательных реакций в качестве объективного выражения внутренних эмоциональных конфликтов.\n\nЛурия А.Р. Этапы пройденного пути: Научная автобиография. М.: Изд-во Моск. ун-та, 2001. С. 11-12, 15,",
        "Название примера": "Повышение квалификации через создание коллектива помогает разобраться теме, определить её границы, вступить в новый коллектив  и выбрать для себя новую тему для исследования.",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Студент начинает свой путь в психологии",
                "преобразование": "На старте изучения области знания",
                "результат": "Воспроизводимость (1)"
            }
        ]
    },
    {
        "Текст примера": "Трудно описать все переживания в начале моей профессиональной жизни, можно только сказать, что они были в высшей степени амбивалентны. Я полностью сочувствовал усилиям института разработать объективные методы психологического исследования, но был невысокого мнения о механистических попытках Корнилова измерить умственное напряжение. Мой ранний интерес к психоанализу помог преодолеть это амбивалентное чувство и выбрать себе интересное дело. Я нашел применение даже «динамоскопу» — V-образной стеклянной трубке, наполненной ртутью, которой пользовался Корнилов для записи силы движения на движущейся бумаге. Во время моих ранних экспериментов в Казани я пользовался этим инструментом для измерения силы двигательных реакций и заметил тогда интересный феномен. Если создавались условия, когда испытуемые не имели уверенности, что им следует делать, например нажимать или не нажимать (на ключ), то кривая их движений нарушалась, отражая эту неуверенность.\n\nУ меня возникла мысль: нельзя ли использовать эти наблюдения для объективного экспериментального изучения конфликта, стресса и сильных эмоций? Другими словами, я решил приступить к собственному «экспериментальному психоанализу», используя колебания интенсивности двигательных реакций в качестве объективного выражения внутренних эмоциональных конфликтов.\n\nСвободные ассоциации, как называл их Юнг в своих «Studies of Diagnostic Associations» (1910), являлись компонентом разработанной нами методики. Мы просили испытуемого давать двигательный ответ одновременно с каждым словесным ассоциативным ответом. Я подчеркиваю слово одновременно, так как логика нашего подхода требовала, чтобы словесный и двигательный компоненты ответа объединялись в единую функциональную систему. Только при условии одновременности мы могли бы быть уверены, что эмоциональная реакция будет отражена в искажении кривой, образуемой механограммой нажима.\n\nТак у нас начался напряженный период исследований, которому суждено было продлиться много лет. Сначала мы с А.Н. Леонтьевым проводили опыты на студентах, готовящихся к экзаменам. Мы давали инструкцию испытуемому сжимать маленькую резиновую грушу правой рукой, держа в то же время в совершенно спокойном состоянии левую руку на другой резиновой груше, одновременно произнося первое слово, пришедшее в голову в ответ на наши словесные раздражители.\n\nМы предъявляли два вида слова: «нейтральные» (обыкновенные) слова, не имеющие специального значения для человека, сдающего экзамен, и «критические» слова, например «экзамен», «формула» и «сдал», которые были связаны с ситуацией экзаменов. При анализе словесных ответов студентов, основанных на свободных ассоциациях, а также времени реакции, оказалось, что ответы на эти два вида слов не различаются. Но когда мы проанализировали двигательную реакцию левой руки при произвольном нажатии ключа правой рукой, то оказалось, что, когда возникали эмоции, вызванные «критическими» для данного испытуемого словами, кривая движений искажалась.\n\nЗатем мы решили попробовать, нельзя ли использовать эту методику для обнаружения у человека «скрытых комплексов». Мы имели в виду то явление, которое интересовало Фрейда и психоаналитическую школу, — эмоциональный опыт, влияющий на поведение вне сознания. Мы начали с разработки лабораторной модели этой проблемы, соответствовавшей, как мы полагали, реальной жизненной ситуации. Для этой цели нужно было уметь уверенно различать ответы на «критические» и «нейтральные» слова.\n\nНаш эксперимент состоял в следующем. Мой ассистент составлял рассказ, который прочитывался нескольким испытуемым. Один из рассказов был, например, о воре, залезшем через окно в церковь и укравшем золотой подсвечник, икону и распятие. Испытуемым давалось задание запомнить рассказ, но скрывать, что он им известен. Затем их и других испытуемых, которые не слышали рассказа, просили принять участие в эксперименте, в ходе которого требовалось ответить на список примерно из семидесяти слов, десять из которых являлись «критическими». Испытуемые должны были нажимать правой рукой на ключ, отвечая при этом любым словом. В мою задачу входило определить на основе комбинированной записи двигательных и словесных ответов, какие из слов являлись «критическими», кто из испытуемых был знаком с рассказом и каков был сам рассказ. Впоследствии эта методика нашла применение в судебной практике.\n\nПсихологи, интересующиеся изучением эмоций, всегда искали способы вызвать эмоциональные состояния, достаточные для изучения стабильности и продолжительности. Однако многочисленные попытки достигнуть этого, предшествовавшие нашим исследованиям, не были успешными. Как правило, острые эмоциональные состояния, подобные страху, в лабораторных условиях вызывались искусственно, например неожиданным выстрелом из ружья позади головы испытуемого и т.п. Эти методы страдали двумя недостатками: во-первых, эмоция никоим образом не являлась частью реальной жизненной ситуации, а вызывалась лишь искусственным инцидентом, не имеющим отношения к целям и побуждениям испытуемого; во-вторых, стрессовые состояния, вызванные таким путем, быстро проходили.\n\nМы решили, что единственный путь преодоления этих недостатков наших собственных и прочих исследований — изучение людей, испытывающих сильные эмоции в реальных жизненных ситуациях. Мы остановились на действительных или подозреваемых преступниках. Мы полагали, что если обследовать преступников непосредственно после их ареста и на различных этапах после него, например накануне суда, мы сможем наблюдать сильные эмоции, в действительности являющиеся частью их реальной жизни. Подобные ситуации обычно вызывают несколько интенсивных эмоций, являющихся следствием самого преступления, вызванных задержанием и арестом и порожденных страхом перед наказанием. Кроме того, у нас была возможность экспериментировать с испытуемыми, невиновность которых была впоследствии установлена, и мы получили таким образом контрольную группу людей, которые испытывали страх перед заключением в тюрьму (и эмоции, возникающие вследствие неопределенности ситуации), но которым не были известны детали преступления. В подобных случаях наблюдался общий стресс при отсутствии специфических «эмоциональных комплексов», связанных с преступлением. Мы предполагали, что если известны детали преступления, то можно использовать их в качестве критических раздражителей в сопряженном моторном тесте, и это дало бы возможность реконструировать события на основе полученных данных и решить, кто виновен.\n\nКонечно, не мы первые подумали о подобной работе с преступниками, но в прошлом исследователи ограничивались работой с осужденными лишь после того, как они освобождались. У нас же была возможность работать с подозреваемыми со времени их ареста до суда и позже. За несколько лет работы нам удалось собрать экспериментальные данные более чем по пятидесяти испытуемым, большинство которых были действительными убийцами или подозревались в убийстве.\n\nОдин из первых наших фактов, полученных в процессе этой работы, заключался в том, что сильные эмоции препятствуют образованию стабильных автоматических двигательных и словесных ответов, в то время как у контрольных испытуемых с тем же умственным развитием стабильные ответы появлялись после небольшого числа проб. Испытуемые, находящиеся под влиянием сильных эмоций, как бы приспосабливаются каждый раз к новой ситуации, у них не создается единая функциональная система, включая как двигательные, так и речевые компоненты, причем их речевые компоненты часто запаздывают. Этот диффузный распад координированных реакций мешал обнаружению локализованного «источника» эмоций, чего следовало ожидать у преступника, имеющего специфические сведения о преступлении — фоновые реакции были слишком разнообразны. Во всех случаях мы применяли процедуру сравнения реакций испытуемого на различные слова — такие, о которых можно было уверенно сказать, что они «нейтральные», «сомнительные» и те, которые были тесно связаны с преступлением. Применяя эту процедуру сравнения реакций на различные типы слов у одного и того же испытуемого, мы часто обнаруживали действительного преступника среди других подозреваемых. Поскольку это исследование проводилось до формального следствия, мы могли использовать поздние показания преступника для проверки наших гипотез.\n\nЭта работа оказалась практически полезной для криминалистов, являясь ранней моделью детектора лжи. Для меня это было осуществление задачи, которую я поставил перед собой при переезде в Москву, — применить объективные методы к изучению эмоциональных ситуаций, являющихся неотделимой частью реальной жизни человека. Хотя теоретическая база этой работы была наивна, для меня она была гораздо привлекательнее корниловской «реактологии», не связанной с действительными жизненными проблемами.\n\nВозможно потому, что по стилю эта работа была типична для того времени, она вызвала интерес за пределами России. Макс Вертгеймер напечатал одну из моих ранних статей в «Psychologische Forschungen». Позднее эта линия исследования привлекла внимание американских ученых, один из которых, Хорсли Гант, переводчик павловской книги об условных рефлексах, перевел мою книгу под заглавием «The Nature of Human Conflicts», вышедшую из печати в США в 1932 г. Мне было в особенности приятно, что такой крупный психиатр, как Адольф Майер, написал к ней предисловие, в котором он говорил, что «Лурия предлагает нам интересную психобиологию вместо широко распространенных нейрологизирующих тавтологий, психологию, находящуюся в тесном соответствии со смыслом работ Лешли и других американских ученых, но четко занимающуюся человеческими проблемами. Он показывает гораздо большую применимость лабораторных методов для конкретных целей, чем это принято считать, не позволяя себе никаких отклонений в чисто \"физиологические концепции\"». Теперь, сорок лет спустя после публикации этой книги, я сохраняю благодарность к этому большому психиатру за моральную поддержку моей ранней работы.\n\nПочти через половину столетия я вижу, в чем ценность и недочеты этого исследования. Оно осуществило мои ранние задачи и одновременно открыло новые научные проблемы, такие, как афазия, раннее развитие ребенка, которые заняли центральное место в моей последующей работе. Тем не менее мои первоначальные попытки применить «сопряженную моторную методику» имели ограниченную ценность. Хотя эта методика и представляла собой синтез методик и подходов, существовавших изолированно друг от друга до наших исследований, она не привела к капитальной реконструкции психологии как науки. Эта огромная задача, превышавшая мои ограниченные возможности, совершенно неожиданно встала передо мной в 1924 г., после того, как я встретился со Львом Семеновичем Выготским. Это событие было поворотным пунктом в моей жизни, так же, как и в жизни многих коллег-психологов.\n\nЛурия А.Р. Этапы пройденного пути: Научная автобиография. М.: Изд-во Моск. ун-та, 2001. С. 19-24",
        "Название примера": "Польза эксперимента и способы его организации на примере первых экспериментов А.Р. Лурии",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Создать объективные методы психологического исследования эмоциональных реакций",
                "преобразование": "Для исследования реакций человека",
                "результат": "Воспроизводимость (6)"
            }
        ]
    },
    {
        "Текст примера": "Мы встретились в 1924 г. на втором психоневрологическом съезде в Ленинграде. Это был важный форум советов ученых, работавших в области психологии. К.Н. Корнилов привез из Института психологии несколько своих молодых коллег, в числе которых был и я.\n\nКогда Л.С. Выготский поднялся на трибуну, чтобы начать свое выступление, у него не было ни печатного текста, ни конспекта. Однако он говорил плавно, без остановок, легко переходя от одной мысли к следующей. Уже сама манера изложения показалась мне исключительной благодаря убедительности его стиля. Еще большее впечатление произвело на меня содержание доклада. Вместо того чтобы обсуждать какой-либо второстепенный вопрос, как подобало бы молодому человеку двадцати восьми лет, впервые выступающему перед столь почетным собранием, Л.С. Выготский выбрал трудную тему о взаимоотношении условных рефлексов и сознательного поведения человека. Эта тема была очень актуальна. Только в предыдущем году Корнилов использовал ту же самую трибуну для нападок на интроспективные теории в психологии. Его точка зрения восторжествовала, и его объективный реактологический подход стал доминирующим в Институте психологии. Как известно, В.М. Бехтерев и И.П. Павлов также были противниками субъективной психологии, ключевой проблемой которой была проблема сознания.\n\nЛ.С. Выготский выступил с идеей, что сознание как проблема должно остаться в психологии, однако его следует изучать объективными средствами. Хотя ему и не удалось убедить всех в правильности своего взгляда, было ясно, что этот человек, приехавший из маленького провинциального городка, представляет собой интеллектуальную силу, с которой следует считаться. Было решено пригласить Л.С. Выготского работать в новом, реорганизованном Институте психологии в Москве. Осенью этого года Л.С. Выготский прибыл в институт, и мы приступили к совместной работе, которая продолжалась до его смерти, наступившей десять лет спустя.Лурия А.Р. Этапы пройденного пути: Научная автобиография. М.: Изд-во Моск. ун-та, 2001. С. 25-26",
        "Название примера": "Произвести впечатления для вступления в профессиональный коллектив: выступить с докладом на конференции",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Участие на конференции с докладом",
                "преобразование": "Новичок участвует на профильной конференции",
                "результат": "Воспроизводимость (3)"
            }
        ]
    },
    {
        "Текст примера": "Когда Л.С. Выготский приехал в Москву, я продолжал исследования при помощи сопряженной моторной методики совместно с А.Н. Леонтьевым, в прошлом учеником  Челпанова, с которым я сотрудничал всю дальнейшую жизнь. Мы с А.Н. Леонтьевым высоко ценили необычайные способности Л.С. Выготского и были очень рады, когда его включили в нашу рабочую группу, которую мы назвали «тройка». Вместе с Л.С. Выготским в качестве нашего признанного лидера мы предприняли критический обзор истории и современного состояния психологии. Наша грандиозная идея заключалась в создании нового научного подхода к человеческим психологическим процессам.\n\nНашим общим мнением с самого начала было то, что ни субъективная психология, предложенная Г.И. Челпановым, ни упрощенные попытки свести всю сознательную деятельность к простым рефлексологическим схемам не могут быть использованы как модель реальной человеческой психологии. Нужно было пересмотреть прежние позиции и найти новый подход. Л.С. Выготский предвидел в общих чертах, каков будет этот новый подход.\n\nШироко используя труды немецких, французских, английских и американских ученых, Л.С. Выготский приступил к анализу того, что он называл кризисом психологии. Он обсуждал эти идеи на различных конференциях и изложил их письменно в 1926 г., когда был госпитализирован для лечения туберкулеза. К сожалению, этот труд так и не был напечатан. Во время Второй мировой войны рукопись была утеряна, а копия была обнаружена лишь в 1960 г. в его архиве*.\n\nСогласно анализу, проведенному Л.С. Выготским, положение в мировой психологии в начале двадцатого столетия было чрезвычайно парадоксальным. Во второй половине девятнадцатого столетия Вундту, Эббингаузу и другим психологам удалось превратить психологию в естественную науку. Свою основную задачу они видели в том, чтобы свести сложные психологические явления к элементарным механизмам, которые можно подвергнуть изучению в лаборатории при помощи точных экспериментальных методик. «Смысл» или «значение» сложных раздражителей намеренно оставлялись за пределами исследования, причем экспериментатор пытался нейтрализовать влияние опыта, почерпнутого вне лаборатории. Изолированные тоны, вспышки света, бессмысленные слоги — таковы были излюбленные раздражители, пользуемые этими психологами. Цель исследования состояла в обнаружении элементарных законов, вызывающих определенные реакции.\n\nПризнавая определенный успех этого подхода, Л.С. Выготский указывал, однако, что этот вид исследований фактически проходил мимо сложнейших форм психической деятельности, включая сознательно контролируемое действие, произвольное внимание, активное запоминание и отвлеченное мышление. Такие феномены или игнорировались, как в теориях, основанных на принципах рефлексологии, или же сводились к умозрительным описаниям, как в вундтовском понятии апперцепции. \n\nНеумение физиологических психологов анализировать сложные психические функции человека заставило Дильтея, Шпрангера и других предложить альтернативный подход. Поставив своей основной задачей изучение таких сложных психических процессов, как воля, произвольные акты, абстрактное мышление, эти психологи предложили чисто феноменологический, описательный подход. Они утверждали, что объяснение этих явлений принципиально невозможно, как якобы невозможно ответить на вопрос: почему сумма углов треугольника равна 180?\n\nНаблюдая подобную ситуацию, Л.С. Выготский указывал, что подобное «разделение труда» между психологами-натуралистами и психологами-феноменологами привело к молчаливому соглашению, что сложные психологические функции, те самые, которые отличают человека от животного, не поддаются научному исследованию. Натуралисты и менталисты исповедовали расчлененную психологию. Целью Л.С. Выготского и всех нас было создание новой системы, которая являлась бы синтезом этих конфликтующих подходов.\n\nМы провели большую теоретическую работу и проанализировали в начале 1925 г. почти всю предшествовавшую психологию. Большое влияние на наши представления о физиологических основах психологических процессов оказали павловские исследования «высшей нервной деятельности». Павловская физиология дала материалистическую основу для нашего изучения психики.\n\nОсобое впечатление произвели на Л.С. Выготского труды В.А. Вагнера, выдающегося русского специалиста по сравнительному изучению поведения животных. Вагнер был ученым, применявшим широкий биологический подход к поведению животных. Его мысль об эволюции произвели огромное впечатление на Л.С. Выготского, и эти два ученых переписывались в течение долгого времени.\n\nЧитая труды наших немецких современников, в особенности Курта Левина, Хайнца Вернера, Вильяма Штерна, Карла и Шарлотты Бюлер и Вольфганга Кёлера, мы хотя и не соглашались со многими из их теоретических положений, однако находили в них и много достоинств. Мы соглашались с их утверждением о качественно иной сложности многих психологических явлений по сравнению с поведением животных. Павловские рефлексы могли служить материальной основой определенных психических актов, но они не объясняли реальной сложности человеческого поведения, или свойства высших психических процессов. Подобно тому, как невозможно установить свойства воды из знания свойств составляющих ее водорода и кислорода, нельзя получить сведения о свойствах психологических процессов (например, произвольного внимания) из знания того, каким образом возникает условный рефлекс на новый раздражитель. В обоих случаях свойства «системы» (в одном случае — воды, в другом — произвольного внимания) следует понимать как качественно отличные от свойств элементов, их составляющих.\n\nМы также были полностью согласны с мнением немецких авторов о том, что внешне одинаковые типы поведения необязательно являются отражением действия одинаковых психологических механизмов. При изучении детей разного возраста или людей разных культур нужно тщательно исследовать природу и историю развития внешнего сходства для того, чтобы исключить весьма вероятное их различие.\n\nМы тщательно ознакомились с книгой Ж. Пиаже «Язык и мышление ребенка». Наше коренное разногласие с работой этого выдающегося швейцарского психолога заключалось в интерпретации взаимоотношения между языком и мышлением. Однако стиль его исследования, в особенности использование клинического метода для изучения индивидуальных познавательных процессов, полностью соответствовал нашей цели — обнаружить качественные различия между детьми разных возрастов.\n\nЛ.С. Выготский был для нас ведущим теоретиком марксизма. В 1925 г., когда он опубликовал лекцию, которая привела его в Москву, он включил в нее цитату из работы Маркса, представляющую собой одно из ключевых положений в разрабатываемой им концепции:\n\n«Паук совершает операции, напоминающие операции ткача, и пчела постройкой своих восковых ячеек посрамляет некоторых людей-архитекторов. Но и самый плохой архитектор от наилучшей пчелы с самого начала отличается тем, что, прежде чем построить ячейку из воска, он уже построил ее в голове. В конце процесса труда получается результат, который уже в начале этого процесса имелся в представлении человека, т.е. идеально. Человек не только изменяет форму того, что дано природой; в том, что дано природой, он осуществляет вместе с тем и свою сознательную цель, которая как закон определяет способ и характер его действий и которой он должен подчинить свою волю» («Капитал», т. I, с. 189).\n\nЭто положение Маркса сыграло существенную роль в формировании экспериментальной психологии высших психических функций.\n\nПод влиянием марксизма Л.С. Выготский пришел к убеждению, что происхождение высших сознательных форм психики следует искать в общественных отношениях личности с окружающим миром. Но человек не только является продуктом своей среды — он также активно участвует в создании своей среды. Пропасть между физиологическими объяснениями элементарных актов и менталистическими описаниями сложных психических процессов будет сохраняться до тех пор, пока мы не сможем понять, каким образом естественные процессы, как, например, физическое созревание и сенсорные механизмы, взаимодействуют с процессами, определяемыми культурой; именно это взаимодействие и создает психическую деятельность взрослого человека. Нам нужно выйти за пределы организма, чтобы обнаружить источники специфически человеческих форм психологической деятельности.\n\nЛ.С. Выготский любил называть свою теорию «инструментальной», «культурной» или «исторической» психологией. Каждый из этих терминов отражал различные черты предложенного им нового подхода к психологии. Каждый из них подчеркивал различные источники общего механизма, при помощи которого общество и его история создают структуру тех форм деятельности, которые отличают человека от животных.\n\nТермин «инструментальная» определял опосредствованную в основе своей природу всех сложных психических функций. В отличие от условных рефлексов, которые можно охарактеризовать как процессы, протекающие по типу «стимул–реакция», высшие психические функции включают дополнительные стимулы, которые обычно исходят от самого человека. Взрослый человек не только реагирует на стимулы — искусственные (предъявляемые экспериментатором) или естественные, но и активно изменяет эти стимулы и использует эти изменения для регуляции своего поведения. Нам знакомы некоторые из этих модификаций из народных обычаев, например завязывание узелка, чтобы лучше запомнить, и т.п. Много примеров действия этого принципа было обнаружено и при изучении структуры детского мышления в возрасте от трех до десяти лет.\n\n«Культурный» аспект теории Л.С. Выготского включал социально детерминируемые способы организации знаний, предъявляемых ребенку, и виды орудий, как умственных, так и физических, которыми обеспечивается ребенок для выполнения различных задач. Одним из ключевых орудий, изобретенных человечеством, является язык, и Л.С. Выготский особо подчеркивал его роль в организации и развитии процессов мышления.\n\n«Исторический» аспект объединялся с «культурным». Орудия, используемые людьми для управления окружающей средой и собственным поведением, они не получили готовыми; они изобретали и совершенствовали их в ходе социальной истории. Особое место занимает язык, который является способом обобщения человеческих знаний. Специальные орудия культуры, подобные письму и счету, колоссально расширяют возможности человека, делая мудрость прошлого достоянием настоящего и залогом совершенствования в будущем. Эта линия аргументации приводила к выводу, что если бы мы могли исследовать, каким путем различные мыслительные операции создаются у людей, чья история культуры не снабдила их еще таким орудием, как письмо, мы обнаружили бы иную организацию высших психических процессов, но ту же самую структуру элементарных процессов. Я получил возможность проверить эту гипотезу в начале 30-х гг.\n\nВсе три аспекта этой теории применимы к развитию ребенка. С момента рождения дети вступают в непрерывное взаимодействие со взрослыми, которые активно стремятся включить их в свою культуру, в свой исторически накопленный запас знаний и умений. Вначале в реакциях детей на окружающий мир преобладают естественные процессы, имеющие врожденный характер. Но благодаря влиянию взрослых начинают формироваться более сложные инструментальные психические процессы. Сначала эти процессы могут включаться в действие только в ходе взаимодействия детей со взрослыми. По словам Л.С. Выготского, эти процессы являются «интерпсихическими», то есть в них участвуют разные люди. На этой стадии взрослые служат посредниками в контакте детей с окружающим миром. Однако постепенно процессы, которые ранее дети осуществляли вместе со взрослыми, начинают происходить у них самостоятельно. Это означает, что реакции на окружающий мир через посредство взрослых становятся «интрапсихическими» процессами. Именно путем этой интериоризации исторически детерминированных и культурно организованных путей оперирования информацией социальная природа людей становится также и их психологической природой.\n\nПриступив к этой работе, мы — Л.С. Выготский, А.Н. Леонтьев и я — начали встречаться на квартире Л.С. Выготского один или два раза в неделю, чтобы разработать план дальнейших исследований. Мы рассматривали каждый из основных разделов психологии: восприятие, память, внимание, речь, решение задач, моторику и др. В каждой из этих областей начали применять новую экспериментальную методику, чтобы доказать, что по мере формирования высших форм деятельности меняется вся структура психических процессов.\n\nВ это время я занимал пост заведующего лабораторией психологии в Институте коммунистического воспитания им. Н.К. Крупской. Привлекая студентов университета, я организовал студенческий психологический кружок, в котором мы обсуждали идеи Л.С. Выготского. Все студенты и коллеги Л.С. Выготского приняли участие в изобретении экспериментальных моделей для анализа «инструментального» поведения.\n\nРабота по проблеме памяти стала сферой деятельности А.Н. Леонтьева. А.Н. Леонтьев поставил задачу исследовать у нормальных и умственно отсталых детей разного возраста возможность использовать дополнительные стимулы для запоминания серии раздражителей, предъявленной экспериментатором. А.Н. Леонтьев показал, что процесс освоения опосредствованного запоминания долог и труден. Вначале маленький ребенок, которому предлагают запомнить слова и предъявляют картинки, четкое содержание которых связано со смыслом слов (например, слово «лошадь» и картинку, на которой изображены сани, и т.п.), совершенно не обращает внимания на картинки. Такой ребенок может запомнить два, три или четыре слова, но не последовательно, явно не прилагая для этого никаких специальных усилий. Этот тип запоминания мы назвали «естественным запоминанием», поскольку раздражитель (слово) в этом случае очевидно запоминается в процессе прямого, непосредственного впечатления.\n\nНесколько позднее ребенок начинает обращать внимание на картинки или «вспомогательные стимулы», как мы их назвали. Иногда эти вспомогательные стимулы помогали ребенку, но не менее часто они не способствовали запоминанию нужного слова. Вместо этого ребенок просто включал их в цепь ассоциаций. Так, если вспомогательным стимулом служил рисунок «сани», ребенок мог припомнить слово «снег» вместо «лошади». Еще позднее ребенок уже способен вполне эффективно использовать такие вспомогательные сигналы, но процесс использования этих дополнительных стимулов остается для ребенка все еще внешним в том смысле, что связи между раздражителями, которые следовало запомнить, и дополнительными стимулами еще не опирались на богатый внутренний опыт ребенка, т.е. на культуру. Только несколько позже, у детей в возрасте девяти-десяти лет способность устанавливать связи становится внутренним процессом: дети начинают создавать свои собственные дополнительные сигналы, и любые вспомогательные раздражители превращаются в эффективное средство запоминания. Эта идея использования двух наборов раздражителей – один из них основной, подлежащий запоминанию, а другой – вспомогательный, который может служить инструментом для усвоения первого, стала основным методическим приемом во всех наших исследованиях (методика двойной стимуляции).\n\nДругая линия исследования была посвящена процессу выбора. Исследуя процесс сложного выбора у взрослых испытуемых, психологи обычно использовали простую двигательную реакцию: испытуемые должны были при предъявлении раздражителя нажимать на телеграфный ключ. Сравнивая время двигательной реакции на один раздражитель с временем, затрачиваемым на выбор между двумя или более раздражителями, исследователи надеялись установить отличие процесса выбора от других процессов, как, например, дифференциации стимулов и организации собственной двигательной реакции. Л.С. Выготский подверг эти исследования строгой критике, указывая на противоречия в получаемых результатах и на необходимость искать новый путь изучения процесса выбора.\n\nСотрудница Л.С. Выготского Н.Г. Морозова стала изучать развитие способности к сложному выбору у маленьких детей. В ее экспериментах ребенку трех-четырех лет давалась простая задача: «Нажми эту кнопку, когда увидишь красную карточку, эту – когда синюю, а эту – зеленую». Затем ребенку показывали одновременно две или три карточки, и требовалось сделать выбор. Когда были введены эти усложнения, двигательные реакции ребенка распадались, ребенок часто забывал, какой цвет соответствует какому ключу. Даже если ребенок помнил, какие ключи надо нажимать в ответ на карточки, то его реагирование резко отличалось от типичного для взрослых. Как только появлялся раздражитель, ребенок делал неуверенные движения, как будто вместо выбора раздражителя выбирал собственные движения.\n\nОт реакции выбора вскоре Н.Г. Морозова перешла к исследованию памяти, сходному с тем, которое проводил А.Н. Леонтьев. Для облегчения запоминания связи между раздражителями и ответами, трудного для маленького ребенка, Н.Г. Морозова начала вводить в эксперимент по реакции выбора дополнительные раздражители. Так, если картинка, изображающая лошадь, была стимулом к движению, то дополнительная картинка «сани» приклеивалась к соответствующему ключу. Когда Н.Г. Морозова проследила, как дети начали пользоваться дополнительными раздражителями для организации своих реакций выбора, она обнаружила, что законы опосредствованного запоминания применимы также к выработке двигательного навыка в эксперименте по реакции выбора.\n\nВ то же время Р.Е. Левина проводила исследование планирующей роли речи. Внешне эта работа казалась совершенно отличной от работ А.Н. Леонтьева и Н.Г. Морозовой, но основная ее идея была той же. Хотя Пиаже и произвел на нас впечатление своими исследованиями, мы категорически возражали против его идеи, что в раннем возрасте речь ребенка не играет существенной роли в развитии его мышления. По мнению Л.С. Выготского, фазы развития взаимоотношения речи и мышления были в общем следующие. Первоначально двигательные и речевые аспекты поведения ребенка слиты воедино. Речь ребенка в это время направлена на предметно ориентированную беседу, эмоциональные выражения и другие виды социального контакта. Так как ребенка окружают взрослые, постепенно его речь начинает играть в его поведении все большую роль и помогает ребенку обозначить то, что он делает и что ему нужно. Через некоторое время ребенок начинает использовать речь не только для общения с другими, он начинает использовать ее и для себя самого. Таким путем речь перестает быть только средством воздействия на других и начинает выполнять функцию самоуправления.\n\nР.Е. Левина просила трех-четырехлетних детей решать задачи, подобные тем, которые Вольфганг Кёлер предлагал своим шимпанзе: доставать желаемые объекты, до которых трудно дотянуться. Например, конфету клали на буфет, куда ребенок не мог дотянуться, а поблизости, на полу, клали палку. Наблюдали, как будут вести себя дети в этих условиях. Один ребенок решал эту задачу, все время разговаривая сам с собой:\n\n«Конфетка лежит так высоко. (При этом девочка вскарабкивается на диван и прыгает вверх и вниз.) Нужно позвать маму, он поможет мне. (Снова прыгает.) Нельзя ее достать – она так высоко. (Девочка берет палку и смотрит на конфету.) У папы тоже большой шкаф, и он и иногда не может достать вещи. Нет, я не могу достать ее рукой, я еще маленькая. Лучше встану на табурет. (Забирается на табурет, размахивает палкой, которая стукает по буфету.) Тук-тук! (Девочка смеется. Взглянув на конфету, она берет палку и сбрасывает конфету с буфета.) Вот! Палка ее достала. Я возьму эту палку с собой».\n\nЛ.С. Выготский уделял особое внимание тому, каким образом кажущаяся эгоцентрической речью ребенка в задачах, подобных этой, начинает сопровождать, а затем планировать его действия. Он показал, что в какой-то момент в ходе решения подобных задач речь перестает лишь просто сопровождать действие и начинает организовывать поведение. Короче говоря, она приобретает «инструментальную» функцию, характерную для детей старшего возраста и взрослых.\n\nЭта же самая идея была использована А.В. Запорожцем при изучении различных форм произвольного двигательного поведения у детей разного возраста. Он установил, что у детей постепенно естественные, бессознательные движения превращаются в инструментальные, сознательные, причем этот процесс можно наблюдать очень четко, если поставить ребенка в условия, когда для успешного выполнения задачи ему приходится руководствоваться внешними правилами.\n\nНапример, произвольный прыжок проходит следующие стадии развития. У очень маленьких детей прыжок возникает только тогда, когда этого требуют непосредственные условия, включая собственные желания ребенка. Прыжок «просто происходит». Мы не можем его вызвать по инструкции. Затем, постепенно, ребенок начинает пользоваться вспомогательными стимулами, чтобы овладеть собственными движениями. Сначала это внешние вспомогательные стимулы – перед ребенком ставят доску или взрослый дает приказ: «Прыгай!». Позднее ребенок может сам командовать себе шепотом: «Прыгай!». И наконец, может просто подумать: «Прыгай» – и движения возникнут как сознательный акт. В другом случае Л.С. Сахаров, талантливый сотрудник Л.С. Выготского, умерший молодым, применил тот же метод к изучению процесса классификации. Он обнаружил, что номинативная функция слов, кажущаяся постоянной на разных возрастных уровнях, поскольку слова остаются теми же, в действительности претерпевает глубокие изменения. На самых ранних этапах развития слова выражают эмоциональные обобщения, включая не только называемый предмет, но и чувства, вызываемые у ребенка этим предметом. Затем слова начинают относиться к предметам и их конкретным контекстам и лишь позднее – к абстрактным категориям. Этот метод сначала получил название метода Выготского–Сахарова; позже, когда он распространился за рубежом, он стал известен под названием метода Ханфмана-Казанина в честь двух ученых, которые перевели книгу Л.С. Выготского и применили его метод.\n\nВ 1929 г. наша группа занялась изучением «сигнификативной» деятельности. Под этим мы подразумевали путь, которым дети приходят к способности усваивать значение стимулов, которыми им нужно овладеть, создавая тем самым свою собственную «инструментальную» опосредствованную деятельность. Мы просили детей изобретать пиктограммы – рисунки по их собственному выбору, чтобы помочь запоминанию серий абстрактных слов.\n\nОказалось, что маленькие дети не способны создавать условные знаки, которые могут в дальнейшем способствовать запоминанию. Например, четырехлетняя девочка, которую попросили нарисовать что-нибудь, что поможет ей запомнить фразу «Учитель сердится», просто смеялась и чертила на бумаге ничего не значащие линии. Ни ее разговором, ни ее движениями не руководила задача запоминания, и они не выражали инструментального отношения друг к другу. Она забыла не только саму фразу, но и цель всей работы.\n\nДети постарше могли уже не только рисовать рисунки, отражающие существенный элемент фразы (так, глухой мальчик был изображен в виде головы без ушей), но и давали интересные объяснения. Как отмечал Л.С. Выготский, дети, закончив рисунок, обращались к эксперирастерную черту «привлекающая внимание» речь уже не обращалась к взрослому. Вместо этого она «уходила внутрь», и ребенок пользовался ею, чтобы направлять свою собственную деятельность.\n\nС точки зрения современной психологии исследования, которые мы проводили в то время, теперь расценили бы как студенческие. Однако в то время общая концепция, объединявшая эти исследования, заложила методологическую базу новой психологической теории, и на ее основе был создан ряд экспериментальных методик, которые я применял в течение всей моей последующей деятельности. Студенты и молодые сотрудники Л.С. Выготского, которые проводили эту работу, стали со временем играть большую роль в развитии советской психологии, продолжая эти ранние попытки разнообразными усложненными путями.\n\nБлагодаря моему сотрудничеству с Л.С. Выготским и остроумным работам наших студентов в мою собственную работу постоянно вносились изменения. Одновременно с работой в новом направлении я по-прежнему вел исследования с применением сопряженной моторной методики. Однако, как это явствует из «The Nature of Human Conflicts» (N.Y., 1932), фокус моей работы начал смещаться. Как уже говорилось выше, я начинал с изучения динамики эмоций. Л.С. Выготский увидел в моих исследованиях модель для изучения взаимоотношений между произвольными движениями и речью. Он считал, что эта методика может показать, каким образом речь служит инструментом для организации поведения. В последние главы «The Nature of Human Conflicts» я включил некоторые из моих ранних исследований по развитию регулирующей роли речи, но лишь много лет спустя эта тема стала центральной в моей работе.Лурия А.Р. Этапы пройденного пути: Научная автобиография. М.: Изд-во Моск. ун-та, 2001. С. 26-39",
        "Название примера": "Для того чтобы преодолеть кризис психологии и заложить основы новой теории Выготский изучал смежные области, анализировал современников, изучал все предыдущие достижения и проводил самостоятельные исследования.",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Кризис психологии",
                "преобразование": "Кризис в научной области",
                "результат": "3"
            }
        ]
    },
    {
        "Текст примера": "Если бы времена были другими, эти проблемы могли бы решиться естественным образом в ходе развития теории. В частности, гипотетически Лурия мог бы совместно с советскими этнографами разработать такой подход к кросс-культурным исследованиям, который удовлетворял бы методологическим критериям, применяемым в их интракультурных исследованиях. Однако времена вне всяких сомнений были непростыми. В Советском Союзе в середине 1930-х гг. исследования Лурии были раскритикованы по политическим соображениям как оскорбляющие интеллектуальные способности строителей социализма в советской Центральной Азии [15]. Одновременно с этим Выготский и его коллеги попали под шквал критики за психологическое тестирование школьников, а также за недостаточно яростные нападки на «буржуазную» западноевропейскую ёи американскую психологию. В этих условиях Лурия не мог и помыслить о том, чтобы стать специалистом по этнографии и смежным дисциплинам, которые наверняка понадобились бы для полноценного развития кросс-культурного направления его научной работы. В 1934 году Выготский скончался от туберкулеза. Леонтьев, вместе с Выготским и Лурией стоявший у истоков нового сектора психологии в Харькове, остался на Украине разрабатывать интересовавшую его тематику обучения и развития. Лурия провел некоторое время в Харькове, но затем вернулся в Москву и занялся тем, что в конце концов принесло ему мировую славу. Он поступил в медицинский университет, а по его окончании, в 1937 г., провел два года в интернатуре Института нейрохирургии им. Бурденко, где начал разрабатывать психологические методики диагностики травм головы. С этого времени и до конца жизни он посвящал львиную долю своей энергии именно этому направлению своей научной работы, которое сделало его всемирно известным. Моя основная мысль, к которой я возвращаюсь в конце этой части, заключается в том, что уход Лурии в медицинскую психологию не был актом отречения от полутора десятков лет усилий по созданию комплексной, всеобъемлющей психологической школы. Скорее, это был прагматический ход для продолжения научных изысканий, начатых еще в 1920-х гг.\n\nКоул, М. Александр Романович Лурия и культурная психология // Культурно-историческая психология. — 2013. — Т. 9. — № 2. — С. 88–98.",
        "Название примера": "Для того, чтобы продолжать исследование в контексте репрессий на кросс-культурные исследования, нужно найти более прагматичную, неполитизированную область для работы, например, медицину",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Реперессий в отношении Лурии за кросс-культурные исследования",
                "преобразование": "В случае репрессий",
                "результат": "Воспроизводимость (0 ... 10)"
            }
        ]
    },
    {
        "Текст примера": "Несмотря на столь обширную научную деятельность, Лурия называл эти годы периодом творческого застоя после энтузиазма 1920-х годов. Такую оценку можно объяснить несколькими причинами. Одной из них является официальный провал культурно-психологической экспедиции в Среднюю Азию. В 1932 году, после второй экспедиции, Лурия и Выготский стали мишенью кампании идеологической критики. Более того, специальная комиссия в Институте психологии пригрозила более суровыми репрессиями, если дальнейшие исследования будут отклоняться от идеологической линии. Вскоре после этого появилось постановление под названием «О Культурно-Исторической Теории Выготского и Лурии», которое имело откровенно негативный характер. В нем указывалось, что теория является «реакционной и враждебной доктрине марксизма» и выражает идеи, вредные для социального и культурного развития Узбекистана.\n\nПоскольку политическая атмосфера в стране становилась все более и более репрессивной, Лурия был вынужден отреагировать на постановление, покинув Институт и прекратив свою психолого-этнографическую деятельность. Вскоре после этого ситуация усугубилась печально известным постановлением о педологии, обвинявшим всех психологов и учителей, следующих этому направлению, в некомпетентности и расизме, а также запрещавшим применение тестов для психологических исследований на детях. На протяжении многих лет это постановление тормозило развитие советской психологии. Выготский и его последователи были поглощены запретами и ложными обвинениями, что особенно сильно затронуло Лурию.\n\nВ 1932 году Лурия переехал в Харьков, где организовал Отдел психологии в Украинской психоневрологической академии. Спасаясь от растущей критики по поводу среднеазиатской экспедиции, группа сотрудников Лурии, включая Леонтьева, Божович, Запорожца и других, присоединилась к нему в Харькове. Под руководством профессора Рохлина они работали в Психоневрологическом центре, который был недавно создан при психиатрической больнице.\n\nТем временем Лурия был занят разработкой своих первоначальных методов психологического анализа пациентов с локальными поражениями мозга. Одновременно он продолжал некоторую деятельность в Московском психологическом институте и должен был совершать поездки туда и обратно. Он также возобновил свое изучение медицины заочно в Первом Московском медицинском институте; в письмах к родственникам он описывал, что учится и сдает экзамены.\n\nДеятельность в Харькове продолжалась до марта 1934 года. Выготский дважды посещал своих коллег, чтобы принять непосредственное участие в работе. Однако сотрудничество с руководителем Психоневрологической академии оказалось неудачным, и Лурия был вынужден вернуться в Москву. По стечению обстоятельств здоровье Выготского значительно ухудшилось. В то же время Выготский только что основал новую секцию клинической психологии в Государственном институте экспериментальной медицины в Москве, куда его пригласил директор Н. И. Гращенков. Но девятого мая у Выготского внезапно случился приступ туберкулеза, и он был помещен в больницу. Одиннадцатого июня он скончался.\n\nЭто несчастье тяжело отразилось на восприятии Лурией 1930-х годов, лишив его друга и учителя. Кроме того, это восприятие усугублялось сложной ситуацией с научным наследием Выготского. Несмотря на все критические нападки на теорию Выготского, исходившие со страниц многочисленных книг и журналов в то время, Лурия оставался верен своему учителю и считал его одним из основателей отечественной психологии.\n\n***\n\nВернувшись в Москву, Лурия начал работать в Государственном институте экспериментальной медицины (ГИЭМ) и одновременно поступил в Медико-генетический институт (МГИ), которым руководил профессор С. Г. Левит. До 1936 года он продолжал свои исследования близнецов, пока внезапно медико-генетические исследования не были объявлены вне закона. В январе 1937 года Левит и некоторые его коллеги были арестованы. Незадолго до этого, в декабре 1936 года, Лурия покинул ГИЭМ и МГИ, чтобы стать студентом-очником в Первом Московском медицинском институте, что позволило ему избежать ужасной участи.\n\nЛетом 1937 года Лурия с отличием окончил институт, осуществив таким образом мечту своего отца, Романа Альбертовича, увидеть сына врачом. В то же время Лурия переработал свою рукопись, «Природа человеческих конфликтов» (The Nature of Human Conflicts), в докторскую диссертацию и защитил ее в Институте психологии в Тбилиси. В возрасте тридцати четырех лет он был одним из самых молодых профессоров психологии в стране.\n\nПосле окончания Медицинского института Александр Романович обратился к Н. Б. Бурденко, известному нейрохирургу и директору Института нейрохирургии, с просьбой принять его на работу в качестве интерна. Лурия поступил в Институт в то время и проработал там почти без перерывов всю свою жизнь. Первые два года он фактически был интерном и считал это время одним из самых плодотворных в своей карьере. Будучи свободным от организационных забот и не имея персонала, Лурия полностью посвятил себя своей работе и научным исследованиям. Именно в это время он создал свой личный подход к нейропсихологии локальных поражений мозга (Luria, 1982R, p. 22).\n\nВ 1939 году Лурия перешел в Неврологическую клинику на территории ГИЭМ. Будучи заведующим лабораторией экспериментальной психологии, он в основном занимался сосудистыми заболеваниями, но счел эту область слишком ограниченной в качестве модели для изучения церебральной организации психологических процессов, главным образом из-за отсутствия специального оборудования для верификации очагов поражения.\n\nВ период с 1937 по 1941 год, работая преимущественно в области нейропсихологии, Лурия начал свою независимую нейрохирургическую исследовательскую программу, включающую сложные функциональные единицы психики — психологические синдромы. В те годы Лурия разработал свой личный стиль исследования — стиль детектива, ищущего преступника (поврежденную область) в отсутствие каких-либо предварительных наводок, ведущих к цели. Для этого исследования он отказался от стандартных тестовых процедур, применявшихся на Западе для психологической оценки (таких как тесты Симона и Бине, Рейтана и других), и разработал собственную батарею индивидуальных нейропсихологических методов.\n\nПродолжая исследования, начатые с Выготским, Лурия изучал различные формы речевых нарушений у пациентов с локальными поражениями мозга. В то время он пересмотрел общепринятую классификацию афазии, разделенную на сенсорную, моторную, семантическую и амнестическую афазии. Он начал писать первый том своей главной книги, посвященной афазии. Книга была закончена до Второй мировой войны и принесла ему почетное звание доктора медицинских наук после войны. Таким образом, он стал единственным ученым того времени, имевшим две докторские степени: одну по психологии и другую по медицине. Лурия начал свой второй том, посвященный семантической афазии. Однако эта работа так и не была закончена, как и два других тома по двум типам моторной афазии. В более поздние годы Лурия вернулся к проблемам афазии и, опираясь на тщательно собранный им клинический материал, создал новую классификацию афазии и написал ряд монографий на эту тему. Проблема речи, ее патологии и мозговая организация стали одной из центральных тем в работе Лурии.\n\nНачав с исследований в Клиниках Россолимо в Москве, продол[продолжая] в Психоневрологическом институте Украины, а затем в Москве в Институте нейрохирургии, работа Лурии стала этапами в создании новой науки — нейропсихологии. Наряду с этими профессиональными достижениями, 1930-е годы принесли важные изменения в личную жизнь Лурии. В 1933 году он женился на Лане П. Липчиной, которая в то время работала в Институте нейрохирургии, а позже стала известным специалистом по микробиологии и доктором биологических наук. В том же году семья Лурии переехала на улицу Фрунзе, в квартиру, которая стала известна среди их друзей и учеников как «Дом Лурии», славившийся своим гостеприимством. Здесь, в 1938 году, родилась их единственная дочь Лена (Елена). В этом доме Лурия написал почти все свои самые известные монографии.\n\nХомская, Е. Д. (2001). Alexander Romanovich Luria: A Scientific Biography. Kluwer Academic / Plenum Publishers. С. 30-33",
        "Название примера": "Для того чтобы бороться с запретом своей деятельности, Лурия менят область деятельности на более прагматичную, неполитизированную, среди смежных, меняет социальный статус - вместо исследователя, сотрудника становится студентом, переезжает",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "После экспедиции в Среднюю Азию Лурия подпал под идеологическую критику, а затм и под идеологических запрет",
                "преобразование": "Деятель попадает под идеологическую критику и идеологический запрет.",
                "результат": "6"
            }
        ]
    },
    {
        "Текст примера": "Критика Павловской сессии может быть найдена в ряде публикаций только за последние несколько лет. Так, М. Г. Ярошевский, в 1982 году, писал, что, в действительности, Иванов-Смоленский и его последователи не столько углубляли, сколько извращали наследие Павлова, подменяя его механистическим взглядом на функционирование мозга. Эти так называемые ученики Павлова исказили душу его теории и сильно навредили перспективам советской науки.\n\nЛурия, в свою очередь, характеризуя точку зрения Иванов-Смоленского и его последователей, писал, что «некоторые сторонники павловской теории вели себя по очень механической и упрощенной схеме объяснения человеческого поведения, объяснения, которое сводилось лишь к схеме \"стимул-реакция\", подразумевавшей формирование условного рефлекса посредством позитивного подкрепления» (1982г, с. 95).\n\nПодход к принципам высшей нервной деятельности, отстаиваемый Иванов-Смоленским и его последователями, был полностью дискредитирован позже. До этого, многие его последователи считали, что, по их мнению, можно изучать все регуляторы человеческой психики при помощи простой двигательной реакции и зрительного или слухового стимула, созданного посредством инструкции или подкрепления. Спустя несколько лет после сессии, многочисленные лаборатории в различных медицинских и образовательных учреждениях, где изучалась высшая нервная деятельность в соответствии с подходом Иванов-Смоленского, были признаны совершенно бесполезными и закрыты. Было обнаружено, что простая двигательная реакция сама по себе не дифференцирует ни норму, ни патологические случаи, ни различные формы и стадии патологии. Тем не менее, в период с 1950 по 1957 год, многие физиологи изучали высшую нервную деятельность, используя «моторный метод» Иванов-Смоленского, и интерпретировали результаты в терминах «концентрации-иррадиации», «слабости-силы» и «подвижности-инертности» применительно к нервной системе.\n\nПоследствия Павловской сессии серьезно сказались на профессиональной жизни Лурии. Во-первых, его обвинили в том, что он является представителем антипавловского направления в психологии. Другим источником преследования стала кампания против космополитизма, которая, в частности, нападала на представителей таких сфер, как искусство, наука и литература. Центральные газеты были полны статей, отрекающихся от космополитизма. В это время, в борьбе за идеологическую и национальную чистоту науки, многие ученые оказались под ударом. В 1951 году лаборатория Александра Романовича в Институте нейрохирургии имени Бурденко была закрыта. Потрясенный этим событием, Лурия почувствовал, что никогда не сможет вернуться к своей любимой работе.\n\nЧтобы продолжить свою деятельность, Лурия перевелся в Институт дефектологии Академии педагогических наук Российской Федерации, который возглавлял Л. В. Занков. Начало его работы в институте было связано с очередным периодом тревоги. Конец 1952 и начало 1953 года — это время масштабной антисемитской кампании, известной как «Дело врачей», которая специально обвиняла врачей еврейской национальности; среди них были всемирно известные специалисты. Еврейских врачей увольняли из научно-исследовательских институтов, клиник, образовательных учреждений, издательств и так далее. Лурия боялся за себя и за своих родственников.\n\nСмерть Сталина (5 марта 1953 года) прервала этот процесс. Передовая статья в «Правде» от 6 апреля 1953 года охарактеризовала обвинение этих врачей как провокацию. Тем не менее, контракты многих еврейских врачей не были возобновлены.\n\nНесмотря на общую репрессивную социально-политическую атмосферу, Лурия развернул активную деятельность в Институте дефектологии. В качестве вице-президента по научной работе он значительно реорганизовал функции Института.\n\nХомская, Е. Д. (2001). Alexander Romanovich Luria: A Scientific Biography. Kluwer Academic / Plenum Publishers. С. 42-43",
        "Название примера": "При обвинении в принадлежности к антипавловскому движению Лурия переходит работать в институт к своему коллеге и продолжает исследования там",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Обвинение в принадлежности к антипавловскому движении и космополитизме, закрытие лаборотории",
                "преобразование": "При обвинении политизированными учеными в отклонении от идеологически верного учения.",
                "результат": "6"
            }
        ]
    },
    {
        "Текст примера": "Хотя Лурия в 1931 году написал английскому переводчику «Природы человеческих конфликтов» с просьбой удалить ссылки на психоанализ и бихевиоризм из аннотации на обложке книги и любых рекламных материалов, тем самым отказываясь от связи между его публикацией и этими психологическими подходами (предположительно в ответ на подозрение, с которым на них стали смотреть в Советском Союзе)$, позже он открыто признал влияние Юнга на его исследования в тот период. \n\nProctor, H. (2020). Psychologies in revolution: Alexander Luria’s ‘Romantic Science’ and Soviet social history. Palgrave Macmillan. С. 40",
        "Название примера": "Борьба с цензурой - убираем ссылки, что под запретом.",
        "Автор примера": "КАА",
        "triples": [
            {
                "начальное состояние": "Государство реперессирует из-за ссылок в научных материалах на психоанализ",
                "преобразование": "Цензура и репрессии из-за цитирование неугодных гос-ву авторов",
                "результат": "10"
            }
        ]
    },
    {
        "Текст примера": "# Перевод\n\nРон — человек с видением, кинорежиссёр, один из лучших в мире. Но он также режиссёр для писателей. Он действительно хочет понять сюжет и замысел каждой сцены. Он очень тщательно подходит к пониманию того, почему персонаж делает то или иное.\n\nОн взволнованно говорил: «Я думаю, тебе стоит сделать вот так», а я отвечал: «Не уверен, что могу это сделать», — и тогда он говорил: «Просто попробуй». И он оказывался прав.\n\nОн попросил меня написать сцену предложения руки и сердца, которая в итоге стала одной из моих любимых. Я переписывал её, наверное, семьдесят пять раз, и каждый раз слов становилось всё меньше и меньше. Но эта сцена действительно помогла обрести силу, укрепить структуру.\n\nА потом, когда сценарий был готов, мы отправили его Расселу Кроу, и он захотел сниматься.\n\n# Оригинал\n\nRon is a visionary, a filmmaker among the best in the world. But he is also a writer’s director. He really wants to understand the story and the intention of every scene. He’s very thorough about understanding why a character does something.\n\nHe’d get excited and he’d say, “I think you should do this,” and I’d say, “I don’t think I can do this,” and he’d say, “Just try that.” And he’d be right.\n\nHe asked me to write the proposal scene, which turned out to be one of my favorite scenes. I must have rewritten it seventy-five times, and each time there were fewer and fewer words. But the scene really helped to find the strength, the fortification of the structure.\n\nAnd then, when the script was finished, we sent it to Russell Crowe, and he wanted to do it.",
        "Название примера": "Многократная переделка написания сцены под руководством авторитета для улучшения его ключевых параметров",
        "Автор примера": "МАВ",
        "triples": [
            {
                "начальное состояние": "Сценарист находится в состоянии самоограничения, и режиссер это видит",
                "преобразование": "Авторитетный организатор ставит задачу участнику. За счет большей насмотренности и опыта видит, что результат можно улучшить.",
                "результат": "8"
            }
        ]
    },
    {
        "Текст примера": "# Перевод\n\n— Я полагаю, что каждый в вашей съёмочной группе должен иметь базовое представление о том, чего вы хотите, и они стараются оставаться в этих рамках, не уходя в крайности.\n\n— Иногда именно нестандартная идея оказывается именно тем, что нужно. Потому что даже если вы не собираетесь её использовать, она может заставить вас мыслить немного по-другому. Это может изменить ваше собственное восприятие и подтолкнуть к созданию чего-то ещё более интересного.\n\n— Сейчас я чаще всего спрашиваю оператора: «Что ты думаешь? Как бы ты построил этот кадр?» — и сначала смотрю на его идею, прежде чем показать свою. Раньше я всегда показывал оператору композицию, которую хочу, и только потом спрашивал, нравится ли она ему или он видит что-то иначе. Теперь я стараюсь спрашивать его первым, потому что это ставит его в положение соучастника, а не просто исполнителя моих указаний. Иногда я получаю по-настоящему потрясающие сюрпризы.\n\n# Оригинал\n\n- I would think that everybody in your crew would have a basic idea of what you want, and they try to stay within that realm without going off the deep end.\n\n- Sometimes exactly what you need is an off-the-wall idea. Because even if it’s not an idea you want to consider, it may force you to think in a slightly altered mode. It might bend your own perception to come up with something even better.\n\n- Most of the time now, I’ll ask the operator, “What do you think? How would you like to frame this?” and basically look at his idea before I show him what I want. I used to always show the operator the composition I wanted and then ask him whether he liked it or saw something different. Now I try to ask him first because it puts him in a position of being a contributor rather than just doing it the way I want it. Sometimes I get some terrific surprises.",
        "Название примера": "Режиссер спрашивает мнение оператора до того, как покажет свою идею, что ведет к его вовлеченности и появлению творческих решений",
        "Автор примера": "МАВ",
        "triples": [
            {
                "начальное состояние": "Оператор выполнял указания режиссёра, не проявляя инициативы",
                "преобразование": "Авторитарная модель. Участник выполнял задачу без инициативы, следуя указаниям модератора",
                "результат": "8"
            }
        ]
    },
    {
        "Текст примера": "# Перевод\n\nНо Карле полагалось получать удовольствие от еды, и она была голодна. Она приехала в спа-салон на свою тайную встречу с Гвидо (оба были женаты). Первый день работы Мило на съёмочной площадке включал сцену, в которой Гвидо приводит Карлу в небольшое ресторанчик, где она должна есть, пить и разговаривать.\n\n«Первый день был ужасен», — рассказывала Мило Марии Пии Фуско. Ей приходилось работать с незнакомыми репликами, откусывая куски курицы и чередуя еду и слова глотками минеральной воды.\n\n«Это трудно. У меня не получается», — сказала она Феллини.\n\n«Всё наладится», — подбадривал он её, заставляя делать дубль за дублем.\n\nПо мере того как день шёл, она съела шестнадцать куриных ножек, делая несколько перерывов, чтобы сбегать в туалет и вырвать. После шестнадцатой ножки она сообщила Феллини, что дальше не может. Съёмки остановили.\n\nНо на следующий день, когда она проходила мимо проекционной, где Феллини просматривал отснятый материал, он окликнул её: «Давай ещё раз снимем эту сцену, а на этот раз просто делай так, как тебе хочется».\n\n«Я съела всего две куриные ножки, — сказала Мило, — и на этот раз ему понравилась сцена и то, как я её сыграла. И именно так родилась моя новая полная личность — олицетворение чувственности без проблем и сомнений, блондинка, белая, с красными губами, всегда готовыми к поцелую».\n\n# Оригинал\n\nBut Carla was supposed to enjoy eating, and she was hungry. She arrived at the spa for her illicit liaison with Guido (both are married). Milo’s first day on the set involved a scene in which Guido takes Carla to a little restaurant, where she is supposed to be eating, drinking, and talking.\n\n“That first day was awful,” Milo told Maria Pia Fusco. She had to work with unfamiliar lines while biting away at the chicken and interspersing her eating and words with sips from a glass of mineral water.\n\n“It’s hard. I can’t seem to do it,” she told Fellini.\n\n“It’ll all work out,” he encouraged her, as he had her do take after take.\n\nAs the day wound on, she consumed sixteen chicken legs, interrupted by several trips to the restroom to vomit. After the sixteenth chicken leg, she informed Fellini that she could go no further. They stopped.\n\nBut the next day, as she passed the projection room where Fellini was looking at rushes, he called to her. “Let’s do that scene again,” he said, “and this time just do it the way you feel like.”\n\n“I ate only two chicken legs,” Milo said, “and now he liked the scene and the way I did it very well. And with it, my new fat personality was born, representing carnality with no problems, no thought, blonde, white, red mouth always ready to be kissed.”",
        "Название примера": "Режиссер длительно нагружает актрису во время съемок , затем дает ей отдых, затем снимает ограничения и дает ей свободу в сцене, в результате актрисе удается сцена, и образ ее героини приобретает индивидуальные детали",
        "Автор примера": "МАВ",
        "triples": [
            {
                "начальное состояние": "Режиссер не может снять сцену с актрисой в течение первого дня съемок при множестве дублей",
                "преобразование": "Модератору вместе с участником не получается решить задачу после нескольких попыток",
                "результат": "7"
            }
        ]
    },
    {
        "Текст примера": "В японской критике принято традиционно делить фильмы Куросавы на «дзидайгэки» и «гендайгэки» — на исторические и современные. Я тоже старался придерживаться этого, столь характерного для киноискусства Японии, деления. Но поневоле отступаешь от него, так как «Идиот» переносится в современность, а «На дне» отодвигается в средневековье...\n\nЗато вот Шекспир послужил основой для чистейших «дзидайгэки»: «Макбет» стал истинно самурайской трагедией!\n\nВсе же, группируя фильмы Куросавы, придется к традиционным рубрикам прибавить еще одну: **экранизация зарубежной классики**.\n\n<...>\n\nКрупнейший французский историк кино Жорж Садуль, встретившийся с Куросавой в Токио в 1965 году («Синема-65», № 92), спросил Куросаву, почему он снимает то «гэндайгэки», то «дзидайгэки». Куросава ответил:\n\n> «Выбирая современный сюжет, я наталкиваюсь на целый ряд табу и обязательств, поставленных продюсером и касающихся вопросов политики. Когда я хочу рассказать об определенной, волнующей сердце теме, меня принуждают искажать её. Цензура менее строга, если речь идёт об историческом сюжете. Здесь она ровно ничего не понимает, и я пользуюсь относительной свободой».",
        "Название примера": "Для обхода цензуры режиссер переносит современные темы в исторический контекст. Актуальные социальные или политические проблемы показываются через события прошлого, что позволяет говорить о запретных темах под прикрытием исторического сюжета.",
        "Автор примера": "МАВ",
        "triples": [
            {
                "начальное состояние": "Куросава хочет поднять современную, социально значимую тему в фильме, но не может из-за цензуры",
                "преобразование": "Ввиду цензуры автор не может реализовать свою художественную задумку",
                "результат": "7"
            }
        ]
    },
    {
        "Текст примера": "На фильме «Из породы беглецов» я работал с Марлоном Брандо. Он недоверчивый тип. Не знаю, правда, остался ли он таким же, но обычно в первый или второй день съемок он устраивал проверку для режиссера.\n\nОн делал два вроде бы одинаковых дубля. Единственное отличие в том, что в одном из них он действительно работал со своими чувствами и эмоциями, а во втором — просто изображал какие-то внешние их проявления.\n\nПотом смотрел, какой из этих дублей выбирал режиссер. Если неправильный, «внешний», — работе конец. Марлон либо будет играть все оставшиеся сцены кое-как, либо превратит жизнь режиссера в ад, или сделает и то и другое.\n\nНикто не вправе проводить такие эксперименты над людьми, но я могу понять, почему он так поступает. Он не хочет показывать свой внутренний мир человеку, который не способен его увидеть.",
        "Название примера": "Марлон Брандо для проверки квалификации режиссера играет два дубля - качественный и халтурный",
        "Автор примера": "МАВ",
        "triples": [
            {
                "начальное состояние": "В начале работы над фильмом актер хочет понять уровень режиссера",
                "преобразование": "Участник коллектива хочет понять уровень модератора перед началом работы",
                "результат": "8"
            }
        ]
    }
]