[
  {
    "№": "30",
    "АВТОР": "МАВ",
    "Дата": "14/11/25",
    "Исходный пример": "# Перевод\n\nРон — человек с видением, кинорежиссёр, один из лучших в мире. Но он также режиссёр для писателей. Он действительно хочет понять сюжет и замысел каждой сцены. Он очень тщательно подходит к пониманию того, почему персонаж делает то или иное.\n\nОн взволнованно говорил: «Я думаю, тебе стоит сделать вот так», а я отвечал: «Не уверен, что могу это сделать», — и тогда он говорил: «Просто попробуй». И он оказывался прав.\n\nОн попросил меня написать сцену предложения руки и сердца, которая в итоге стала одной из моих любимых. Я переписывал её, наверное, семьдесят пять раз, и каждый раз слов становилось всё меньше и меньше. Но эта сцена действительно помогла обрести силу, укрепить структуру.\n\nА потом, когда сценарий был готов, мы отправили его Расселу Кроу, и он захотел сниматься.",
    "ФАКТУРА?": "FALSE",
    "Название примера": "Многократная переделка написания сцены под руководством авторитета для улучшения его ключевых параметров",
    "СВЯЗКА 1 - МЕТРИКИ": "8",
    "СВЯЗКА 2": null,
    "СВЯЗКА 2 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 2 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 3": null,
    "СВЯЗКА 3 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 3 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 4": null,
    "СВЯЗКА 4 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 4 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 1 - initial_state": "Сценарист находится в состоянии самоограничения — он сдерживает свои идеи, чувства или творческую свободу.",
    "СВЯЗКА 1 - transformation": "Режиссер наблюдает за сценаристом и замечает его внутреннее напряжение и ограниченность.",
    "СВЯЗКА 1 - result": "Режиссер осознаёт, что сценарист находится в состоянии самоограничения, что может повлиять на их совместную работу.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Авторитетный организатор ставит задачу участнику.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Организатор, опираясь на свой опыт и насмотренность, замечает возможность улучшения результата.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Результат выполнения задачи может быть улучшен."
  },
  {
    "№": "31",
    "АВТОР": "МАВ",
    "Дата": "14/11/25",
    "Исходный пример": "# Перевод\n\n— Я полагаю, что каждый в вашей съёмочной группе должен иметь базовое представление о том, чего вы хотите, и они стараются оставаться в этих рамках, не уходя в крайности.\n\n— Иногда именно нестандартная идея оказывается именно тем, что нужно. Потому что даже если вы не собираетесь её использовать, она может заставить вас мыслить немного по-другому. Это может изменить ваше собственное восприятие и подтолкнуть к созданию чего-то ещё более интересного.\n\n— Сейчас я чаще всего спрашиваю оператора: «Что ты думаешь? Как бы ты построил этот кадр?» — и сначала смотрю на его идею, прежде чем показать свою. Раньше я всегда показывал оператору композицию, которую хочу, и только потом спрашивал, нравится ли она ему или он видит что-то иначе. Теперь я стараюсь спрашивать его первым, потому что это ставит его в положение соучастника, а не просто исполнителя моих указаний. Иногда я получаю по-настоящему потрясающие сюрпризы.",
    "ФАКТУРА?": "FALSE",
    "Название примера": "Режиссер спрашивает мнение оператора до того, как покажет свою идею, что ведет к его вовлеченности и появлению творческих решений",
    "СВЯЗКА 1 - МЕТРИКИ": "8",
    "СВЯЗКА 2": null,
    "СВЯЗКА 2 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 2 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 3": null,
    "СВЯЗКА 3 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 3 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 4": null,
    "СВЯЗКА 4 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 4 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 1 - initial_state": "Оператор находился в роли исполнителя, подчиняясь режиссёрскому руководству.",
    "СВЯЗКА 1 - transformation": "Он выполнял только те указания, которые давал режиссёр, не предлагая собственных идей или решений.",
    "СВЯЗКА 1 - result": "В результате оператор не проявил инициативы, полностью полагаясь на режиссёрские инструкции.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Авторитарная модель взаимодействия, при которой модератор полностью контролирует процесс, а участник пассивен.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Участник выполнял поставленную задачу строго по указаниям модератора, не проявляя собственной инициативы.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Формальное выполнение задачи без творческого вклада или самостоятельных решений со стороны участника."
  },
  {
    "№": "32",
    "АВТОР": "МАВ",
    "Дата": "14/11/25",
    "Исходный пример": "# Перевод\n\nНо Карле полагалось получать удовольствие от еды, и она была голодна. Она приехала в спа-салон на свою тайную встречу с Гвидо (оба были женаты). Первый день работы Мило на съёмочной площадке включал сцену, в которой Гвидо приводит Карлу в небольшое ресторанчик, где она должна есть, пить и разговаривать.\n\n«Первый день был ужасен», — рассказывала Мило Марии Пии Фуско. Ей приходилось работать с незнакомыми репликами, откусывая куски курицы и чередуя еду и слова глотками минеральной воды.\n\n«Это трудно. У меня не получается», — сказала она Феллини.\n\n«Всё наладится», — подбадривал он её, заставляя делать дубль за дублем.\n\nПо мере того как день шёл, она съела шестнадцать куриных ножек, делая несколько перерывов, чтобы сбегать в туалет и вырвать. После шестнадцатой ножки она сообщила Феллини, что дальше не может. Съёмки остановили.\n\nНо на следующий день, когда она проходила мимо проекционной, где Феллини просматривал отснятый материал, он окликнул её: «Давай ещё раз снимем эту сцену, а на этот раз просто делай так, как тебе хочется».\n\n«Я съела всего две куриные ножки, — сказала Мило, — и на этот раз ему понравилась сцена и то, как я её сыграла. И именно так родилась моя новая полная личность — олицетворение чувственности без проблем и сомнений, блондинка, белая, с красными губами, всегда готовыми к поцелую».",
    "ФАКТУРА?": "FALSE",
    "Название примера": "Режиссер длительно нагружает актрису во время съемок , затем дает ей отдых, затем снимает ограничения и дает ей свободу в сцене, в результате актрисе удается сцена, и образ ее героини приобретает индивидуальные детали",
    "СВЯЗКА 1 - МЕТРИКИ": "7",
    "СВЯЗКА 2": null,
    "СВЯЗКА 2 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 2 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 3": null,
    "СВЯЗКА 3 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 3 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 4": null,
    "СВЯЗКА 4 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 4 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 1 - initial_state": "Режиссёр сталкивается с трудностями при съёмке сцены с актрисой в первый день съёмок.",
    "СВЯЗКА 1 - transformation": "Происходит множество дублей, в ходе которых режиссёр пытается добиться нужного результата, но сцена не удаётся.",
    "СВЯЗКА 1 - result": "К концу первого дня съёмок сцена так и не была успешно снята.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Модератор и участник столкнулись с задачей, требующей совместного решения.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Они предприняли несколько попыток решить задачу вместе, но каждый раз сталкивались с трудностями.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Им так и не удалось успешно решить задачу."
  },
  {
    "№": "33",
    "АВТОР": "МАВ",
    "Дата": "14/11/25",
    "Исходный пример": "В японской критике принято традиционно делить фильмы Куросавы на «дзидайгэки» и «гендайгэки» — на исторические и современные. Я тоже старался придерживаться этого, столь характерного для киноискусства Японии, деления. Но поневоле отступаешь от него, так как «Идиот» переносится в современность, а «На дне» отодвигается в средневековье...\n\nЗато вот Шекспир послужил основой для чистейших «дзидайгэки»: «Макбет» стал истинно самурайской трагедией!\n\nВсе же, группируя фильмы Куросавы, придется к традиционным рубрикам прибавить еще одну: **экранизация зарубежной классики**.\n\n<...>\n\nКрупнейший французский историк кино Жорж Садуль, встретившийся с Куросавой в Токио в 1965 году («Синема-65», № 92), спросил Куросаву, почему он снимает то «гэндайгэки», то «дзидайгэки». Куросава ответил:\n\n> «Выбирая современный сюжет, я наталкиваюсь на целый ряд табу и обязательств, поставленных продюсером и касающихся вопросов политики. Когда я хочу рассказать об определенной, волнующей сердце теме, меня принуждают искажать её. Цензура менее строга, если речь идёт об историческом сюжете. Здесь она ровно ничего не понимает, и я пользуюсь относительной свободой».",
    "ФАКТУРА?": "FALSE",
    "Название примера": "Для обхода цензуры режиссер переносит современные темы в исторический контекст. Актуальные социальные или политические проблемы показываются через события прошлого, что позволяет говорить о запретных темах под прикрытием исторического сюжета.",
    "СВЯЗКА 1 - МЕТРИКИ": "7",
    "СВЯЗКА 2": null,
    "СВЯЗКА 2 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 2 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 3": null,
    "СВЯЗКА 3 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 3 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 4": null,
    "СВЯЗКА 4 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 4 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 1 - initial_state": "Куросава хочет поднять современную, социально значимую тему в фильме.",
    "СВЯЗКА 1 - transformation": "Он сталкивается с ограничениями со стороны цензуры, которая не позволяет ему свободно выражать социальную критику в кино.",
    "СВЯЗКА 1 - result": "Куросава не может реализовать свою идею из-за цензуры.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Автор имеет художественную задумку, которую хочет реализовать в своём творчестве.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "На пути реализации возникает цензура, которая ограничивает свободу выражения автора.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Автор не может в полной мере или вовсе не может реализовать свою художественную задумку."
  },
  {
    "№": "34",
    "АВТОР": "МАВ",
    "Дата": "14/11/25",
    "Исходный пример": "На фильме «Из породы беглецов» я работал с Марлоном Брандо. Он недоверчивый тип. Не знаю, правда, остался ли он таким же, но обычно в первый или второй день съемок он устраивал проверку для режиссера.\n\nОн делал два вроде бы одинаковых дубля. Единственное отличие в том, что в одном из них он действительно работал со своими чувствами и эмоциями, а во втором — просто изображал какие-то внешние их проявления.\n\nПотом смотрел, какой из этих дублей выбирал режиссер. Если неправильный, «внешний», — работе конец. Марлон либо будет играть все оставшиеся сцены кое-как, либо превратит жизнь режиссера в ад, или сделает и то и другое.\n\nНикто не вправе проводить такие эксперименты над людьми, но я могу понять, почему он так поступает. Он не хочет показывать свой внутренний мир человеку, который не способен его увидеть.",
    "ФАКТУРА?": "FALSE",
    "Название примера": "Марлон Брандо для проверки квалификации режиссера играет два дубля - качественный и халтурный",
    "СВЯЗКА 1 - МЕТРИКИ": "8",
    "СВЯЗКА 2": null,
    "СВЯЗКА 2 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 2 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 3": null,
    "СВЯЗКА 3 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 3 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 4": null,
    "СВЯЗКА 4 - АБСТРАКЦИЯ": null,
    "СВЯЗКА 4 - МЕТРИКИ": "Воспроизводимость (0 ... 10)",
    "СВЯЗКА 1 - initial_state": "Актёр начинает работу над фильмом и не имеет достаточного представления о профессиональном уровне режиссёра.",
    "СВЯЗКА 1 - transformation": "Актёр наблюдает за работой режиссёра, изучает его методы, стиль руководства и художественный подход к процессу съёмок.",
    "СВЯЗКА 1 - result": "Актёр формирует чёткое понимание уровня режиссёра, что позволяет ему выстроить эффективное взаимодействие на съёмочной площадке.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - initial_state": "Участник коллектива не знает уровень модератора и хочет в этом разобраться перед началом совместной работы.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - transformation": "Он анализирует опыт, поведение или компетенции модератора, возможно, через наблюдение, вопросы или проверку его предыдущих действий.",
    "СВЯЗКА 1 - АБСТРАКЦИЯ - result": "Участник формирует чёткое представление об уровне модератора, что позволяет ему строить ожидания и эффективно взаимодействовать в дальнейшем."
  }
]