{
  "extractor.predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "Извлеки из текста ЦЕНТРАЛЬНУЮ причинно-следственную связь или связь задача-решение, которая отражает ГЛАВНУЮ ИДЕЮ фрагмента.\n\nТРЕБОВАНИЯ:\n\n1. СФОКУСИРУЙСЯ НА МАКРО-УРОВНЕ: Определи основную тему, проблему или достижение, о которых идет речь в тексте, а не второстепенный детальный механизм.\n\n2. ОБЯЗАТЕЛЬНО ВКЛЮЧАЙ КОНТЕКСТ-УКАЗАТЕЛИ: Используй ТОЛЬКО конкретные названия из текста:\n   - Имена исследователей, авторов (например: Лурия, Корнилов, Леонтьев, Фрейд, Юнг, Макс Вертгеймер, Хорсли Гант, Адольф Майер, Билл Уильямс)\n   - Организации и институты (ATLAS, CMS, CERN, GC&CS, Блетчли-Парк, Хиб 3, MI14, Объединённый разведывательный отдел Внутренних войск, COSSAC, SHAEF)\n   - Локации (Казань, Москва, Вашингтон, Исткот)\n   - Ключевые системы и методы (сопряженная моторная методика, динамоскоп, механограмма, машины «бомба», Colossus, Robinson, all-source analysis, критические слова)\n   - Должности и роли (криптоаналитики, аналитики из Хижины 3)\n\n3. ФОРМАТ ВЫВОДА: Одно предложение (10-15 слов), БЕЗ точки в конце, которое может служить заголовком/аннотацией текста и однозначно идентифицирует его содержание.\n\n4. ЧЕГО ИЗБЕГАТЬ:\n   - Не описывай только технический механизм без указания субъекта и контекста\n   - Не выбирай второстепенную причинно-следственную цепь вместо главной\n   - Не будь слишком общим или абстрактным\n   - Не игнорируй мета-уровень (о чем ЭТОТ ТЕКСТ как целое)\n\n5. ПРИОРИТЕТЫ:\n   - Приоритет 1: Главная организационная/исследовательская проблема и её решение\n   - Приоритет 2: Ключевое достижение или вывод\n   - Приоритет 3: Уникальная методология (если она — центральная тема)\n\nПример правильного подхода: Вместо \"Эмоции искажают кривую движений\" (слишком узко) → \"Лурия использовал сопряженную моторную методику для объективного изучения эмоций в реальных жизненных ситуациях\" (отражает субъект, метод, цель и контекст).",
      "fields": [
        {
          "prefix": "Text Fragment:",
          "description": "Текст для извлечения причинно-следственных связей"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Causal Relation:",
          "description": "Одно предложение с причинно-следственными связями до 20 слов без точки в конце"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
